"{\"documents\": [{\"id\": \"0dfdee6d-4550-11ea-bdd7-60f6774aa532\", \"language\": \"en\", \"text\": \"Your take on the Leg Tuck:\\n>you are not allowed more than a 15% rotation left or right\\n\\n\\nArmy.mil take on the Leg Tuck:\\n>twisting of the trunk is permitted\\n\\n\\nMy unit's take on the Leg Tuck:\\n>parallel to the bar or the rep doesn't count\\n\\nBasically, what the fuck.\"}, {\"id\": \"0dfdee72-4550-11ea-b442-60f6774aa532\", \"language\": \"en\", \"text\": \"Sir, this is a del taco\"}, {\"id\": \"0dfdee75-4550-11ea-8fd9-60f6774aa532\", \"language\": \"en\", \"text\": \"Cool brief sir, where\\u2019s the sign in roster?\"}, {\"id\": \"0dfdee76-4550-11ea-94b3-60f6774aa532\", \"language\": \"en\", \"text\": \"Funny how the created the\\\"combat' fitness test after combat was over. Army, go home your drunk.\"}, {\"id\": \"0dfdee79-4550-11ea-9e69-60f6774aa532\", \"language\": \"en\", \"text\": \"Push-ups are the new 2-mile. Doing one leg-tuck to pass is simple enough. Those push-ups are killing people though. Fuckin hilarious.\"}, {\"id\": \"0dfdee7c-4550-11ea-9849-60f6774aa532\", \"language\": \"en\", \"text\": \"> dropping or bouncing weight.\\n\\nso graders are a bunch of soy boys\"}, {\"id\": \"0dfdee7f-4550-11ea-a4fa-60f6774aa532\", \"language\": \"en\", \"text\": \"Yeah sorry man I was just hoping you knew which way Walmart was.\"}, {\"id\": \"0dfdee81-4550-11ea-ab3c-60f6774aa532\", \"language\": \"en\", \"text\": \"Can you please go into a little more detail.\"}, {\"id\": \"0dfdee82-4550-11ea-9e1a-60f6774aa532\", \"language\": \"en\", \"text\": \"Your TLDR doesn\\u2019t mesh with what we are seeing on active duty side.  The lowest scores and most failures are coming from leg tucks and standing power throw.  Sprint drag carry is probably one of the easier portions to max.\"}, {\"id\": \"0dfe1557-4550-11ea-aa2e-60f6774aa532\", \"language\": \"en\", \"text\": \"> Row : 5K in 25min \\n\\n> supinated grip\\n\\nOh no baby what is you doin\"}, {\"id\": \"0dfe1559-4550-11ea-84c6-60f6774aa532\", \"language\": \"en\", \"text\": \">So... this shit is happening, for obvious reasons a lot of people still don't think it is real but, the NSN for equipment is in FEDLOG so, game over folks.\\n\\nWeird because I heard the other day it's been delayed a year because of issues with females and the leg tuck, costs, and the amount of equipment that actually has to be manufactured.\\n\\nJust because it's in FEDLOG doesn't mean it's happening. I mean cocaine has an NSN and we still piss test people.\"}, {\"id\": \"0dfe155b-4550-11ea-88a5-60f6774aa532\", \"language\": \"en\", \"text\": \"I don\\u2019t come to Reddit to read 10 paragraphs in a post. My response to the first 2 sentences though is that we all know this is happening.\"}, {\"id\": \"0dfe155c-4550-11ea-be4a-60f6774aa532\", \"language\": \"en\", \"text\": \"I took this yesterday and scored a something like a 473 - the leg tucks and pushups were my worst events. I had a couple of observations that I was looking to share and this is better than a new post. \\n\\nDeadlifts: you need to come into this event knowing exactly how much you\\u2019re going to lift. I had no frame of reference and ended up doing like 12 reps during the warms ups plus another 6 during the event. I\\u2019m feeling this hard today in my back and I know that it burned way too much energy with all of the reps. My recommendation is do a 3 rep warmup and do your target weight and get out of there. \\n\\nStanding power throw: tougher than it looks, no real tips here. \\n\\nHR Pushups: 2 mins doesn\\u2019t seem like enough time to max this, and there\\u2019s not much opportunity to rest without getting to muscle failure faster. There is a technique here, I just haven\\u2019t really figured it out yet. This one requires a lot of practice to get the hand movement down. \\n\\nSprint Drag Carry: the first time you grab that sled and pull, it\\u2019s a huge wake up call to your body. But, even more than that are the transitions at each of the turn arounds. My recommendation is to train those transition points separate from the 25m movements and you\\u2019ll shave off a lot of time. \\n\\nAt this point, I highly recommend eating something - preferably an orange. You will preform better on the run if you can replenish some glycogen in your muscles (assuming you\\u2019ve been giving max effort). Eating it now will give you just enough time for it to digest and absorb. But also, eating an orange right now will make your hands a little sticky which helps on the leg tuck. \\n\\nLeg tuck: I knew since it was announced that this was going to be my worst event. I\\u2019m a big guy and have never been good at pull ups in general. For the past couple of months, I\\u2019ve been working some kind of pull-up/leg tuck into the end of my workouts while I\\u2019m already tired so it replicates its position in the testing. There is some room for subjectivity in whether or not your knees are touching your elbows (or whatever) so help your grader by not disengaging too quickly. I did 6 but only had 3 count. \\n\\nTwo mile run: just because you get 21 minutes or whatever, doesn\\u2019t mean you should take any special care to throttle back. Still give best effort because it will be slower than you\\u2019re used to. \\n\\nIn all, I\\u2019m a big fan of the test. As long as your units don\\u2019t try to regiment it, it\\u2019s a pretty fun PT session. I\\u2019d love to see units make it into that with music, bring families out, etc. it\\u2019s almost like doing the CrossFit games with each other. I think it\\u2019s going to take a while for everyone to get used to it, but it\\u2019s a very positive change overall.\"}, {\"id\": \"0dfe155f-4550-11ea-95fc-60f6774aa532\", \"language\": \"en\", \"text\": \"Conspiracy theory: the ACFT is the Army's big middle finger reply to politicians that have forced gender neutrality on the force.  \\n\\nArmy replies by doubling the number of events and making them all gender- and age-neutral standards under the guise of, \\\"it will be healthier for the force!\\\".  It doesn't look difficult to just pass now, but I'm pretty sure the trigger pullers are going to have the ability to set and enforce higher minimum scores.\"}, {\"id\": \"0dfe1561-4550-11ea-b86c-60f6774aa532\", \"language\": \"en\", \"text\": \"I can't wait for the new test to hit. All you 5'8 135 lb guys that use to kill it are going to have a lot of fun lifting for the first time.\"}, {\"id\": \"0dfe1562-4550-11ea-8ddf-60f6774aa532\", \"language\": \"en\", \"text\": \"I recently did one for a high level BWC, did the T pushup. \\n\\nAlso the throw seems to pretty variable. Saw some people max with minimal effort. Seems to have to do a lot more with technique than anything.\\n\\nPretty much no one didn't max the sprint/drag/carry. The limits are generous and if you know the order and execute everything correctly you can pretty much jog it.\"}, {\"id\": \"0dfe1565-4550-11ea-b998-60f6774aa532\", \"language\": \"en\", \"text\": \"> Two Mile looped or down and back course - no more straight shots  \\n  \\nThis is dumb i thought most combat is running straight shots not in circles\"}, {\"id\": \"0dfe1566-4550-11ea-a722-60f6774aa532\", \"language\": \"en\", \"text\": \"Maybe I'm getting old, but I didn't understand the bit about the pronouns in the beginning... was it a joke?\"}, {\"id\": \"0dfe1568-4550-11ea-a952-60f6774aa532\", \"language\": \"en\", \"text\": \"Good info\"}, {\"id\": \"0dfe1569-4550-11ea-8d57-60f6774aa532\", \"language\": \"en\", \"text\": \"Thanks for the info.\"}, {\"id\": \"0dfe156a-4550-11ea-9f92-60f6774aa532\", \"language\": \"en\", \"text\": \"Good write up, Thanks!\"}, {\"id\": \"0dfe156b-4550-11ea-ab14-60f6774aa532\", \"language\": \"en\", \"text\": \"Sponsor Best Ranger every year - as part of one of the Todd Field events the remaining teams were conducting the almost finalized version of the events (this is on day 2 after going for 24 hrs) and there was a 4 star and a few of his 'less than fit' staff walking around with him as they were observing.  \\n\\nHeard it from some instructors that they were tracking the scores of these competitors to get baseline counts for repetitions and time to see how the current Army scoring was going to work against a normal Joe to see if they can meet minimal scoring requirements vs. BRC monsters after 24 hours of being smoked....\\n\\nWhen I say 'less than fit' - I could tell they were not excited about taking these events...\"}, {\"id\": \"0dfe156c-4550-11ea-842e-60f6774aa532\", \"language\": \"en\", \"text\": \"Gayness afoot\"}, {\"id\": \"0dfe156d-4550-11ea-923f-60f6774aa532\", \"language\": \"en\", \"text\": \"I saw people who were unprepared/hadn\\u2019t ever actually done it, had the hardest time with the pull up bar thing.\"}, {\"id\": \"0dfe156e-4550-11ea-803c-60f6774aa532\", \"language\": \"en\", \"text\": \"So...many...graders Jesus Christ\"}, {\"id\": \"0dfe1570-4550-11ea-a408-60f6774aa532\", \"language\": \"en\", \"text\": \"Anyone know if there are scoring standards for functional area AOCs, or do we have to go with our basic branch categories? Asking for a friend...\"}, {\"id\": \"0dfe1571-4550-11ea-8be3-60f6774aa532\", \"language\": \"en\", \"text\": \"[removed]\"}, {\"id\": \"0dfe1573-4550-11ea-8800-60f6774aa532\", \"language\": \"en\", \"text\": \"Downvote all you want, but the ACFT is a stupid test designed by out of touch leadership. This is going to absolutely screw over guard, reserve, and ROTC units, such as the one I am in (Yes, fuck cadets, I know). How are we, as far flung and dispersed units, supposed to train for this? Sadly enough, I don't have access to a training sled nor can I just walk into a gym throwing medicine balls over my head like units at big army bases might have access to. I am willing to put money on the fact that in a few years, this test will result in skyrocketing rates of back injury from the deadlift and rotator cuff injury from hand release pushups (much worse than regular) and the purging of experienced senior leaders with worn down bodies. The APFT is not perfect, and I am not saying it is or that it shouldn't be changed, but the ACFT will be a disaster that forgets to take into consideration time, expense, and accessibility.\"}, {\"id\": \"0dfe157b-4550-11ea-a9d4-60f6774aa532\", \"language\": \"en\", \"text\": \"God this is so fucking gay\"}, {\"id\": \"0dfe157c-4550-11ea-8b5f-60f6774aa532\", \"language\": \"en\", \"text\": \"Ha, I know who you are.\"}, {\"id\": \"0dfe3c5c-4550-11ea-af1f-60f6774aa532\", \"language\": \"en\", \"text\": \"I assume they won\\u2019t be allowed but anything written that specificity disallow weight belts and grips?  Also there was a rumor here that you were only allowed 2 pairs of shoes during the test.\"}, {\"id\": \"0dfe3c5e-4550-11ea-a8e8-60f6774aa532\", \"language\": \"en\", \"text\": \"Took it the other day, wasn't too bad. I suck at that stupid ball throw, but otherwise it's fine. \\n\\nJust gotta get ppl practicing and if they have the equipment you can easily make workouts using the events for PT.\\n\\nThanks for the write up!\"}, {\"id\": \"0dfe3c5f-4550-11ea-ae77-60f6774aa532\", \"language\": \"en\", \"text\": \"Does anyone know if the deadlift is with or without the handles?\"}, {\"id\": \"0dfe3c61-4550-11ea-a7f9-60f6774aa532\", \"language\": \"en\", \"text\": \"I'm still sitting here wondering why being an aircraft pilot is in the black category for fitness. About the only thing we lift is our coffee cups in the morning.\"}, {\"id\": \"0dfe3c63-4550-11ea-806a-60f6774aa532\", \"language\": \"en\", \"text\": \"Just had two MFT in my company get level III certified from an mtt from FtJackson four weeks ago and they specifically mentioned you CAN cup your hands under the ball, catapult style. What gives?\"}, {\"id\": \"0dfe3c65-4550-11ea-99b8-60f6774aa532\", \"language\": \"en\", \"text\": \"Someone enlighten me as to WHY of ACFT. Like, why the fuck is it a thing now and not in 2001 where it might actually be SOMEWHAT beneficial?\"}, {\"id\": \"0dfe3c66-4550-11ea-b6ed-60f6774aa532\", \"language\": \"en\", \"text\": \"10 minutes to warm up for a max deadlift...\\n\\nI pull 135 for 10 2x just to get moving.  220 for 5.  315 for 5.  405 for 3.  Put on 415 or 420 depending on how I feel.  That warm up takes me more than 10 minutes and pulling over 400 for reps is quite taxing.\\n\\nI dont know how people are going to max deadlift and have anything left for the rest of it.  I guess accept a bad dead lift score and save yourself for the rest.\"}, {\"id\": \"0dfe3c68-4550-11ea-a4d5-60f6774aa532\", \"language\": \"en\", \"text\": \"Dumb question.  Does the Hexbar weight standards for Black Silver Gold, include the 45lb bar or no?\"}, {\"id\": \"0dfe3c6a-4550-11ea-8c84-60f6774aa532\", \"language\": \"en\", \"text\": \"Question: I go to blc in march. Do you think I'll be taking the apft or the acft? Also someone told me there might be no PT test at all when I go because of the transition. Just wondering so I can start prepping now\"}, {\"id\": \"0dfe3c6b-4550-11ea-a9fc-60f6774aa532\", \"language\": \"en\", \"text\": \"So lets say a soldier holds multiple MOS's and all are on different grading scales, how will they be graded?  By the toughest one they hold, by primary MOS, by the slot they are in...?  Would love to see something in writing/reg about this.  Anyone have any info?\"}, {\"id\": \"0dfe3c6c-4550-11ea-8826-60f6774aa532\", \"language\": \"en\", \"text\": \"Could certificates for ACFT go on your SRB?\"}, {\"id\": \"0dfe3c6d-4550-11ea-b701-60f6774aa532\", \"language\": \"en\", \"text\": \"My retirement plan is out the window\"}, {\"id\": \"0dfe3c6e-4550-11ea-bb9e-60f6774aa532\", \"language\": \"en\", \"text\": \"So does that mean there will be no official APFT failures from Oct 2019 - Oct 2020? Or do we still do the current test during that time?\"}, {\"id\": \"1186fd68-4550-11ea-9ca5-60f6774aa532\", \"language\": \"en\", \"text\": \"TFW we don't need doctors.\"}, {\"id\": \"1186fd6b-4550-11ea-ac51-60f6774aa532\", \"language\": \"en\", \"text\": \"A SGM told me that he was at the meeting that dealt with all the numbers and statistics about this new PT test and whatever; directed by the suits with PHDs who made the test.\\n\\nBottom line is that this is a way to get rid of everybody with a profile, malingerers and those useless E6 and higher-ups who linger around and fall through the cracks. What\\u2019s amazing to me is how methodical this all is. It\\u2019s like the Army really thinks this is going to be \\u201cthe end all\\u201d solution to getting rid of the people that seem to be \\u201cuntouchable\\u201d.\\n\\nCan\\u2019t wait to see how this affects retention, promotions and recruitment down the line in like two years.\"}, {\"id\": \"1186fd7f-4550-11ea-a42b-60f6774aa532\", \"language\": \"en\", \"text\": \"I wonder how much BS and chapters will have to happen before they decide to go back or completely change the standards \"}, {\"id\": \"1186fd81-4550-11ea-a0a6-60f6774aa532\", \"language\": \"en\", \"text\": \"What do you hear the morning after a pt test as you walk in to work? Ill give some examples of things I hear pretty often. \\n\\n\\\"Did you hear that SPCfemale got a 300 on the pt test? Yeah but she wouldnt have on the male standard, any male could max the female standard\\\"\\n\\n\\\"Did you hear that SFC45yearold got a 300 on the pt test? Yeah but the standards are really low when you get older anyone could do that.\\\"\\n\\n\\\"I only failed the run cause my hip flexors are so sore after the sit ups, they should really change that exercise\\\"\\n\\n\\\"The apft doesnt even test real fitness, anyone can do push ups sit ups and run. We need something that actually tests youre whole bodies fitness\\\"\\n\\nNow the stupid fucks making these comments are in here talking about how this age and gender neutral, sit-upless, slower run standard, full body test of fitness is somehow bad simply because they are too lazy to go to the gym every once in a while. Fucks sake the standards are so low\\n\\n\"}, {\"id\": \"1186fd82-4550-11ea-862e-60f6774aa532\", \"language\": \"en\", \"text\": \"Haven't we not seen finalized scoring standards though?\"}, {\"id\": \"1186fd88-4550-11ea-b15c-60f6774aa532\", \"language\": \"en\", \"text\": \"Well there goes the national guard and reserves.\"}, {\"id\": \"1186fd8d-4550-11ea-baea-60f6774aa532\", \"language\": \"en\", \"text\": \"Cool but maybe this is just my duty station... everyone i meet is getting out. I haven't met anyone who plans on reenlisting... The army will definitely shrink even more\"}, {\"id\": \"1186fd90-4550-11ea-99ba-60f6774aa532\", \"language\": \"en\", \"text\": \">said the Army needs to do a better job of recruiting\\n\\nDoesn\\u2019t mention the use of social media or cellphones. Would rather put young soldiers into recruiting stations on a temporary basis to connect with the youth. \\n\\nWay to go Army. Swing and a miss. \"}, {\"id\": \"1186fd92-4550-11ea-b96a-60f6774aa532\", \"language\": \"en\", \"text\": \"I can\\u2019t wait for the force to clear out all the permanent profiles and then have the a large percentage of the force get injured because of poor form during this pt test. Can\\u2019t wait to see how this will impact readiness. Gonna have the mafia as PSG. Chaos will reign and I will be laughing. God damn it\\u2019s gonna be fun. Just hope they don\\u2019t start stop loss until after I ETS. \"}, {\"id\": \"1186fd95-4550-11ea-8e08-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"1186fd97-4550-11ea-9a00-60f6774aa532\", \"language\": \"en\", \"text\": \"*does three leg tucks and calls it a day*\"}, {\"id\": \"1186fd98-4550-11ea-bffd-60f6774aa532\", \"language\": \"en\", \"text\": \"My active duty aviation unit hasn't done unit PT in 3 months due to work demand. Field training, local support/relief, maintenance, prep for JRTC and now were about to do a pt test. People are gonna fail and get flagged and its gonna be blamed on the individual soldier since PT is an individual problem says the army.  Now you're gonna ask me to do even more, oh not to mention I as a pilot get lumped into the heavy standard vs my crew chiefs in the light standard. So pilots with bad backs are gonna blow out their back/O-ring doing deadlifts. Awesome.\"}, {\"id\": \"1186fd9b-4550-11ea-a356-60f6774aa532\", \"language\": \"en\", \"text\": \"Just start a Chapter paperwork for my profiled ass.\"}, {\"id\": \"1186fd9c-4550-11ea-a2db-60f6774aa532\", \"language\": \"en\", \"text\": \"TFW training related injuries are gonna skyrocket \"}, {\"id\": \"1186fd9e-4550-11ea-a8e4-60f6774aa532\", \"language\": \"en\", \"text\": \"Lol. Good luck maintaining an AMEDD. Want to guess how many attending physicians (35+) can pass that? Or nurses? I do not foresee this testing reaching MEDCOM. Or if it does- maintaining MEDCOM in its current numbers. \"}, {\"id\": \"1186fd9f-4550-11ea-9995-60f6774aa532\", \"language\": \"en\", \"text\": \"So here are my usual concerns with this ACFT (a real hot take, I know.) \\n\\nHow are the 100-120 lb women expected to drag/carry more than half their body weight in a sprint safely? Why is *one* leg tuck a minimum (at this current time) when the climbing drills has SMs completing at least five reps in cadence? How does a platoon size element train for this event regularly from a Monday-Friday 0630-0830 PT day? And what about the National Guard and Reserves who don't even do any PT anyway and most of them don't even fuck with a gym membership prepare for this test? \"}, {\"id\": \"1186fda8-4550-11ea-9a0b-60f6774aa532\", \"language\": \"en\", \"text\": \"How I want to read OP's title:\\n\\nF you! Can't pass the Army Combat Fitness Test? Then there's probably not a spot for you in the Army.\"}, {\"id\": \"1186fda9-4550-11ea-8258-60f6774aa532\", \"language\": \"en\", \"text\": \"I could probably pass the first one, but I\\u2019ll probably have back problems by the start of the second one.\"}, {\"id\": \"1186fdaa-4550-11ea-9ed5-60f6774aa532\", \"language\": \"en\", \"text\": \"This is a definite way to drain the Army a bit, yeah, but they are delusional if they think they can both increase the standards to stay in, make it even harder to get in, and expect to grow the Army at a time where recruiting is harder than ever before. There better be some awesome incentives added if they're wanting more soldiers that aren't just strong dirt bags. \"}, {\"id\": \"1186fdac-4550-11ea-b759-60f6774aa532\", \"language\": \"en\", \"text\": \"what percentage of people in the army ever come within a hundred miles of a battlefield or an enemy? I just dont understand this\"}, {\"id\": \"1186fdaf-4550-11ea-9d7f-60f6774aa532\", \"language\": \"en\", \"text\": \"I\\u2019m 45, been in the Army 20+ years on a Permanent Running Profile. I personally wish the military started this and implemented it years ago. We would have less injuries today. The exercises to prepare for the ACFT if done properly will strengthen your muscle tissue and get you back into the fighting force. It\\u2019s like having Physical Therapy at every PRT session if done correctly. We have two years, so plenty of time to build and repair your body. \\n#BeAllYouCanBe...Let\\u2019s get back in the Real Army!\"}, {\"id\": \"1186fdb1-4550-11ea-9ee9-60f6774aa532\", \"language\": \"en\", \"text\": \"Y\\u2019all are kidding yourself if you think this will have any effect on the National Guard \"}, {\"id\": \"1186fdb2-4550-11ea-a15b-60f6774aa532\", \"language\": \"en\", \"text\": \"I really don't understand why the general consensus among this subreddit is a sense of 'terror' about this new PT test. It's probably the most legitimate PT test for the Army as a whole I have seen presented yet. Of course we have all sorts of good ideas to go from, but it isn't like this test is outlandish; it hits all reasonable areas of testing to verify someone's physical capabilities.\\n\\nMost of the reasons why people consider this test a bad thing is:\\n1. How will people train it at their unit?\\n2. How will the Guard and Reserves train it?\\n3. What is the expectations of those who can't finish it?\\n4. This test is to eliminate those with profiles.\\n5. What about bad form?\\n\\nSo let's address all of those:\\n\\nIssue 1 - How does a person train for anything? Of course PT tests are ridiculous and for most units they are executed on a whim with no prior warning unless you happen to be of rank to decide when these things happen. Due to a perpetual issue among the NCO Corps and officers within the Army of poor communication, it is incredibly common that PT tests are not only a surprise to most service members, but also not properly trained beforehand. The Big Army is completely unfair about its scheduling for PT tests, and thus the solution is, \\\"A person should be able to pass at all times no matter what.\\\"\\n\\nSo, going off of that concept which is prominent throughout not only the Army but also this subreddit, let us apply it to the ACFT. Of course there are some smaller units and locations that don't have a large gym, so what do those guys do? What about guys deployed to a random country who are still expected to run a great 2 mile when they've been stuck on a tiny FOB or COP with no possibility of truly training cardio. What do those guys do? They implement other forms of cardio, such as HIIT or Tabata.\\n\\nWe are the United States Army, we should be capable of doing a fitness test which is the closest thing the Big Army has created to truly testing what is required to apply on jobs in war. (The ball power throw is a little odd though, granted.) Be adaptable. So how do you train a 405 lbs deadlift for 3 reps? What is every single soldier in the Army issued with TA-50? A Large Molle Ruck. Fill that thing up to its capacity (I guarantee you can fit 110 lbs in there.) and use your trunk, lumbar, spine, back, biceps, triceps, deltoids and deadlift the thing. Hell get decent enough and start clean and jerking it. I guarantee you will create a strong foundation enough to hexbar deadlift a high weight.\\n\\nIssue 2 - Answered above.\\n\\nIssue 3 - So it seems it was posted in this thread worried about smaller build types of service members not being able to pick up this weight. Asking for a well-rounded character is great and all, but I weighed above 270 lbs (you weigh for flights) without my rifle on my last deployment in full kit. I'm a big guy granted, but any service member should at least be capable of applying 1 of the MANY techniques to drag me to safety if I'm incapable of doing so. So small build? Damn that's a shame.\\n\\nSo then this asks the question, are we just testing for overall health? If that's the case maybe we should be reevaluating PHA, PDHA, and PDHRA should we not? I received more a physical check up playing sports in school than I have in active duty after MEPS. If we're so worried about a service members health that we test them with a misguided \\\"PT test\\\" known as the APFT, this asks the question of, \\\"What the hell is the Army thinking?\\\"\\n\\nIssue 4 - This is all rumor and paranoia. Those who are spouting this off are generally going to be 1 of 2 people: Those who are worried, and those who are worried this test can be used maliciously. Using this test maliciously is not unique to this test; I can't tell you how many times I've seen junior enlisted stuck in a trap of post-profile APFT because of play and lax within APRT regulations. Is this fair? No, but then we go back to that good ol' saying of, \\\"A SM should be able to pass at all times.\\\"\\n\\nIssue 5 - Bad form is hilarious argument to be making when almost every large post or joint base has some of the best gyms even Olympians would be jealous of. It's also hilarious that something like good form on a HEXBAR is a concern to this paranoid folk. It's easy, and if we're supposed to be the best fighting force the world has ever seen where we train on new forms of technology on a whim, applying all of our capabilities in unison.....I could go on. The solution to this? Train correctly. Every single piece of doctrine and regulation in the Army lays good foundations out for proper training throughout everything we do; if leaders are training wrong, they need to be corrected. And the only way to correct those type of persons is to hold people accountable, and boot the dudes perpetuating this issue. Maybe getting rid of the E6 mafia (which is the modern E4 mafia mind you) with this PT test is a good thing, because most bad training is rooted at that level.\\n\\nTo sum this all up: all of this fear, paranoia, and what not is the product is mistrust in the leadership of this branch. There is no accountability of the NCO corps and officers which allows all of the issues in which these fears derive from to be a perpetual issue.\\n\\nRandom PT tests are the product of bad commanding.\\n\\nPoor training is the product of piss poor leadership.\\n\\nOut of shape service members is a product of old boys club and a lack of personal and unit accountability.\\n\\nExpecting the lowest common denominator to be the new 'standard' of a fighting force is the product of incompetency and ineptitude.\\n\\nCreating excuses for those who aren't fulfilling their job requires, active or reserve, is the product of bad character.\\n\\nI could go on. To finish this, I know I have a lot of bias in here. Sorry if a lot of my points don't come across as fair. I just find it so damn frustrating to be part of an organization that I know could be at a level thousands higher than it is right now, and seeing people spreading such pessimism deriving from their own personal weaknesses really gets at me.\\n\\nEdit 1: Fixing formatting.\\nEdit 2: Some grammar, missed a couple things.\"}, {\"id\": \"1186fdbb-4550-11ea-a02d-60f6774aa532\", \"language\": \"en\", \"text\": \"Same leadership in three years: \\\"holy fuck, we don't have any good leaders or Joes... Nobody is wanting to re-up. What do we do?\\\" \"}, {\"id\": \"1186fdbf-4550-11ea-a495-60f6774aa532\", \"language\": \"en\", \"text\": \"I\\u2019m still kinda skeptical, I have literally been told the PT test is \\u201csoon\\u201d going to change since I joined in \\u201803.  Every year they say the exact same thing.\"}, {\"id\": \"1186fdc0-4550-11ea-ad48-60f6774aa532\", \"language\": \"en\", \"text\": \"I find it hilarious that this is so similar to the APFT we did in the 1980's before they switched to the pushup/situp/run APFT - the reasons for the switch? Old APFT didn't prepare soldiers for combat.\"}, {\"id\": \"1186fdc1-4550-11ea-85ac-60f6774aa532\", \"language\": \"en\", \"text\": \"So what u are saying is that Captain America didnt have a place in the army. Gtfoh\"}, {\"id\": \"1186fdc2-4550-11ea-b46c-60f6774aa532\", \"language\": \"en\", \"text\": \"*Some other approaches include better utilizing Army public relations assets like the Golden Knights and Army bands, he said.*\\n\\nSorry, you cut the band field 34% last two FYs. Maybe not.\"}, {\"id\": \"1186fdc3-4550-11ea-8008-60f6774aa532\", \"language\": \"en\", \"text\": \"Might get rid of profile riders but won't get rid of all the shitbags...\"}, {\"id\": \"1186fdc4-4550-11ea-8ce4-60f6774aa532\", \"language\": \"en\", \"text\": \"What's really aggravating me isnt by itself that combat arms have a higher standard. I honestly believe they should. Its everyone else is lower, but they still have the same pay. It will be official on paper that infantry and other combat arms are asked to do more. Why would anyone want to do more? I guess when you first join the army and your all piss and vinegar, but in the long run anyone with half a sense should go a diffent mos.  \"}, {\"id\": \"1186fdc6-4550-11ea-be2a-60f6774aa532\", \"language\": \"en\", \"text\": \"The minimum standards are not even close to being a challenge.\\n\\nIf you're that terrified of lifting weights watch some videos on YouTube, find some buddies and go lift. You'd be surprised how quickly strength can be developed.\\n\\nEven if you are having trouble I'd bet half my paycheck any soldier could walk into a gym and spot another soldier performing an exercise that would be more than willing to help them out.\\n\\nThere's no shame in not being good at an event; if you need help, go get it!\"}, {\"id\": \"1186fdc8-4550-11ea-a1c3-60f6774aa532\", \"language\": \"en\", \"text\": \"The only issue I have with this new pt test is injuries taking it. People are going to be pulling their lower back muscles trying to deadlift a weight they can\\u2019t.  \"}, {\"id\": \"1186fdca-4550-11ea-9bc3-60f6774aa532\", \"language\": \"en\", \"text\": \"Honestly the only issue I have is the 2 mile. Its such a slow time... Just why? Why not replace with a fuckin 1 mile or a 300m shuttle sprint?\"}, {\"id\": \"1186fdcb-4550-11ea-a0f0-60f6774aa532\", \"language\": \"en\", \"text\": \"I am so happy I put in my retirement packet this year. I am doing my 20 and I am done! Shit like this makes it even sweeter getting out.\"}, {\"id\": \"1186fdcc-4550-11ea-82a5-60f6774aa532\", \"language\": \"en\", \"text\": \"So do special units now have to tailor their PT test for this? Will the Ranger PT test change for example? \"}, {\"id\": \"1186fdcd-4550-11ea-a30a-60f6774aa532\", \"language\": \"en\", \"text\": \"I kind of skimmed the article so maybe I missed it, but what does the ACFT entail? On a side note, I've been out for a while but looking back I'm pretty sure they could just bump the 2-mile up to a 5-mile and the quality of soldiers would increase dramatically. Free Naty-Light at the finish line to boost morale. \"}, {\"id\": \"1186fdd0-4550-11ea-b560-60f6774aa532\", \"language\": \"en\", \"text\": \"My favorite part is how they dont tell us what the test consists of.\"}, {\"id\": \"1186fdd3-4550-11ea-8f5a-60f6774aa532\", \"language\": \"en\", \"text\": \"Have fun at snap city with those dead lifts boys. Glad I got out two years ago. \"}, {\"id\": \"11c8bcc8-4550-11ea-991c-60f6774aa532\", \"language\": \"en\", \"text\": \"yeah ima wait for the 92G Guide to the ACFT.\"}, {\"id\": \"11c8bcca-4550-11ea-b452-60f6774aa532\", \"language\": \"en\", \"text\": \"Yeah I had to turn it off when buddy started trying to hype up the standards.\"}, {\"id\": \"11c8bccc-4550-11ea-aa16-60f6774aa532\", \"language\": \"en\", \"text\": \">green beret guide to the new acft \\n\\nIs this a joke? \\n\\nCan you deadlift 180lbs \\n\\nCan you do 5 leg tucks? \\n\\nThe new test was designed to keep soldiers in the military by lowering standards \\n\\nI\\u2019ve made this comment multiple times. \\n\\nMy unit has all the equipment for this test, I have taken it multiple times.\\n\\nHungover I did 70% in each category barely trying \\n\\nFull on sober I went for 80% for each category \\n\\nIt was rediculously easy. \\n\\nFat guys who can\\u2019t run did ok.\\n\\nSkinny gazelles did ok. \\n\\nPt studs did ok.\"}, {\"id\": \"11c8bcce-4550-11ea-9008-60f6774aa532\", \"language\": \"en\", \"text\": \"Did they go back to the hand release pushups vs the t pushups? I swear it keeps changing\"}, {\"id\": \"245ac6dc-4550-11ea-9e02-60f6774aa532\", \"language\": \"en\", \"text\": \"The absolute madmen; I can't believe they're going through with this. Has anyone in charge of this whole thing thought about what the Army Times is going to do for their front page headlines now?\"}, {\"id\": \"245ac6e1-4550-11ea-9690-60f6774aa532\", \"language\": \"en\", \"text\": \"2min rest between events? People are going to be absolutely smoked if they stick to that.\"}, {\"id\": \"245ac6e5-4550-11ea-9fbd-60f6774aa532\", \"language\": \"en\", \"text\": \"Max 5 of 6 events, blow dick on the 2mile run, still fail. Sounds about right\"}, {\"id\": \"245aedd4-4550-11ea-8144-60f6774aa532\", \"language\": \"en\", \"text\": \"I\\u2019m just excited for the MOS specific minimums and the dick measuring that will come with it. \"}, {\"id\": \"245aedd7-4550-11ea-a49c-60f6774aa532\", \"language\": \"en\", \"text\": \">\\\"If I have a femoral neck fracture in the hip of a Soldier, that injury will cost the government about $1 million,\\\" McGurk said. \\\"So, if I avoid 20 of those injuries a year I've paid for the program for the next 10 years for equipment. The potentials on return are very significant\\n\\n\\n\\nThis is some dumb ass shit that would be said on DB\"}, {\"id\": \"245aeddc-4550-11ea-8dd6-60f6774aa532\", \"language\": \"en\", \"text\": \"The national guard in my state literally can\\u2019t kick anyone out because they haven\\u2019t met their recruiting numbers in ages, meaning they have to keep everyone or we are no longer deployable. I doubt this is going to change anything, even if it actually happens.\"}, {\"id\": \"245aeddd-4550-11ea-849c-60f6774aa532\", \"language\": \"en\", \"text\": \"Just had to keep the run at 2 miles didn't you \\ud83d\\ude11 wish that would have moved to 1.5m\"}, {\"id\": \"245aede0-4550-11ea-a43d-60f6774aa532\", \"language\": \"en\", \"text\": \"> Another difference is that there are no alternate events planned for this test, he said.\\n\\n>Soldiers will still get adequate time to rehabilitate from an injury. But under a new \\\"deploy-or-be-removed\\\" policy, Defense Secretary James Mattis said in February that troops who are non-deployable for more than 12 months will be processed for administrative separation or referred to the disability evaluation system.\\n\\n>\\u201dGenerally speaking, somebody who has a long-term permanent profile that precludes taking a fitness test may not be retainable for duty in the Army,\\\" McGurk said.\\n\\nHaha. Wow. Go fuck yourself I guess.\\n\\n\\u201cWhere did all our E6+ go?\\u201d\\n\\nI\\u2019m still betting this isn\\u2019t gonna happen. It sounds like it was the same \\u201csenior leaders\\u201d that \\u201ctotally approved it\\u201d last time but didn\\u2019t actually have the power to make it actual Army standard.\"}, {\"id\": \"245aeded-4550-11ea-a133-60f6774aa532\", \"language\": \"en\", \"text\": \"This story. Every year since I joined. \"}, {\"id\": \"245aedee-4550-11ea-a43b-60f6774aa532\", \"language\": \"en\", \"text\": \"Chinese Democracy was the first horseman. \\n\\nDuke Nukem Forever was the second. \\n\\nNow this. One left. \\n\\nBrace yourselves boys, the apocalypse is coming in hot!\"}, {\"id\": \"245aedf2-4550-11ea-b6da-60f6774aa532\", \"language\": \"en\", \"text\": \"Those events will kill people 35+ yrs old who have deployment injuries.  A lower back injury makes everything but the run nearly impossible.  Everything is leg and core strength.  Feel bad for combat MOS veterans who are already busted up.\"}, {\"id\": \"245aedf8-4550-11ea-a089-60f6774aa532\", \"language\": \"en\", \"text\": \"https://mwi.usma.edu/good-bad-armys-new-physical-fitness-test/\\n\\n>The ACRT, for example, is comparatively much more time intensive than the APFT. Each set of equipment allows approximately five soldiers to complete the full six-event ACRT in seventy-five minutes. In an infantry battalion with ten sets of equipment and eight hundred soldiers, completing the ACRT will take sixteen days\\u2014three work weeks\\u2014if limited to normal morning PT hours.\\n\\nWho actually thinks this is feasible? \"}, {\"id\": \"245aee03-4550-11ea-aeda-60f6774aa532\", \"language\": \"en\", \"text\": \"You had one stupid job, get rid of the dumb two mile. WHY\\n\\n>Leadership also felt strongly about keeping the run event, despite protestations from some corners that no one runs in combat.\\nIn short, a fitness test of record has to test both soldier skills and baseline health, which is where the run comes in.\\nAnd while something like a loaded road march could get soldiers huffing and puffing enough to test their lungs and heart, it would take a lot longer than 50 minutes total, Frost said.\\n\\nSeems legit. \\\"That would take too long. Also, we quadrupled the amount of time it took to take the regular APFT.\\\"\"}, {\"id\": \"245aee07-4550-11ea-8e47-60f6774aa532\", \"language\": \"en\", \"text\": \"ETS 2020\"}, {\"id\": \"245aee09-4550-11ea-aac0-60f6774aa532\", \"language\": \"en\", \"text\": \"It occurs to me that this entire test is the single most epic Bad Idea Fairy project ever devised.    Quite impressive really.   \\n\\nI wonder if it started as some ROTC kid's position paper in 2003.   \\n\"}, {\"id\": \"245aee0b-4550-11ea-b6b0-60f6774aa532\", \"language\": \"en\", \"text\": \"The logistics behind having all this equipment present and 6 different tests is frightening. This test will take hours.\"}, {\"id\": \"245aee0d-4550-11ea-83e6-60f6774aa532\", \"language\": \"en\", \"text\": \"Wow, if this isn't the 4th time in the last 20 years I've been told the APFT will change.... \\n\\nEdit: this will be overturned for the same reason it was overturned every other time so far: it's too complicated, requires too much training and equipment, and takes way too long to complete.\"}, {\"id\": \"245aee0e-4550-11ea-80d6-60f6774aa532\", \"language\": \"en\", \"text\": \"Deadlifting, dragging a sled with weight, and throwing a ball with explosive power will only lead to more injuries. Not because the exercises are inherently dangerous. But because they\\u2019re inherently dangerous when you do not use the proper form. Good intentions, but this will lead to even more attrition. Oh well. I won\\u2019t be working in the clinic when these PT tests produce sick call masscals \"}, {\"id\": \"245aee0f-4550-11ea-b3af-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"245aee14-4550-11ea-a9c3-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"245aee17-4550-11ea-89bb-60f6774aa532\", \"language\": \"en\", \"text\": \"I like it. There I said it. I finally have a place to show off my max dead lift. \"}, {\"id\": \"245aee1a-4550-11ea-9055-60f6774aa532\", \"language\": \"en\", \"text\": \"Marine here. Why isn't there more talk about the elimination of sit-ups? Is that not a big deal? I can't WAIT until crunches / sit-ups go away for everyone one day.\"}, {\"id\": \"245aee1d-4550-11ea-b6b3-60f6774aa532\", \"language\": \"en\", \"text\": \"Looks like supply, intel, and commo are all about to be empty branches \"}, {\"id\": \"245aee20-4550-11ea-b3fc-60f6774aa532\", \"language\": \"en\", \"text\": \"Recalass to 42A inbound.\"}, {\"id\": \"245aee22-4550-11ea-a7c1-60f6774aa532\", \"language\": \"en\", \"text\": \"I thought the whole point of the other one was that it was scalable and cheap to administer. This seems to be the opposite.\"}, {\"id\": \"245aee23-4550-11ea-ab28-60f6774aa532\", \"language\": \"en\", \"text\": \"A BETTER TEST\"}, {\"id\": \"245aee26-4550-11ea-8b3c-60f6774aa532\", \"language\": \"en\", \"text\": \"Space Force doesn\\u2019t have to deal with this bullshit.\"}, {\"id\": \"245aee29-4550-11ea-bc3e-60f6774aa532\", \"language\": \"en\", \"text\": \"This is going to be an absolute disaster.\\n\\nThere is a reason we have had a PT test that didn't require equipment other than a running surface since forever. Who's going to allocate the money to purchase all this shit? Who's going to allocate the manpower to maintain it? What happens when shit goes missing and it's the end of the fiscal year and the unit either can't or won't buy replacement equipment.\\n\\nIt takes three fucking weeks for an entire IN BN to do this. I guess Joe can't take a PT test to go to a board if it doesn't line up with a  training schedule because there are zero chances that this is going to be done outside of a specific training block.\\n\\nOh, and that's not mentioning the EXPONENTIAL increase of busted people that this is going to bring. What's the worst that happens if you exert too much on the current APFT? You reach muscle failure and fall or you puke. Who cares. You either are PFC Studmuffin who goes full hooah and lifts more than he can safely handle because muh points or just straight up has shit form and fucks up a deadlift, congrats, you throw your back out and now have a nondeployable Soldier, which you are now going to kick out because of shit YOU did, Army. Think of all the people you see in the gym who have shit form on a lift, civilian alike. Now think of all the retarded, knuckledragger NCOs who are going to \\\"teach\\\" how to do it. And if you think Uncle Sugar will fund actual MFT people to each company, you're dreaming.\\n\\nEDIT: Oh, and another thing. Our current APFT promotes a lean body structure focused on endurance, and our height/weight standards reflect this. So what's going to happen when everyone trains specifically for these lifts and gets swole and jacked to get a higher score, and everyone starts failing tape as a result?\\n\\nThis is going to do nothing other than fuck up our readiness rates even more. Fuck this and fuck the person who came up with it.\"}, {\"id\": \"245b14c4-4550-11ea-8fe4-60f6774aa532\", \"language\": \"en\", \"text\": \"So, some more math on this.\\n\\nA single lane is 420 lbs of equipment for deadlift, a 10-pound ball, 90-lb drag sled, two 40-lb kettlebells.\\n\\n420+10+90+80 = 600 lbs per lane.\\n\\nFor the NCO Academy, we typically run about 30 lanes of 9 tested personnel per lane. In order to run the same amount of people through in about the same time, we've got to drop to 5 personnel per lane. That means instead of 30 lanes, now we've got to run 54.\\n\\n54 lanes \\\\* 600 lbs = 32,400 lbs of equipment that has to be removed from storage and set up.\\n\\nSo for this to logistically make any sort of sense, any sort of training post will have ACFT ranges purpose-built, and manned by contractors with all the logic and capability that run every other range.\\n\\nI figure that the sleds and such will be kept in the same quality condition as our pop-up targets.\"}, {\"id\": \"245b14c7-4550-11ea-b50a-60f6774aa532\", \"language\": \"en\", \"text\": \"Does anyone know what company they\\u2019re using for the equipment? Asking for a friend who\\u2019s trying to diversify their investments. \"}, {\"id\": \"245b14ca-4550-11ea-9c4c-60f6774aa532\", \"language\": \"en\", \"text\": \"So they still don't have the score standards for the individual events plus whether or not a \\\"perfect\\\" score is 600 points or less?\"}, {\"id\": \"245b14cc-4550-11ea-b5b7-60f6774aa532\", \"language\": \"en\", \"text\": \"I don't hate it, I actually kind of like it. That said, I think that ultimately it'll be poorly implemented, will cost the Army a fuckton of money, and eventually be shitcanned and we'll go back to the exceedingly ineffective measure of fitness that we currently have. Hopefully I'm wrong. Looking at the events:\\n\\n1) Deadlift: A solid measure of fitness that has good carry over into the real world. Also, its inclusion means that we're going to *have* to start teaching lifting form to Soldiers. That's an excuse for me to go to the gym during PT. Nice.\\n\\n2) Standing Power Throw: Honestly, I don't understand the fascination with this shit. But whatever. It's easy and quick. Maybe people will stop failing the distance grenade throw if they're allowed to do it backwards.\\n\\n3) Hand Release Pushups: Definitely more difficult than a regular pushup and far more objective. I'm all about it.\\n\\n4) Sprint medley: A test attempting to simulate motions used during combat? Fucking sweet. I'm all about it.\\n\\n5) Leg tucks: A core event that isn't the sit-up. Fuck yeah, sign me up.\\n\\n6) 2-mile run: Generals jerk off to it. It's like DTMS; we all fucking hate it, they love it, it's never going away. But seriously, what the fuck.\\n\\nAll in all, I hope we have a more fit force (we'll definitely be more well rounded) after this shit starts, but probably not. \"}, {\"id\": \"245b14d0-4550-11ea-b255-60f6774aa532\", \"language\": \"en\", \"text\": \"Is this the end of the gazelle master race? \"}, {\"id\": \"245b14d2-4550-11ea-b0ab-60f6774aa532\", \"language\": \"en\", \"text\": \"RIP my poor little legs.\"}, {\"id\": \"245b14d5-4550-11ea-918e-60f6774aa532\", \"language\": \"en\", \"text\": \"I finally pass the APFT to get back in and now they're doing this...\"}, {\"id\": \"245b14d7-4550-11ea-b472-60f6774aa532\", \"language\": \"en\", \"text\": \"So is Ranger School going to have a pt test now? That's usually how they wash out a lot of candidates. \"}, {\"id\": \"245b14d9-4550-11ea-b648-60f6774aa532\", \"language\": \"en\", \"text\": \"First I get banned from r/thanosdidnothingwrong, now I'm getting banned from the Army? Life is coming up debo16!\"}, {\"id\": \"245b14da-4550-11ea-8173-60f6774aa532\", \"language\": \"en\", \"text\": \"You all have fun with that happy horseshit. \\n\\nThis looks like a clusterfuck of epic proportions for how long it's going to take to administer this test, and it's comical to think that this will reduce injuries.\"}, {\"id\": \"245b14db-4550-11ea-8fa6-60f6774aa532\", \"language\": \"en\", \"text\": \"Yeah, I'm not re-enlisting.\"}, {\"id\": \"245b14dd-4550-11ea-8dd2-60f6774aa532\", \"language\": \"en\", \"text\": \"Glad my ETS is before then.\"}, {\"id\": \"245b14de-4550-11ea-af87-60f6774aa532\", \"language\": \"en\", \"text\": \"I initially had a lot of problems with it but I think at this point I just have a lot of questions.\\n\\n1. They can't possibly think just changing the test will result in a change in fitness level, so where is the appropriate PT program to go with this test?\\n\\n2. The logistics of this test are more extensive, so what kind of frequency are we looking at implementing it?\\n\\n3. What are these scores tied to and how? Putting them to use like the current PT test is basically going to shoot the initiative to get females into combat arms.\\n\\n4. What additional information is this going to convey to the commanders out there? The PT test gives me a ball park idea of the kind of shape my soldier is in and this new test is supposed to tell me more, but how much more can I determine from these numbers and is it a great enough difference to justify it?\\n\\n5. How much more time am I going to be dedicating to pushing soldiers to pass these very specific events?  Most of the time I have to rehabilitate soldiers straight out of AIT from their terrible PT habits, get them to passing, and then set them on the path to real fitness.  The same thing is going to happen but now I have 3 more events to get them to standard in.\\n\\n6.  Why are we continuing to remove a commander's ability to train and develop their troops by dictating every step of their job?  \\n\\n4-6 may be more criticisms than legitimate questions but I really hope they do a better job rolling this out than they did with PRT.\"}, {\"id\": \"245b14e1-4550-11ea-aa38-60f6774aa532\", \"language\": \"en\", \"text\": \"I can finally max an event. I'm so excited\"}, {\"id\": \"245b14e3-4550-11ea-ad64-60f6774aa532\", \"language\": \"en\", \"text\": \"I am in the video for the test, AMA. They told us an announcement would be made pretty soon.\"}, {\"id\": \"245b14e7-4550-11ea-9d73-60f6774aa532\", \"language\": \"en\", \"text\": \"A bootleg version of the draft test was posted here a couple weeks ago. For \\\"fun\\\" we tried the event just as a familiarization.  We did it all minus the run in 45 minutes when not controlling time between events.  The shuttle sprint carry event was the biggest suckfest of them all, but was actually the easiest to max in the time allocated (1:30).  All in all, it seems expensive to purchase at first, but easy to pass and impossible to max a 600. \"}, {\"id\": \"245b14e8-4550-11ea-b2ab-60f6774aa532\", \"language\": \"en\", \"text\": \"\\\"In 1980, running shoes were relatively a new invention,\\\"\\n\\nAs a civilian, is this statement in favor of changing the fitness test as retarded as it seems?\"}, {\"id\": \"245b14e9-4550-11ea-921c-60f6774aa532\", \"language\": \"en\", \"text\": \"Thank FUCK I'll be out by then\"}, {\"id\": \"245b14ea-4550-11ea-9193-60f6774aa532\", \"language\": \"en\", \"text\": \"#retirementin2020\"}, {\"id\": \"245b14eb-4550-11ea-bb91-60f6774aa532\", \"language\": \"en\", \"text\": \"I still remember being in ROTC in 2003 and they claimed that 'next year' they were moving to the new PT test.\\n\\nBut seriously, how in the hell are they planning on making this test 'gender neutral'?  Do they mean men and women they will have the same scoring criteria? \"}, {\"id\": \"245b14ee-4550-11ea-bad9-60f6774aa532\", \"language\": \"en\", \"text\": \"But it'll make a great bullet point on someone's OER/NCOER. \"}, {\"id\": \"245b14ef-4550-11ea-bb94-60f6774aa532\", \"language\": \"en\", \"text\": \"\\u201cI\\u2019ll take \\u201cDumb shit suggested by flag officers, field grades and inbred sergeant majors that will never be realistically implemented\\u201d for $800 Alex\\nEDIT: Before some OD green shill starts asking why:\\n\\n\\n1) lol it will take a whole fucking day for just a platoon to complete.\\n\\n\\n2) lol the Army is broke dick as fuck, where is the money for all this equipment coming from?\\n\\n\\n3) \\u201cpush ups will be graded more better now that you have to\\nraise your hands each rep.\\u201d Lol you fucking dummy, check the subjectivity for any of these new events. Bet those leg tucks will be consistent. Bet that weird shuttle run event with a different exercise each iteration will be done the same everywhere. Oh wait....\\n\\n\\n4) bottom line, fuck the Army for focusing on all the wrong things. How about we take all the money wasted on this experiment and stand up another ABCT, or make our vehicles actually run. Or help suicidal vets. Or make basic training a legit exercise like it once was, instead of a daycare.. But I guess that\\u2019s not a nice pretty little OER bullet point, is it? Oh and good thing we\\u2019re making up another dress uniform for people to waste their money on and wear once every two years. \"}, {\"id\": \"245b14f1-4550-11ea-a630-60f6774aa532\", \"language\": \"en\", \"text\": \"I\\u2019ll be on terminal leave by then. \\ud83d\\ude4f \"}, {\"id\": \"245b14f2-4550-11ea-ba3c-60f6774aa532\", \"language\": \"en\", \"text\": \"Mattis says fuck yo couch.\"}, {\"id\": \"245b14f3-4550-11ea-b9a1-60f6774aa532\", \"language\": \"en\", \"text\": \"Next Army Times headline: \\u201cArmy Delays ACFT implementation; New Army Fitness Test Trial In the Works.\\u201d  \"}, {\"id\": \"245b14f4-4550-11ea-8adf-60f6774aa532\", \"language\": \"en\", \"text\": \"This is beyond stupid\"}, {\"id\": \"245b14f5-4550-11ea-b2d1-60f6774aa532\", \"language\": \"en\", \"text\": \"I\\u2019m with an HHC Unit and we have a fair amount of older and out of shape soldiers, some with injuries from deployment that have had a permanent negative effect on their physical health. I cant possibly imagine some of them dragging sleds, doing dead lifts, the knee tuck shit, and all the other stuff honestly. We\\u2019ll see I guess \"}, {\"id\": \"245b14f6-4550-11ea-9bb3-60f6774aa532\", \"language\": \"en\", \"text\": \"RemindMe! 27 months\"}, {\"id\": \"245b14f8-4550-11ea-b0db-60f6774aa532\", \"language\": \"en\", \"text\": \"Back in 2001 in Basic, were doing PRT and was told of the new PT test. Then in 2005, then 2010, 2012... \"}, {\"id\": \"245b14f9-4550-11ea-9cb5-60f6774aa532\", \"language\": \"en\", \"text\": \"Per MG Malcolm Frost:\\n\\n*The hope, Frost added, is that in the coming years, prospective soldiers will train for the OPAT before they join, then transition into a service-wide health culture that emphasizes workouts, recovery, sleep and nutrition, reducing injuries and attrition in the service of building and maintaining combat effectiveness.*\\n\\nWhere has this dude been his whole career???\"}, {\"id\": \"245b14fc-4550-11ea-88d4-60f6774aa532\", \"language\": \"en\", \"text\": \"What are the minimums so I can just do that instead.\"}, {\"id\": \"245b14fd-4550-11ea-a25d-60f6774aa532\", \"language\": \"en\", \"text\": \"I see the re-enactment of Independence Day more likely that this shit.\\n\\n46 mos series at army mil news site are just wage stealers at this point.\"}, {\"id\": \"245b14ff-4550-11ea-864a-60f6774aa532\", \"language\": \"en\", \"text\": \"The best part of it is that all the douchebags who just run endlessly and do pushups will have to hit the gym for once.\\n\\nBasically all the skinny, non-lifting guys are going to get exposed.\"}, {\"id\": \"245b1500-4550-11ea-ae0f-60f6774aa532\", \"language\": \"en\", \"text\": \"What's wrong with a normal pushup? Why must they include frickery?\"}, {\"id\": \"245b1504-4550-11ea-9872-60f6774aa532\", \"language\": \"en\", \"text\": \"If I only have to run as fast as a woman on the 2 mile Id come back in for this.\\n\\nMy 2mile is at 20:10 right now but whatever.\"}, {\"id\": \"245b1505-4550-11ea-b7a3-60f6774aa532\", \"language\": \"en\", \"text\": \"I retire Sep 2019! Praise Mattis I\\u2019ll be free.\"}, {\"id\": \"245b1506-4550-11ea-acb4-60f6774aa532\", \"language\": \"en\", \"text\": \"Does anyone have a link to the new standards? I'm having trouble finding them\\n\\nNevermind, [found it.](https://armarksman.files.wordpress.com/2017/10/acrt.pdf)\"}, {\"id\": \"245b1508-4550-11ea-9035-60f6774aa532\", \"language\": \"en\", \"text\": \"Im imagining the fuckery of that hanging leg raise bullshit. \\\\*seizures intensify\\\\* \"}, {\"id\": \"245b150a-4550-11ea-b9f7-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"245b150d-4550-11ea-b7f7-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"245b150f-4550-11ea-bbb3-60f6774aa532\", \"language\": \"en\", \"text\": \"You would have to build specific facilites to test and train for this, IMO - at least here in Ft. Riley, the gyms we do have aren't really capable of handling the current load of people during normal PT hours, I can't imagine a whole unit trying to do a test at the same time, with the same equipment. Plus, wouldn't this kind of make National Guard drills essentially a pt test meetup? You'd almost have to dedicate a good chunk of that weekend to just this. \"}, {\"id\": \"245b1511-4550-11ea-bf9b-60f6774aa532\", \"language\": \"en\", \"text\": \"Someone explain to me how this is in any way relevant to a modern military.\"}, {\"id\": \"245b1513-4550-11ea-acb1-60f6774aa532\", \"language\": \"en\", \"text\": \"A f(a)rt seems like a great thing to have in 2020\"}, {\"id\": \"245b1514-4550-11ea-ba4a-60f6774aa532\", \"language\": \"en\", \"text\": \"I ETS in 2020.. Have fun fuckers\"}, {\"id\": \"245b1515-4550-11ea-a9f0-60f6774aa532\", \"language\": \"en\", \"text\": \"I get out in September after a decade.\\n\\nCan't wait to see this shitshow from the sidelines.\"}, {\"id\": \"245b1516-4550-11ea-9175-60f6774aa532\", \"language\": \"en\", \"text\": \"Would love to see them drop an event (preferably one that is equipment dependent) and drop the length of the run.\"}, {\"id\": \"245b3bb3-4550-11ea-96d4-60f6774aa532\", \"language\": \"en\", \"text\": \"How the fuck 95% of the army gonna get close to 400lb deadlift \"}, {\"id\": \"245b3bb5-4550-11ea-80ac-60f6774aa532\", \"language\": \"en\", \"text\": \"So will the Army now finally provide a gym membership allowance for NG/Reservists? \"}, {\"id\": \"245b3bb7-4550-11ea-8ad9-60f6774aa532\", \"language\": \"en\", \"text\": \"Thank God I'll be ETSing \"}, {\"id\": \"245b3bb8-4550-11ea-b210-60f6774aa532\", \"language\": \"en\", \"text\": \"I was literally just talking about this in another thread. Glad to hear it.\"}, {\"id\": \"245b3bb9-4550-11ea-8c43-60f6774aa532\", \"language\": \"en\", \"text\": \" Out next year. Rip in pieces my dudes. U all gon die. \"}, {\"id\": \"245b3bba-4550-11ea-9464-60f6774aa532\", \"language\": \"en\", \"text\": \"So many dipshit soldiers gon die from the deadlift test\"}, {\"id\": \"245b3bbc-4550-11ea-a472-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"245b3bbd-4550-11ea-9634-60f6774aa532\", \"language\": \"en\", \"text\": \"If they just gave up on the deadlift idea it would actually almost trick me into thinking it was remotely feasible.\"}, {\"id\": \"245b3bbe-4550-11ea-8da8-60f6774aa532\", \"language\": \"en\", \"text\": \"We would have to do a complete overhaul of how we conduct PT from BCT, at schools and till retirement. You cant and shouldn't have a single unit run PT tests under this, it should be done at a much larger level and only require a test once per year, and anything that requires a test needs to be relooked at as well. This is a way bigger logistical fuck then just changing a test.\\n\\nTo everyone saying nobody broken is going to complete this test - yup. The longer I stay in the more I see the military as a whole wanting old out and new in, get rid of experience in favor of the new and shiny toys. A simple handshake and a smile that says fuck your service is more apt for what I believe the military as a whole wants to do with vets.\\n\\nWith the above said, lets be realistic here - once the army sees how many people are failing this and who is failing and they are gonna lose (Anyone senior anything), its gonna go right down the shit river with all the money spent on it and were right back to standing around till it gets hot in July so we can start the old PT test.\\u0014\"}, {\"id\": \"245b3bc0-4550-11ea-83c7-60f6774aa532\", \"language\": \"en\", \"text\": \"The \\\"Holistic Health and Fitness System\\\" got me.  So basically what you're telling me is that we are going to set up a \\\"fitness\\\" plan based on alternative medicine?  Cause yeah, that's a bright and smart move.\\n\\nGo ahead, look up \\\"Holistic Health\\\"\"}, {\"id\": \"245b3bc1-4550-11ea-bec2-60f6774aa532\", \"language\": \"en\", \"text\": \"It\\u2019s gonna be very frequently pencil whipped. That\\u2019s the only way it can go without drastic organizational changes.\"}, {\"id\": \"245b3bc2-4550-11ea-9408-60f6774aa532\", \"language\": \"en\", \"text\": \"sure it is.\\n\"}, {\"id\": \"245b3bc3-4550-11ea-9dfc-60f6774aa532\", \"language\": \"en\", \"text\": \"Suuurrrreeee\"}, {\"id\": \"245b3bc4-4550-11ea-b7c5-60f6774aa532\", \"language\": \"en\", \"text\": \"If you haven't tried it I highly encourage you to do a mock one with your Joes.  It's challenging but certainly possible with some focused training in the weeks leading up to the test!  It's also pretty fun.\"}, {\"id\": \"245b3bc5-4550-11ea-abbc-60f6774aa532\", \"language\": \"en\", \"text\": \"I just want to see these old E-8s and above, oh yeah don't forget the O-5s and above do the actual test, then I will shot the hell up. But I doubt it I will ever see one of them doing one, but guarantee that they think is the best thing since sliced bread. I know how we can better fit soldiers, when NCOs can smoke them like old times without calling IG. MOS specific standards a bag full of donkey  s##t , EQUAL OPPORTUNITY!!! what a joke.\"}, {\"id\": \"245b3bc7-4550-11ea-9829-60f6774aa532\", \"language\": \"en\", \"text\": \"You can pass if dedicate yourself to strength training 3 times a week and mixing in sprints with endurance runs!\"}, {\"id\": \"245b3bc8-4550-11ea-8b3b-60f6774aa532\", \"language\": \"en\", \"text\": \"\\nThis new b.s PT looks like a huge exciting waste of time/effort/space/money but looks like a REALLY easy to pass event. ESPECIALLY if now its gender neutral so we need around 15 PU, 3-6 of those stupid  leg tucks, 215-225 Deadlift 3 times? 4min for shuttle sprints? And a 20min 2mile? That's a cake walk if you ask me, then again weightlifting is a hobby of mine. *FUCK CARDIO*\"}, {\"id\": \"245b3bc9-4550-11ea-b14a-60f6774aa532\", \"language\": \"en\", \"text\": \"I'm Guard (yes, yes, chuckle away) and I simply don't see how this is going to be possible on our front.  The test looks pretty good as far as testing fitness, but we're going to need a huge array of equipment to do this test and we don't have the space in the armory.  Not to mention that we have to drive 6 min away to the 2-mile course, so there's zero chance that we can stick to the rest times.  Additionally, we don't have a base-gym like active guys do.  It's hard enough to get soft-bodies to do PT in between drills when it's PU/SU/run.  Now they'll have to pay for a gym membership if they want to do well. And the time!  We have one weekend a month to get all the mandatory crap done.  This is going to take many many hours to do properly.  Why couldn't we just do the \\\"maneuver under fire\\\" drill that the USMC does?\"}, {\"id\": \"245b3bca-4550-11ea-a817-60f6774aa532\", \"language\": \"en\", \"text\": \"Everyone does know that the hex bar was chosen specifically because it minimizes injury right? No? Alright...\\n\\nThis test is far better for measuring fitness over the current APFT. \\n\\nIf I had a dollar for everytime I heard how outdated the Army's fitness program is (specifically the APFT) I'd be debt free with a ballin bike and a Noveske AR just cause. \\n\\nIf this test gets implemented then we are making steps closer to where we need to be. \\n\\nWill there be growing pains? You bet but the price is worth a more fit Army. \"}, {\"id\": \"245b3bcb-4550-11ea-b2a5-60f6774aa532\", \"language\": \"en\", \"text\": \"If different MOSs have different standards, should they get different pay rates?\"}, {\"id\": \"245b3bcd-4550-11ea-83d4-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"245b3bcf-4550-11ea-87c4-60f6774aa532\", \"language\": \"en\", \"text\": \"I fucking love it. You pussies in here crying about a new pt test? I haven't had one in 13 years.\\n\\nWell, I mean, I got out 13 years ago, so... Enjoy that nonsense.\\n\\nIf anyone is interested in hearing my story about my last PT test, it's a funny one, let me know.\"}, {\"id\": \"245b3bd1-4550-11ea-8e6d-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"245b3bd3-4550-11ea-9733-60f6774aa532\", \"language\": \"en\", \"text\": \"Yes.  Really doofus.  https://www.bizjournals.com/washington/breaking_ground/2016/07/its-happening-d-c-days-away-from-ownership-of.html\"}, {\"id\": \"245b3bd4-4550-11ea-af46-60f6774aa532\", \"language\": \"en\", \"text\": \"Look at all the complaints posted here.  Jesus, what a bunch of lightweights.  No wonder the Marines do the real fighting. \"}, {\"id\": \"24b98154-4550-11ea-a7ae-60f6774aa532\", \"language\": \"en\", \"text\": \"Continue regular APFT events.\\n\\nStill waiting on General Officers and SGMs ACFT results.\"}, {\"id\": \"24b98156-4550-11ea-b9d5-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"24b98158-4550-11ea-91d7-60f6774aa532\", \"language\": \"en\", \"text\": \"Reddit ETS\"}, {\"id\": \"24b9815a-4550-11ea-aa9c-60f6774aa532\", \"language\": \"en\", \"text\": \"You should really try to get some equipment, but here goes;\\n\\nDeadift:  Squats, standing broad jump\\n\\nMedicine Ball throw:  Burpees, high jumps, knee tuck jumps (at a fast pace).\\n\\nSprint/Drag/Carry:  Suicides, backwards suicides, squats, lunges.\\n\\nLeg tuck:  leg tuck & twist, frog jumps, mountain climbers, hang on a bar for a long time?\\n\\n2 mi:  5K at progressively faster paces, 800X400M intervals, 60/120s\\n\\nJust suggestions\"}, {\"id\": \"24b9815d-4550-11ea-823c-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"24b9815f-4550-11ea-80a8-60f6774aa532\", \"language\": \"en\", \"text\": \"I believe the email with the slides I got from the SGM today said the run is less than 21 minutes now.\\n\\nI\\u2019m not sure how official that is. Also probably going to still suck for people like me who hate to run, especially after doing the sprints and shit.\\n\\nEdit:\\n\\nHere it is. This slide is the only mention of the run time.\\n\\nhttps://imgur.com/gallery/uNs5qRL\\n\\nLike I said I\\u2019m not sure how official the time is since this is the only thing I\\u2019ve seen on it.\"}, {\"id\": \"24b98161-4550-11ea-9eb0-60f6774aa532\", \"language\": \"en\", \"text\": \"I don\\u2019t believe it\\u2019s going to happen until I have to take one. Guarantee if it gets implemented in some way, it won\\u2019t be in its current form.\\n\\nThe logistic/readiness/manpower clusterfuck is going to be beautiful if it does.\"}, {\"id\": \"24b98162-4550-11ea-a446-60f6774aa532\", \"language\": \"en\", \"text\": \"Anything can become a pullup bar if you're ~~smart~~ innovative enough.  Like the trim of a door.\\n\\nSingle leg squat variants.\\n\\nDumbbell deadlifts.  Load up an assault packet with weight\\n\\nGoblet squats.  Use the weighted assault pack\\n\\nRucksack squats.\\n\\nAttach rope to ruck sack and drag the bitch.  Protect ruck with plastic bag\"}, {\"id\": \"24b98163-4550-11ea-9309-60f6774aa532\", \"language\": \"en\", \"text\": \"SFL/TAP and ETS or Retire.\"}, {\"id\": \"24b98165-4550-11ea-9622-60f6774aa532\", \"language\": \"en\", \"text\": \"Do you have a gym anywhere near you? My local Y has all the equipment I could ever need and they give a good discount to active duty and reserve.\"}, {\"id\": \"24b98168-4550-11ea-b2fc-60f6774aa532\", \"language\": \"en\", \"text\": \"Honestly you probably don't really need any special equipment to prepare, not even a trap bar.  Any regular gym with freeweights will suffice.\\n\\nIf you can perform 50+ standard push ups , deadlift 315+ on a conventional straight bar, can jog 3 miles at a half way decent pace (say 7.30 pace per mile)  you'll be strong enough and conditioned enough to very well on all of these events.  you can buy a 10 pound medicine ball if you want to practice.\\n\\nI have never done crossfit or calisthenics outside of push ups / pull ups/ situps.  I can however bench press 275 lbs, squat 405 lbs , deadlift 475 lbs conventionally and run a 6 minute mile.  I was able to almost max the ball throw after like 3 days of practicing.\\n\\nTLDR; focus on getting plain old strong and conditioned. If you are strong enough in conventional weight training and can run 30+ minutes at a decent speed you will be fine \"}, {\"id\": \"24b98169-4550-11ea-9f11-60f6774aa532\", \"language\": \"en\", \"text\": \"The equipment you need is available at a nearby YMCA or you can buy equipment and setup as in-home gym. If you want something, you'll go for it!\"}, {\"id\": \"254c9c55-4550-11ea-a0d1-60f6774aa532\", \"language\": \"en\", \"text\": \"I took the ACFT this morning and was trying to just do the minimum on everything. That was actually so hard that I wound up trying just a little bit and still wound up with 70+ in everything, minus the deadlift which I did the minimum on. In short, this is a joke.  \\n\\nTL;DR: It's harder to fail this than it is to pass it.\"}, {\"id\": \"254c9c57-4550-11ea-8329-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"254c9c5a-4550-11ea-b9a7-60f6774aa532\", \"language\": \"en\", \"text\": \"So that poster yesterday was correct about the memo?\"}, {\"id\": \"254c9c5d-4550-11ea-a80f-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"254c9c5f-4550-11ea-8ebe-60f6774aa532\", \"language\": \"en\", \"text\": \"Yep, just reading that S1Net message too.  Hope they get things finalized-ish before they push it on all the prior service folks doing WOBC.\"}, {\"id\": \"254c9c61-4550-11ea-84cf-60f6774aa532\", \"language\": \"en\", \"text\": \"So are the FY2020 TRADOC people just not taking the APFT at all?\"}, {\"id\": \"254c9c65-4550-11ea-bd1d-60f6774aa532\", \"language\": \"en\", \"text\": \"Who the fuck wants to read army speak on reddit? TLDR\"}, {\"id\": \"254c9c67-4550-11ea-b6d8-60f6774aa532\", \"language\": \"en\", \"text\": \"Well that's going to be interesting, implementing that into BCT. The privates already are broken by the APFT because they're so unfit when they come in. This is going to kill them.\"}, {\"id\": \"254c9c69-4550-11ea-a926-60f6774aa532\", \"language\": \"en\", \"text\": \"Im assuming the minimum standard will change based on MOS/Unit?\"}, {\"id\": \"254c9c6a-4550-11ea-b4ab-60f6774aa532\", \"language\": \"en\", \"text\": \"Plenty of these soldiers won\\u2019t be able to pass the APFT in the meantime.\"}, {\"id\": \"254c9c6b-4550-11ea-8e2a-60f6774aa532\", \"language\": \"en\", \"text\": \"I see WOBC listed, but does anyone know if WOCS and/or OCS will be included in this initial roll out?\"}, {\"id\": \"254c9c6c-4550-11ea-a6ad-60f6774aa532\", \"language\": \"en\", \"text\": \"Just to confirm because I didn't read anything about Leadership schools. I'd hate to do this at MLC or the Academy.\"}, {\"id\": \"254c9c6e-4550-11ea-a506-60f6774aa532\", \"language\": \"en\", \"text\": \"Quick question... so the new standards are broken down per MOS. \\n\\nI had a major surgery about 5 months ago that I am still recovering from and the possibility of a permanent profile is being thrown around by providers. My MOS does not allow permanent profiles and I love my job so I\\u2019m going to try my hardest to avoid one. \\n\\nWith that being said, what happens if a soldier fails the run portion in their MOS but passes the overall time required by the army? Prior to surgery I was a 14 min two miler, post surgery I\\u2019m barely able to make it 2 miles without the repaired leg feeling like it\\u2019s being sawed off with a dull knife.\"}, {\"id\": \"254c9c70-4550-11ea-acb5-60f6774aa532\", \"language\": \"en\", \"text\": \"Right for the start of my BOLC and i just hit a new max of 425 on my DL. I'm pumped.\"}, {\"id\": \"254c9c71-4550-11ea-ad23-60f6774aa532\", \"language\": \"en\", \"text\": \"Huh, I wonder if we will get the gear out here in bumfuck KY before 2021.\"}, {\"id\": \"254c9c73-4550-11ea-b9a6-60f6774aa532\", \"language\": \"en\", \"text\": \"Anyone find the actual enclosure 2 they reference for the standards/grading scale based off MOS?\"}, {\"id\": \"254c9c75-4550-11ea-b40a-60f6774aa532\", \"language\": \"en\", \"text\": \"So if I'm beginning OSUT in October, does that mean we'll only be doing ACFT instead of APFT?\"}, {\"id\": \"254c9c76-4550-11ea-9348-60f6774aa532\", \"language\": \"en\", \"text\": \"Does anyone know if Jump school will still use the apft?\"}, {\"id\": \"254c9c77-4550-11ea-b207-60f6774aa532\", \"language\": \"en\", \"text\": \"So it would seem that this pt test would pretty much require training at a gym. National guard is at a little bit of a disadvantage on this due to us not having free gym access as a benefit like our active duty counter parts. My soldiers and even myself don\\u2019t have a whole lot of money to throw around cause paying CT taxes is about as enjoyable as getting a lap dance from a Brillo pad. Would I be living in a dream world in asking if this could be a possible issue that could be looked into for us national guard folk? We all want to succeed and perform well just like anyone else out here.\"}, {\"id\": \"254c9c78-4550-11ea-b536-60f6774aa532\", \"language\": \"en\", \"text\": \"So I\\u2019m in AIT right now does that mean next month I\\u2019ll be taking ACFT instead now?\"}, {\"id\": \"25a20c15-4550-11ea-a430-60f6774aa532\", \"language\": \"en\", \"text\": \"It'd be cool if we could get some pictures of historical PT uniforms as well\"}, {\"id\": \"25a20c17-4550-11ea-a97f-60f6774aa532\", \"language\": \"en\", \"text\": \"The Army has spent WAY to much money to walk away from it at this point.\"}, {\"id\": \"25a20c1b-4550-11ea-bea3-60f6774aa532\", \"language\": \"en\", \"text\": \"We barely even have 12 people in our company right now lol.\"}, {\"id\": \"25a20c1d-4550-11ea-b3f0-60f6774aa532\", \"language\": \"en\", \"text\": \"None of this makes sense.  I demand trial by PowerPoint!\"}, {\"id\": \"25a20c1e-4550-11ea-a6d2-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"25a20c20-4550-11ea-a645-60f6774aa532\", \"language\": \"en\", \"text\": \"The initial APFT scoring table was based off running in boots, and the test was conducted that way until 1983 when it was changed to running shoes.\\n\\nIn FY87 the standards were adjusted for the change from boots to running shoes (my 17-25 age group max run dropped from 13:15 to 11:54).\\n\\nFY 98 standards were adjusted again based on some voodoo analysis which didn't account for \\\"survivors bias\\\" when the test data was collect in 93/94 (height of the post Cold War drawdown).\\n\\n <Unfortunately, the focus became on teaching to the test and it showed on the post September 11th battlefields.>\\n\\nPlease back this up with facts?  Point to any engagement, operations, or war that we lost due to a lack of physical fitness.  Lots of reasons why there aren't W's hanging on the wall for the GWOT operations, physical fitness isn't the reason.\"}, {\"id\": \"25a23302-4550-11ea-a48f-60f6774aa532\", \"language\": \"en\", \"text\": \"Saving this for when a boomer says, \\\"It WaS HaRdEr BaCk iN My DaY.\\\"\"}, {\"id\": \"25a23304-4550-11ea-b524-60f6774aa532\", \"language\": \"en\", \"text\": \"Got any sources on the PT history? Would love to look at them further.\"}, {\"id\": \"25a23306-4550-11ea-a7c4-60f6774aa532\", \"language\": \"en\", \"text\": \"Really interesting compilation. Nice.\"}, {\"id\": \"25a23307-4550-11ea-8665-60f6774aa532\", \"language\": \"en\", \"text\": \"So you did great on the DL and the SPT, not so hot on the SPC and the run. \\n\\nI\\u2019m guessing you\\u2019re a thiccboi?\"}, {\"id\": \"25a23309-4550-11ea-94f5-60f6774aa532\", \"language\": \"en\", \"text\": \"Interesting read, I'm curious though, whats a wide leg situp?\\n\\nWhen I was in, the units I was in required us to basically put our head at least somewhat inbetween our knees, is that a wide leg? Not just touch, same with pushups, chest (yes even women) to ground. Maybe we just had some ahole graders?\\n\\nAnd does your unit have women in it? I've heard that many are having an issue with the ACFT compared to the divided reqs for the reg aft. And I wonder how they would have faired on that UBRR as most women lack the upper body strength to do things like the (unsupported?) rope climb.\\n\\nI am a woman, I had issues with the pushups at basic due to lack of strong chest muscles which my recruiter didnt warn me about (oh well). And I was/am a fairly broad shouldered woman, and I was trained to do the old fashioned pushups, hands under shoulders, fingers sort of forward, etc.\\n\\nAnd yeah, my time frame was 90-92 for reference.\\n\\nBut again, thank you for the read, its \\\"interesting\\\". And no, as a sort of boomer I would never say it was harder in our day, male or female. It was it was is all.  :)\"}, {\"id\": \"25a2330b-4550-11ea-95df-60f6774aa532\", \"language\": \"en\", \"text\": \"I still don\\u2019t fuckin get the OPAT. Is it just a test to allow you into certain MOS? Where does it fit? I only ever took it once.\"}, {\"id\": \"26889ccf-4550-11ea-a44f-60f6774aa532\", \"language\": \"en\", \"text\": \"They're critiquing deadlift form???\\n\\nBro, I'm 6'5\\\" with long legs and short arms. How the fuck am I supposed to have the same form as a 5'7\\\" dude? \"}, {\"id\": \"26889cd9-4550-11ea-a333-60f6774aa532\", \"language\": \"en\", \"text\": \"I still have no idea how ACFT standards are going to work for highspeed schools.  While I do the most and best I can without quitting, it really makes me curious what kinda marks I need to maintain.  Just get 80% like normal, or what?\"}, {\"id\": \"26889cdb-4550-11ea-a746-60f6774aa532\", \"language\": \"en\", \"text\": \"180 for DL?  Ours went to like 420 or something.\"}, {\"id\": \"2688c3c3-4550-11ea-936c-60f6774aa532\", \"language\": \"en\", \"text\": \"Whats the break inbetween? I hope its an hour or two\"}, {\"id\": \"2688c3c6-4550-11ea-8c9f-60f6774aa532\", \"language\": \"en\", \"text\": \"This is going to take all day. 0230 ACFT formation here we come! \"}, {\"id\": \"2688c3c7-4550-11ea-8988-60f6774aa532\", \"language\": \"en\", \"text\": \"My goal is to max the deadlift and ball throw then min the rest.\\n\\nFuck you army. This shit is a terrible idea.\"}, {\"id\": \"2688c3ca-4550-11ea-b2d6-60f6774aa532\", \"language\": \"en\", \"text\": \"Hex bar or standard for deadlift? How demanding was the shuttle sprint? Can you detail the form they required for the leg tuck? Thanks in advance!\"}, {\"id\": \"2688c3cd-4550-11ea-afc3-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"2688c3d0-4550-11ea-b938-60f6774aa532\", \"language\": \"en\", \"text\": \"Are the leg tucks in cadence like up, pause, down, pause, over and over? Or is it at your own pace?\"}, {\"id\": \"2688c3d2-4550-11ea-bfa6-60f6774aa532\", \"language\": \"en\", \"text\": \"My whole unit just took the ACFT. They split it up over a couple of days. For example, my company did it starting at 0800 and broke it down taking it by platoons. 8 lanes, 2 graders each lane, and four to five people at a time in a lane. I started around 1230 and my whole platoon (a maintenance platoon of 86 personnel) finished the whole thing close to 1500. If anybody has any questions regarding it, you can ask. It actually ran fairly smoothly - it is just almost an all day event for a company sized element to do.\"}, {\"id\": \"2688c3d3-4550-11ea-98f0-60f6774aa532\", \"language\": \"en\", \"text\": \"Are they doing this to keep women out of combat lol?\"}, {\"id\": \"2688c3d5-4550-11ea-b233-60f6774aa532\", \"language\": \"en\", \"text\": \"All that shit and then a 2 mile run? Fire whoever came up with this.\"}, {\"id\": \"2688c3d9-4550-11ea-84a9-60f6774aa532\", \"language\": \"en\", \"text\": \"My unit is doing it this TY as we have to do it for record for 2020 also, I have heard the same story about it being easy to pass and such.\"}, {\"id\": \"2688c3da-4550-11ea-a2c8-60f6774aa532\", \"language\": \"en\", \"text\": \"The drag is 90 lbs for the sprint/drag/carry. It's not terrible. I'm going through a test class thing soon. I'll do another post about grading sometime after that.\"}, {\"id\": \"2688c3db-4550-11ea-98e0-60f6774aa532\", \"language\": \"en\", \"text\": \"I posted a calculator I made for this the other day, if you want to mess around with the scoring and standards. (Don't worry, I don't make money off it)\"}, {\"id\": \"2688c3dc-4550-11ea-9124-60f6774aa532\", \"language\": \"en\", \"text\": \"Back in November I was certified as a Level 2 ACFT Grader, (I can grade, train Level 1 graders, and be NCOIC/OIC of an ACFT).\\n\\n&#x200B;\\n\\nIf anyone has any questions that haven't already been answered, just hit me up.\"}, {\"id\": \"2688c3df-4550-11ea-b1d1-60f6774aa532\", \"language\": \"en\", \"text\": \"Because this is the test phase, your unit did not do the T push-up.  Others are (mine). It even says in the briefs that they haven\\u2019t decided yet.  I bet they plan on comparing numbers.\"}, {\"id\": \"2688c3e0-4550-11ea-9a7f-60f6774aa532\", \"language\": \"en\", \"text\": \"EIGHTEEN MINUTES TO PASS?  Dear God.\\n\\nI checked the googles, and apparently 18:00 is a passing score for men 37 and up.\\n\\nAstounding.  And it\\u2019s NINETEEN MINUTES for POGs?\"}, {\"id\": \"26e2747c-4550-11ea-8671-60f6774aa532\", \"language\": \"en\", \"text\": \"This is literally just like...'here's what the events are'.  There's no tips to be found here.\"}, {\"id\": \"26e2747e-4550-11ea-88c9-60f6774aa532\", \"language\": \"en\", \"text\": \"On the leg tuck, it's a terminate if you either a) fail to return to a straight-arm position or b) has arms fully extended in the down position\\n\\nAm I missing something?\"}, {\"id\": \"26e27480-4550-11ea-9ac7-60f6774aa532\", \"language\": \"en\", \"text\": \">will not count if index finger is outside shoulders \\n\\nRIP my shoulders/wrist. Been doing wide pushups since the day I joined lmaocry\"}, {\"id\": \"26e29b55-4550-11ea-8487-60f6774aa532\", \"language\": \"en\", \"text\": \"I didn't read the article yet but saw the picture and immediately have a question: Which way is the hex bar supposed to face up? Every example, until now, have shown Army using it upside down.\\n\\nAlso already see graders that don't lift terminating attempts because SM lowered weight too loudly (therefore, hes dropping it).\"}, {\"id\": \"26e29b59-4550-11ea-a300-60f6774aa532\", \"language\": \"en\", \"text\": \"No rest on the pushup and max run is now 12:45 shieeeet\"}, {\"id\": \"26e29b5a-4550-11ea-81f6-60f6774aa532\", \"language\": \"en\", \"text\": \"Shit. Cant drop any weights, bang them loudly, and on the sprints I have to touch the start/end line? The rules on the sprint, carry, drag seem kind of retarded.\"}, {\"id\": \"26e29b5f-4550-11ea-b4ba-60f6774aa532\", \"language\": \"en\", \"text\": \"Even a simple lift is somehow fucked up. She\\u2019s already past a major sticking point of that lift and the bar is still on the ground. \"}, {\"id\": \"26e29b60-4550-11ea-9ef0-60f6774aa532\", \"language\": \"en\", \"text\": \"Wack. \"}, {\"id\": \"277904cb-4550-11ea-a1d7-60f6774aa532\", \"language\": \"en\", \"text\": \"I'm other news, the Sham Council has authorized a hit on said soldier for failing to confirm to the standards of the Brotherhood of the Shield.\"}, {\"id\": \"277904d0-4550-11ea-a33e-60f6774aa532\", \"language\": \"en\", \"text\": \"TLDR: Dude is a former collegiate athlete and current Crossfit Games competitor. \\n\\nGood luck, normal 88Ms.\"}, {\"id\": \"27792a7f-4550-11ea-a4ee-60f6774aa532\", \"language\": \"en\", \"text\": \"A former athlete, and current crossfit competitor is in great shape. Sounds remarkably new.\"}, {\"id\": \"27792a81-4550-11ea-9136-60f6774aa532\", \"language\": \"en\", \"text\": \"Movie is in the works.  Word is Mark Wahlberg is playing the guy.\"}, {\"id\": \"27792a83-4550-11ea-af48-60f6774aa532\", \"language\": \"en\", \"text\": \"In other news,  all active duty infantrymen have developed a strange spontaneous case of lock-jaw, keeping then all silent in their congratulatory remarks.\"}, {\"id\": \"27792a84-4550-11ea-9dee-60f6774aa532\", \"language\": \"en\", \"text\": \"Oh duffelblog you're so sill-\\n\\nwtf\"}, {\"id\": \"27792a86-4550-11ea-bb85-60f6774aa532\", \"language\": \"en\", \"text\": \"Yeah because he doesn\\u2019t have a full time job like the rest of us.  /s\\n\\nGuy in my unit just got told he got the 2nd or 3rd place.\"}, {\"id\": \"27792a8b-4550-11ea-a933-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"27792a8d-4550-11ea-ba1e-60f6774aa532\", \"language\": \"en\", \"text\": \"When i was at BLC , the 88M in our platoon got the highest PT score and a coin\\n\\n&#x200B;\\n\\nMeanwhile as a 31B im just a fat army cop (if you can consider 175 pounds at 5'10 to be fat i guess)\"}, {\"id\": \"27792a90-4550-11ea-b043-60f6774aa532\", \"language\": \"en\", \"text\": \"Wayment\\n\\nLet\\u2019s talk about how five hand release pushups was worth THREE points\"}, {\"id\": \"27792a92-4550-11ea-aafd-60f6774aa532\", \"language\": \"en\", \"text\": \"Why the fuck is this news?\"}, {\"id\": \"27792a98-4550-11ea-86f5-60f6774aa532\", \"language\": \"en\", \"text\": \"Can we talk about that \\\"video\\\"? I'm a little cross that I watched 30 seconds of advertisement for 2 potato-quality pictures of the dude, one of which looked a helluva lot like a crossfit advertisement. I know popularmilitary isn't exactly the forefront of journalism, but goddamn. . .\"}, {\"id\": \"27792a99-4550-11ea-a2bb-60f6774aa532\", \"language\": \"en\", \"text\": \"Ha. I used to be in that unit.\"}, {\"id\": \"27792a9a-4550-11ea-bd09-60f6774aa532\", \"language\": \"en\", \"text\": \">Col. Joe Gardner, G3 Chief of Operations for the Kentucky National Guard, was surprised to hear that he took the ACFT after being in the field for two weeks with his unit.\\n\\nSomehow I\\u2019m not at all surprised.\"}, {\"id\": \"27792a9b-4550-11ea-9fa6-60f6774aa532\", \"language\": \"en\", \"text\": \"I was an active paratrooper for 6 years. Did 6 as a civy and now in the guard for 3 years. Active duty has an overall much more fit, better combat skilled, and warrior trained fighting force. National Guard has more extreme ends for fitness (fatties and fitties), better soft skilled (they all have day jobs), and sustained training force.\\n\\nGuard soldiers will likely take home many top awards...just don't grab an average guardsmen and expect even average results.\"}, {\"id\": \"27792a9c-4550-11ea-9529-60f6774aa532\", \"language\": \"en\", \"text\": \"I can see it now...\\nSoldier\\u2019s company commander\\u2019s OER bullet stating: \\u201cpersonally trained the highest scoring ACFT soldier in the history of the army\\u201d .. or something along those lines. \\n\\nThis only reason this is news is because someone high up in the guard wanted some good guard publicity\"}, {\"id\": \"27792a9d-4550-11ea-9d2c-60f6774aa532\", \"language\": \"en\", \"text\": \"\\u201cI didn\\u2019t think I would do as well (on the ACFT) as I did that day. I\\u2019d been sleeping on a cot and was out of my normal training routine for our unit\\u2019s summer training...\\u201d WOAH LOOK OUT WE HAVE A BADASS HERE! \\u2014 See no one cares.\"}, {\"id\": \"27792a9e-4550-11ea-b85b-60f6774aa532\", \"language\": \"en\", \"text\": \"National Guard and Reserves might score higher PT scores than active duty Soldiers because they don\\u2019t do PRT in the morning but working out with their own routine.\"}, {\"id\": \"27792aa0-4550-11ea-9939-60f6774aa532\", \"language\": \"en\", \"text\": \"We had a 585 in our class on the practice ACFT. Dude is a fucking stud and is still running 12 minute two miles.\"}, {\"id\": \"27792aa1-4550-11ea-9c8e-60f6774aa532\", \"language\": \"en\", \"text\": \"Yes.  I went to the IRR for employment incompatibility.\"}, {\"id\": \"27792aa2-4550-11ea-9c70-60f6774aa532\", \"language\": \"en\", \"text\": \"\\\"\\\"\\\"Real\\\"\\\"\\\" army btfoed once again by the Nasty Bvll, why the fuck do we even have active duty lmaoooo\"}, {\"id\": \"27792aa3-4550-11ea-a166-60f6774aa532\", \"language\": \"en\", \"text\": \"As someone who lasted 3 months before quitting the NG after AD I feel a strange sense of pride over this.\"}, {\"id\": \"27792aa5-4550-11ea-8a4d-60f6774aa532\", \"language\": \"en\", \"text\": \"Hope we can lay the whole NG/reserve thing to rest at least until an active duty guy manages to do better.\"}, {\"id\": \"27792aa6-4550-11ea-9fb9-60f6774aa532\", \"language\": \"en\", \"text\": \"This is impressive.\\n\\nHowever he didn\\u2019t max it, there are certainly soldiers out there who can max it who just haven\\u2019t taken the test yet. I wouldn\\u2019t anticipate this lasting very long.\"}, {\"id\": \"27792aa8-4550-11ea-8ade-60f6774aa532\", \"language\": \"en\", \"text\": \"Hell has frozen over, it\\u2019s the end time fellas. The first seal has broken.\"}, {\"id\": \"29175645-4550-11ea-ba9d-60f6774aa532\", \"language\": \"en\", \"text\": \"The solution is simple. Make master fitness trainer an MOS ***AND*** give them 100% control over the unit PT program (with input from squad leaders of course). They'll be able to track what training Soldiers need and assess properly where they need to be. Of course this won't happen because the army culture stubbornly holds onto the mentality that part of leadership is leading a 8-mile cadence-filled run.\"}, {\"id\": \"29175648-4550-11ea-84e8-60f6774aa532\", \"language\": \"en\", \"text\": \"It's a good idea for some branches and trash for others. I'm in aviation. I could give a fuck if my cw4 mtp can do deadlifts. Dude knows more about the airframe than I could ever hope to know and I reguarly fly in aircraft he has blessed off as being flyable. Like, daily. Trust the dude with my life in Garrison practically every day. Has had a permanent pushup and run profile since like 2012. He can't do the new test. \\n\\nIn other branches I guess you need the fitness standard but not every job in the army requires deadlifts and weighted sprints and they shouldn't. \"}, {\"id\": \"29177d74-4550-11ea-a1cc-60f6774aa532\", \"language\": \"en\", \"text\": \"THE BENT LEG BODY TWIST! \"}, {\"id\": \"29177d77-4550-11ea-abfb-60f6774aa532\", \"language\": \"en\", \"text\": \"I'm glad they got rid of regular push-ups and have hand release now. It will be significantly easier to grade and should have way less people people complaining about graders. \"}, {\"id\": \"29177d7f-4550-11ea-87cd-60f6774aa532\", \"language\": \"en\", \"text\": \"It's not CrossFit, like everything else it's been lifted directly out of Ranger Regiment, watered down, made worse, and regurgitated for conventional army. \"}, {\"id\": \"29177d83-4550-11ea-a3f9-60f6774aa532\", \"language\": \"en\", \"text\": \"All I can see if disability claims shooting up.  The amount of soldiers who have absolutely no clue how to do anything physical is astounding. The amount who think they know wtf they're doing is inversely insanely high. Pushup/sit up/run mitigated so many potential injury issues.\\n\\nWith that being said, increase the MFT allotment to 1 per platoon.  At least do SOMETHING to cool down peoples ego lifting.\"}, {\"id\": \"29177d88-4550-11ea-9b87-60f6774aa532\", \"language\": \"en\", \"text\": \">It is ALSO going to have the effect of forcing out a lot of older and fatter soldiers who can't keep up with some of this shit. \\n\\nTbh I'm still waiting for the Army to back down on this. I'll be fine personally, but there are a *lot* of people with no run or no situp perm profiles where I work.\\n\\nSure, some of them are milking that shit for all it's worth; if it was really a choice between get in shape or get out then I think we'd see the number of perm profiles noticeably drop. But drop by how much? How many are being lazy, and how many really do have a permanent injury?\\n\\nI don't think the Army should lose good, albeit broken Soldiers, just to check the block on an arbitrary Crossfit test, but who knows? HRC are experts in fucking up strength management, and it's benefited me in the past so it will probably benefit me if they fuck it up again.\"}, {\"id\": \"29177d8c-4550-11ea-aef1-60f6774aa532\", \"language\": \"en\", \"text\": \"I work in a MI unit that does 12 hr shift work. I lose a lot of great Soldiers to pt failure/ height and weight, but they are experts in the IC. I flew in an ISR plane in Iraq and could give a damn about the supporting unit's pt scores, I need someone who knows what they're doing to back me up. Half of the Military will be contractors because of the ACFT. \"}, {\"id\": \"2917a432-4550-11ea-9954-60f6774aa532\", \"language\": \"en\", \"text\": \"[Meanwhile, no one does CD3...](http://www.armyprt.com/strength_and_mobility_activities/conditioning-drill-3-cd-3.shtml) \"}, {\"id\": \"2917a435-4550-11ea-9f1e-60f6774aa532\", \"language\": \"en\", \"text\": \"\\u201cRequire you to regularly workout with weights and develop proper form\\u201d....this is a good thing, although I can see many units fucking it up. Proper weight training will make soldiers more durable and less prone to injury \"}, {\"id\": \"2917a437-4550-11ea-855c-60f6774aa532\", \"language\": \"en\", \"text\": \">at drill\\n\\nYou already have the equipment for it? \\n\\nI mean, there are people in my drill hall who are still walking around in the old ACUs\\u2014I have very little faith that we\\u2019re going to get the equipment anytime soon. I think about the logistics of this fucking test and all I do is deep sigh. \"}, {\"id\": \"2917a43a-4550-11ea-9fb8-60f6774aa532\", \"language\": \"en\", \"text\": \"I will say though, has anyone here seen the proposed standards? I ran through the ACFT a couple times late last year. They'll probably get tweaked but last I saw the non combat MOS lowest tier was laughable to pass. Like 115lb dead lift, 12 hand release push ups, 1 knee to elbow, 22 minutes on the run. I'm completely going off memory but it was something in that ballpark. Very attainable for all but the most broken where that very movement is difficult. \\n\\n\\nThe combat MOS tier was decent, and would require most people to put in some effort to pass, but again definitely in the realm of attainable.\\n\\n\\nThe max score is rough. \\n\\n\\nReally, I'm just saying people in here sound like they're asking everyone to be peak level athletes when that is not quite what is being asked of them. \\n\"}, {\"id\": \"2917a43c-4550-11ea-9013-60f6774aa532\", \"language\": \"en\", \"text\": \"My major arguments against the ACFT are as follows:\\n\\n1) too many movements. People are going to get injured doing this.\\n\\n\\n2) commanders can no longer administer a fitness test anywhere. \\n\\n\\n3) the marine corps perfected the low cost high pay of combat fitness test and have used it successfully for years. Why are we not dressing right on this? Ammo cans, sprints and dummy carry. Holy shit, actual combat related tasks. Army is focused on reverse medicine ball tosses and deadlifts.\\n\\n4) more shit on a company hand receipt that will inevitably fall into disrepair and pilfering. \\n\\nPushups, sit-ups and run can be done anywhere, and outside of a clipboard and a watch there really isn\\u2019t a huge cost to administer the current test. It would be too easy to adopt the marines\\u2019 cft and drive on. \"}, {\"id\": \"2917a43d-4550-11ea-8f3e-60f6774aa532\", \"language\": \"en\", \"text\": \"Ill take it a step further - THE ACFT is an indictment of Combat Arms Leaders. \\n\\n1 - The stated reason for the new AFCT is the lack of fitness for combat related tasks.\\n\\n2 - The root cause of that lack of fitness was identified as poor PT.\\n\\n3 - PT was poor because units were \\\"teaching the test\\\" instead of conducting PT that made soldiers physically fit.\\n\\n4 - The solution was to create a test that, if taught, would result in better overall fitness.\\n\\nLook at how backwards that is.  In essence it is saying \\\"Hey Combat Arms Leaders, you suck at conducting PT so we are going to change the way we measure physical fitness so you can KEEP SUCKING and still manage to have soldiers ready for combat.\\\"\\n\\nI am singling out Combat Arms leaders because, as has been pointed out by many here, these are skills that are not as necessary for some MOSs.  The other elephant in the room is age.  Sorry, but if you are a 50 year old ANY MOS dude the chances of you needing to dead lift something under fire approach zero.  \\n\\nTake a look at FM 7-22 and the utter failure of Combat Arms leaders becomes even more apparent.  Remember, the APFT was good enough for us to fight multiple small conflicts and get us through 18 years of GWOT so it was doing something right for a long time meaning the regression to \\\"teach the test\\\" is relatively new.  Lets go through it a little:\\n\\nCOMMANDERS AND OTHER LEADERS ARE RESPONSIBLE FOR TRAINING (their emphasis not mine but it should be yelled!)\\n\\n1-7.Physical  readiness  training  is  the  commander\\u2019s  program.  Chapter  3,  Leadership,  discusses  this  principle  of training in detail. Commanders are the primary training managers and trainers for their organization. Senior noncommissioned  officers  (NCOs)  at  every  level  of  command  are  vital  to  helping  commanders  meet  their  training  responsibilities.  Senior  NCOs  are  often  the  most  experienced  trainers  in  the  unit;  they  are,  therefore,  essential  to  a  successful  PRT  program.  Leaders  should  emphasize  the  value  of  PRT  by  clearly  explaining  the  objectives and benefits of the program. They must also use the time allotted for PRT effectively.\\n\\nSo right there in the first chapter, we lay out that if PT sucks, its the commanders fault.  Further, Senior NCOs are supposed to be the SMEs on this.  Lets move down a bit:\\n\\n- Align PRT with mission/METL (mission-essential task list) requirements in support of full spectrum operations.\\n\\n- Train to standard according to this FM.\\n\\nWait is says RIGHT THERE that PT is supposed to be tailored to the unit.  So if you are a Combat Arms unit, you should be doing dead lifts and shuffle drags but if you are an INSCOM MI BN you should be doing upper back and shoulder work to make up for 8 hours a day of spinning and grinning.  We are at page 1-2 and we have already shown that the need for the ACFT is bad leaders.  Lets keep going.\\n\\n1-9. Noncommissioned  officers  serve  as  the  primary  trainers  for  enlisted  Soldiers,  crews,  and  small  teams.  Noncommissioned  officers  must  conduct  standards-based,  performance-oriented,  mission-  and  METL-focused  PRT. To accomplish the PRT mission, NCOs\\n\\n- Identify specific tasks that PRT enhances in support of the unit\\u2019s C- or D-METL. \\n\\n- Individual. Crew. Small team. \\n\\n- Prepare, rehearse, and execute PRT. \\n\\n- Evaluate PRT and conduct AARs to provide feedback to the commander. \\n\\nWhat part of that says teach the test?  What part of that says we should all do the same PT no matter what our mission is?  Leader Failure, specifically Combat Arms Leader Failure.\\n\\n1-12. All Army training is based on the principle \\u201cTrain as you will fight;\\u201d therefore, the primary focus of PRT goes far beyond preparation for the APFT. Soldiers improve their physical readiness capabilities through PRT. For  Soldiers  to  achieve  the  desired  standard  of  physical  readiness,  every  unit  training  program  must  include  a  well-conceived  plan  of  PRT.  Training  must  be  both  realistic  and  performance-oriented  to  ensure  physical  readiness to meet mission/METL requirements. \\n\\nOh this is getting embarrassing.  Its almost like the folks who wrote this FM knew there were complaints about people just teaching the test and SPECIFICALLY called out not teaching the test.  We are still in the first CHAPTER of the FM and the best case is that Combat Arms Leaders can't read.  I say best case because if they can read, they were willfully non-compliant with an Army Regulation (AR 350-1 directs PT in accordance with FM 7-22). \\n\\n3-1. The success or failure of the PRT program depends upon the quality of its leadership. Leadership is the process of influencing Soldiers by providing purpose, direction, and motivation. The best outcome results only when  Soldiers  extend  themselves  completely  in  strenuous  physical  activities  and  perform  all  exercises  in  the  prescribed  form.  Officers  and  NCOs  lead,  train,  motivate,  and  inspire  their  Soldiers.  Only  the  best  leadership  can  inspire  Soldiers  to  cooperate  to  this  extent.  For  these  reasons,  only  the  best  qualified  NCOs  in  the  unit  should lead PRT. The leader must exemplify the Army adage: Be, Know, Do. \\n\\nYeah I don't know how much more clear that could be.  If PT sucks, your leaders suck.  Plain as day.\\n\\nBTW - take a look at 3-14, Scheduling and you will find this nugget:\\n\\n- Schedule and conduct PRT when it makes the most sense. Physical readiness training should not be reserved only for the early morning hours and may run during or at the end of the duty day.\\n\\nDon't blame \\\"The Army\\\" for blind adherence to PT being at stupid 30, blame stupid leaders who apparently can't read.  \\n\\nOk, so we have already established that a lot of these Combat Arms Leaders are dim bulbs who can't read (don't @ me unless you want to sign up for willful non-compliance because that is a punishable offense) so all the gibber jabber about the different exercises and conditioning phases is probably too much for them.  How in the world could you make a PT plan based on being a dim bulb?  You turn to Chapter 5-2 and there it is.  Monday through Friday.  Every task.  Every goddamn thing you need to do laid out for you.  You literally don't have to think.  5-24 even has what to do when you are short on time!  YOU DONT NEED TO THINK!  Ah but you are a crazy enough Combat Arms leader to read the header that says BCT/OSUT.  Skip to 5-9 and its all there for you regular unit.  But think about this, if your complaint is \\\"these new kids\\\" (because its always the new ones) then maybe you should start with getting them up to speed.  In any case, the same detailed schedule is available for sustaining units too.\\n\\nRight about now the dim bulb Combat Arms Leaders are pretty pissed at me and are looking for an out. \\\"Great so you told me what needs to be in each PT session but it still has to go on the long range training calendar smart guy.  How am I supposed to know how that fits in?\\\"  Fortunately the writers of the FM actually understood how stupid and incompetent Combat Arms Leaders were so in chapter 5-10 they made an actual ONE YEAR CALENDAR with PT down to the exact day, federal holidays included.  All you have to do is copy and paste and BOOM instant excellent PT.  Nope, apparently too hard.\\n\\nSo lets review:\\n\\n- PT sucks\\n\\n- If PT sucks then its because leaders suck\\n\\n- Even if you suck as a leader, we wrote out a suck proof plan that you just had to paste into your training schedule\\n\\n- PT sucks\\n\\nI just found out I am sticking around to my MRD so I am likely to have to take this cross fit based abomination a few times.  Every time I do I will loudly proclaim that it exists because Combat Arms \\\"Leaders\\\" were too stupid to work a mouse and since I have 32 years and will never get promoted again, IDGAF who hears me.  And since that PT Test will be done at Ft Meyers, the chances of the Chief and SMA hearing are high.  \\n\\nThanks for coming to my TED talk.\\n\"}, {\"id\": \"2917a43e-4550-11ea-8841-60f6774aa532\", \"language\": \"en\", \"text\": \"I love it because I hate fat people and this test will literally only help me stand out even more \"}, {\"id\": \"2917a446-4550-11ea-8d30-60f6774aa532\", \"language\": \"en\", \"text\": \">But the ACFT is gonna require you to regularly workout with weights and develop a proper form or else you'll be laid out from a back spasm b/c you carried the kettlebells wrong during the Sprint-Drag-Carry.\\n\\nHoly fuck I really hate this mentality in the Army that anything that isn't a push-up, a sit-up, or a 8 mile run is considered \\\"cross-fit\\\" by military dudes who think compound movements and exercises are scary because the last time they touched a barbell it was connected to a Smith Machine. \\n\\nThe events are not hard, and once the culture around physical fitness in the Army catches up with the rest of the athletic world we'll be a stronger fighting force because of it. \"}, {\"id\": \"2917a448-4550-11ea-80fd-60f6774aa532\", \"language\": \"en\", \"text\": \"I do CrossFit \"}, {\"id\": \"2917a44b-4550-11ea-ba82-60f6774aa532\", \"language\": \"en\", \"text\": \"I can only imagine the shitshow this will cause in my unit, in which 50% of the soldiers are broken and most of the other 50% are out of shape. Fortunately, I'll be out by then. \"}, {\"id\": \"2917a44d-4550-11ea-9697-60f6774aa532\", \"language\": \"en\", \"text\": \"It requires too much equipment, time, effort, and people are going to get hurts. It\\u2019s a terrible idea.\"}, {\"id\": \"2917a44f-4550-11ea-b934-60f6774aa532\", \"language\": \"en\", \"text\": \"Time to bring the hammer and start filtering who stays and goes harder. I think army has been more then fair to profiles and it's time we take back medical readiness. It's a dope test and I love it plus it's great for teaching soldiers workouts and overall helping with gym material for them.\"}, {\"id\": \"2917a450-4550-11ea-91b4-60f6774aa532\", \"language\": \"en\", \"text\": \"Curious how many people will fail initially! If your not training for this and doing lactic acid threshold training the run at the end is going to crush people. \\n\\nI think it's a better overall test, but it can't be ran anywhere, as quickly or cheaply as the good ole APFT. \\n\\nI'm also curious how it will work for promotion points... a 90 pound female has to deadlift close to 4x her body weight to max the event. Don't see how that is going to work and am curious if they considered that. \\n\\nHas anyone heard about promotion points for the ACFT?\"}, {\"id\": \"2917cb42-4550-11ea-a0de-60f6774aa532\", \"language\": \"en\", \"text\": \"They're going to have to tweak the test. I have a couple great fire direction Soldiers who weigh about a buck soaking wet. Expecting them to deadlift 180lbs for a 3RM in a reserve component is asking for injuries. \"}, {\"id\": \"2917cb47-4550-11ea-a1c2-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"2917cb49-4550-11ea-b2a6-60f6774aa532\", \"language\": \"en\", \"text\": \"I personally can't wait. I think it is better (easier) than the current APFT and it will help thin the ranks of malingerers. \"}, {\"id\": \"2917cb4a-4550-11ea-b22f-60f6774aa532\", \"language\": \"en\", \"text\": \"Every SGM I've seen is 100% unable to conceive of the ACFT causing injuries. \\n\\n\\n\\\"NCOs are 100% effective in training all ACFT events, and Soldiers are 100% effective in performing exactly as trained\\\" Type wishful thinking bullshit.\"}, {\"id\": \"2917cb4b-4550-11ea-82e0-60f6774aa532\", \"language\": \"en\", \"text\": \"> I can also see a lot of soldiers injuring themselves b/c they don't  properly train with weights prior to the test. You can bang out sit-ups,  push-ups, and running just about anywhere. \\n\\n&#x200B;\\n\\nAbsolutely. I see this being about as short lived as the ACUs. It's a war-time AAR reactionary feel good attempt at making people more prepared for the next failure of diplomacy that'll put boots on the ground in another shithole. What I mean is, they reviewed the data from OEF/OIF and thought, we could have done better if people were trained to do this. So Joes will no train, in their PT uniforms (not in full battle rattle) how to drag dead weight (like their injured battle buddy), lift heavy things (like equipment and their overloaded rucksacks), and throw heavy balls (like.... nobody does ever).\\n\\nI wonder how many people will get a false sense of confidence and try \\\"dead lifting\\\" a crate that is not even remotely similar to the shape, size, or weight of the trap bar and permanently fuck up their back. Just one of many potential scenarios.\\n\\nI get the concept, but the implementation is poor and lacks the foresight of knowing how Joes do dumb things. \\n\\nI absolutely think these events and their respective training exercises should be a regular part of Army training. But I don't see that being done effectively, and, knowing what I know about how the Army does things, it's going to end up with *a lot* of injuries and, down the road, VA disability claims. People still can't properly shape their black berets, but they're going to be expected to use proper deadlift form without jacking up their backs? Come on man.\\n\\nAt the risk of calling out any particular MOS, this is called the Army COMBAT Fitness Test. Yes, everyone is a soldier first, but even in combat they might never be a \\\"combat\\\" soldier. So, again, this may put certain jobs at a higher risk of injury than others. \\n\\nAlso, half of the events require equipment to perform them. It's almost like the brain trust behind this has a deal with someone to provide / install it all? How many trap bars, sleds, blue balls (haha), plate weights, etc. are going to have to be purchased? Plus building those climbing bars. Is every installation going to construct a PT test facility so each individual unit doesn't have to acquire this stuff? Or are all the gyms expected to have it all readily available... assuming there is a gym on the base where it's being done.\\n\\nI look forward to seeing whether I'm right or wrong. I hope for the best, but expect nothing less than a complete cluster fuck, because that's the Army I've come to know, love to hate, and hate to love.\\n\\nYMMV\\n\\nTLDR: This is a train wreck in the making.\\n\\n&#x200B;\"}, {\"id\": \"2917cb4c-4550-11ea-8813-60f6774aa532\", \"language\": \"en\", \"text\": \"The whole age and gender neutral thing is gonna have to go if they want to tie it to promotions. Otherwise it\\u2019s gonna be a huge shit show legally. There\\u2019s gonna be a lot of female SPC and SGTs who can\\u2019t make points. \"}, {\"id\": \"2917cb52-4550-11ea-bd44-60f6774aa532\", \"language\": \"en\", \"text\": \"It'll hit the old/fat Soldiers AND require people to actually train with weights and proper form? Oh the horror!\"}, {\"id\": \"2917cb53-4550-11ea-a263-60f6774aa532\", \"language\": \"en\", \"text\": \"Have they put out how NG/USAR soldiers are expected to do this?\"}, {\"id\": \"2917cb55-4550-11ea-9e78-60f6774aa532\", \"language\": \"en\", \"text\": \"So many permanent profiles to rewrite... FML \\n\\nHaven't seen guidance about alternate events or what's is mandatory for continued service. \"}, {\"id\": \"2917cb56-4550-11ea-97f8-60f6774aa532\", \"language\": \"en\", \"text\": \"As a junior WO, I fully support forcing out older fatter soldiers #FuckYeahCW4wootwoot\"}, {\"id\": \"2917cb57-4550-11ea-b5b9-60f6774aa532\", \"language\": \"en\", \"text\": \"Unless you're injured, passing a fitness test should never be an issue. If you're sweating thinking about passing, you're wrong. Plain and simple. \\n\\nI feel like the people worried about the new fitness test are the same ones who struggle with the current test. Get your ass to the gym and shut the fuck up. It doesn't take much to stay in shape.  \\n\\nIf you want to be fat and lazy, get the fuck out. \"}, {\"id\": \"2917cb58-4550-11ea-ab84-60f6774aa532\", \"language\": \"en\", \"text\": \"And hates warrant pilots.\"}, {\"id\": \"2917cb59-4550-11ea-be6f-60f6774aa532\", \"language\": \"en\", \"text\": \"I really don't understand how all these people are going to get hurt taking the ACFT?\\n\\nIf you can't deadlift 160 lbs or whatever the amount is, you probably shouldn't be in the army anyway. \"}, {\"id\": \"2917cb5b-4550-11ea-b076-60f6774aa532\", \"language\": \"en\", \"text\": \"They were gonna injure themselves doing soldier tasks anyways. When y'all go to the field, you load trucks, carry gear, lift things and put them down. It's a good measure to help train warriors on proper lifting techniques and strength.\"}, {\"id\": \"2917cb5c-4550-11ea-b026-60f6774aa532\", \"language\": \"en\", \"text\": \"All I see are even more events for me to embarrass the rest of the unit but get hassled for height and weight because I have a small neck. \\n\\nSide note* If everyone is aware that I'm a competitive powerlifter can I just be exempted from the deadlift? Lol\"}, {\"id\": \"2917cb5d-4550-11ea-9d6e-60f6774aa532\", \"language\": \"en\", \"text\": \"All about trimming the fat and getting back to the roots of what the army should be about. I have no issues with this \"}, {\"id\": \"2917cb5e-4550-11ea-aab4-60f6774aa532\", \"language\": \"en\", \"text\": \"My favorite part is how they took parts of USMC CFT, and just said \\\"fuck it, its an army thing now. Lets throw an A on there and call it good.\\\"\"}, {\"id\": \"2917cb60-4550-11ea-926f-60f6774aa532\", \"language\": \"en\", \"text\": \"Same here, had the same thoughts lol\"}, {\"id\": \"2917cb61-4550-11ea-83df-60f6774aa532\", \"language\": \"en\", \"text\": \"That would appear to be the case.\"}, {\"id\": \"2917cb62-4550-11ea-b5e6-60f6774aa532\", \"language\": \"en\", \"text\": \"There will be alternate events or this wont happen. You just cant kick out Soldiers on a permanent. If you do theres going to be a lot of disability/medical chapters and no one to fill those leadership slots \"}, {\"id\": \"2917f21b-4550-11ea-9cd8-60f6774aa532\", \"language\": \"en\", \"text\": \"DRILL....ahahahahahahaa jesus....old, fat, shamming assholes in drill...so yeah...nice way of Army kicking you assholes out\"}, {\"id\": \"2917f21d-4550-11ea-abd2-60f6774aa532\", \"language\": \"en\", \"text\": \"Should already be using weights and preparing for this, you had fkin 3 years to prepare...its called discipline.....fkin NG/Reserves are trash\"}, {\"id\": \"29e0cfc6-4550-11ea-bd0b-60f6774aa532\", \"language\": \"en\", \"text\": \"The leg tuck is harder than you think.\\n\\n&#x200B;\\n\\nAlso, the sprint-drag-carry is a beast.\\n\\n&#x200B;\\n\\nAnd fuck the two-mile run. Why can't we just be like the Navy, Air Force, and CG and just run 1.5 if we're truly going to have to run?\"}, {\"id\": \"29e0cfc8-4550-11ea-81d3-60f6774aa532\", \"language\": \"en\", \"text\": \"Why the fuck we still running two miles after all that shit?\"}, {\"id\": \"29e0cfce-4550-11ea-be6c-60f6774aa532\", \"language\": \"en\", \"text\": \"It seems dumb easy to sham, like seriously for a good portion of MOSs the minimum requirements to pass are outstandingly easy. The other thing I don't really like about it is if you actually were to try and 600/600 the test you have to basically be superhuman. I also don't really get the point of it, I understand they were trying to make it more equal for male and female soldiers but in all honestly it just seems to make it even more divided. Correct me if I'm wrong but that's the way it seems to me\"}, {\"id\": \"29e0cfd1-4550-11ea-9990-60f6774aa532\", \"language\": \"en\", \"text\": \"Why the 2 mile?\\n\\nBecause u/CSM_AIRBONE don't want no paratroops falling out of his 'tallion run \"}, {\"id\": \"29e0cfd2-4550-11ea-8237-60f6774aa532\", \"language\": \"en\", \"text\": \"One thing I haven't seen is a change in PT; a lot of the new test requires gym time and my unit does almost entirely PRT BS. Don't make the new test based on things like deadlift and give no one time to go to the gym and actually deadlift. \\n\\nYes, there is your own gym time, but we might as well do that for company PT since we all know PRT is worthless and helping no one. Units have to incorporate strength training and I don't see that happening\"}, {\"id\": \"29e0cfd3-4550-11ea-8e7e-60f6774aa532\", \"language\": \"en\", \"text\": \"The Leg Tuck is a fucking PRT exercise, private. Climbing Drill motherfucker, do you do it?\"}, {\"id\": \"29e0cfd7-4550-11ea-b86e-60f6774aa532\", \"language\": \"en\", \"text\": \"Someone is going to deadlift waaaaay more than they can handle and then pull their back muscle. They are then fucked for the other events......\"}, {\"id\": \"29e0cfd9-4550-11ea-baa8-60f6774aa532\", \"language\": \"en\", \"text\": \"What do I think of the AFCT?  Hmmm, well at first I was like \\\"f**k yeah gender neutral pt test!\\\" And also I really get tired of chaptering out 17's who have rainman level skills but run slower than my dead grandmother, because seriously, they're never going to see combat so it actually doesn't matter.  \\n\\n\\nBut then I saw it was this retarded conglomeration of nonsense almost like some LT woke up one day and was like, \\\"let's make the Army the Marines only stupid!\\\"  And everyone was like, \\\"that's a great idea LT!  You make sure to put that on your OER!\\\"  And the AFCT was born.\\n\\n\\nAlso we can't just kick out everyone on permanent profile, that's like all of the senior leadership.  If you've been in the Army more than 15 years and still have knees it's a Christmas miracle.  What are we just going to have PVTs running shit?  Dumb\\n\"}, {\"id\": \"29e0cfda-4550-11ea-bc46-60f6774aa532\", \"language\": \"en\", \"text\": \"People ask about why we need the run after the test and whatnot and I did too but I finally got a pretty good answer the other day.  This also goes in hand with the \\u201cyou\\u2019ll never run in combat\\u201d response you hear a lot\\n\\nWell, I was speaking to my PSG the other day, and just bullshitting when he started talking about one certain deployment he was on in 2/75 in 2011 when a certain chinook was shot down. He was saying after however long of fighting and however long of exhaustion it was starting to slow down and eventually a guy who weighed well over 200 lbs was hit and the platoon had to move him over 2 miles to an extraction in a very short amount of time, the dudes he was with all had to run very hard with all their gear on in a combat zone. \\n\\nI don\\u2019t like to put any specifics as I don\\u2019t want to discredit anything with faulty information from myself or misunderstanding\\n\\nE: also - he heavily supports the AFCT for that reason\"}, {\"id\": \"29e0cfde-4550-11ea-85a9-60f6774aa532\", \"language\": \"en\", \"text\": \"I think the ball is stupid but I'm just salty because you're right... I'm really fucking uncoordinated. I have the strength for DL and the stamina for running and the speed for sprints but goddamn I am constantly tripping and falling over and I think this will probably mean I suck at the ball throw event\"}, {\"id\": \"29e0cfdf-4550-11ea-a70e-60f6774aa532\", \"language\": \"en\", \"text\": \"Why do people hate running in any pt test? Should cardio not be incorporated into Army lifestyle?\"}, {\"id\": \"29e0cfe7-4550-11ea-b5e7-60f6774aa532\", \"language\": \"en\", \"text\": \"As a 79R, I don\\u2019t like it. The current apft is so easy to train for. I don\\u2019t want to be functionally fit \\ud83d\\ude2d\"}, {\"id\": \"29e0cfe8-4550-11ea-a18e-60f6774aa532\", \"language\": \"en\", \"text\": \"Sounds like mamma raised a bitch\"}, {\"id\": \"29e0cfe9-4550-11ea-97fe-60f6774aa532\", \"language\": \"en\", \"text\": \"Max deadlift not heavy enough, that is all\"}, {\"id\": \"2ac08d42-4550-11ea-b6c0-60f6774aa532\", \"language\": \"en\", \"text\": \"This has gotten old so fast and we still have like 2 years to go before we does this shit. I\\u2019m going to come onto Reddit on October 2019 and read \\u201cWe\\u2019re really serious...you\\u2019re going to do a leg tuck!\\u201d - SMA Dailey and still have a year to go.\\n\\nLike, fuck, we get it. When can I use my CAC at the DFAC to pay for meals, instead of taking out money at the ATM? Let\\u2019s talk about that shit.\"}, {\"id\": \"2ac08d47-4550-11ea-a264-60f6774aa532\", \"language\": \"en\", \"text\": \"\\u201cWe\\u2019ve got to get this Army hard,\\u201d [General] Milley added. \\u201cWe\\u2019ve got to get it hard fast.\\u201d\\n\\nYou heard the man.\"}, {\"id\": \"2ac08d4d-4550-11ea-b624-60f6774aa532\", \"language\": \"en\", \"text\": \"if you're not in surgery/injury recovery and you can't pass an APFT in 2 months, you're fucking Jabba.\"}, {\"id\": \"2ac08d50-4550-11ea-95e8-60f6774aa532\", \"language\": \"en\", \"text\": \"This slide is current \"}, {\"id\": \"2ac08d51-4550-11ea-b45a-60f6774aa532\", \"language\": \"en\", \"text\": \"And they think USAREC is having a hard time recruiting now! \\nJust wait until they start failing all of these new DEPS in Basic Training...\"}, {\"id\": \"2ac08d55-4550-11ea-9600-60f6774aa532\", \"language\": \"en\", \"text\": \"I\\u2019m going to look like a dick throwing a medicine ball backwards down the street.\"}, {\"id\": \"2ac08d57-4550-11ea-bf23-60f6774aa532\", \"language\": \"en\", \"text\": \"Just the logistics of the equipment needed for this PT leads me to believe it won\\u2019t be around long. They are trying to cram too much in. \"}, {\"id\": \"2ac08d5d-4550-11ea-86cc-60f6774aa532\", \"language\": \"en\", \"text\": \"Says the guy that looks like he ATE Mark Milley\"}, {\"id\": \"2ac08d5e-4550-11ea-bd36-60f6774aa532\", \"language\": \"en\", \"text\": \"Ill just workout during office hours. Fuck em.\"}, {\"id\": \"2ac08d5f-4550-11ea-9c6e-60f6774aa532\", \"language\": \"en\", \"text\": \"I can get in shape any time I want to. I just choose not to\"}, {\"id\": \"2ac08d60-4550-11ea-9cb1-60f6774aa532\", \"language\": \"en\", \"text\": \"*Milley cited the Koren War and how many soldiers weren't prepared for the peninsula's hilly terrain, resulting in 'countless numbers' of deaths*\\n\\n\\n\\nDude the \\u201ckoren\\u201d war happened in 1950-53. The only thing them vets today are lifting is the beers at the vfw. \\n\"}, {\"id\": \"2ac08d62-4550-11ea-8a66-60f6774aa532\", \"language\": \"en\", \"text\": \"Hard to take that headline seriously when Milley's idea of \\\"getting in shape\\\" consists of running a 21 minute two miler and deadlifting 140lbs on a trap bar. I guess that one leg tuck is pretty rough as well.\\n\\nYou'd have to be super broken by the Army to not pass the ACRT.\"}, {\"id\": \"2ac08d65-4550-11ea-bb7f-60f6774aa532\", \"language\": \"en\", \"text\": \"24 months, thats generous\"}, {\"id\": \"2ac08d66-4550-11ea-ad05-60f6774aa532\", \"language\": \"en\", \"text\": \"When im at an outpost and ISIS is throwing VBIEDs at us ....  the fack that your PT test was on the low grade scale doesnt matter.\"}, {\"id\": \"2ac08d68-4550-11ea-869f-60f6774aa532\", \"language\": \"en\", \"text\": \"I do think the medicine ball throw is dumb and pointless, but ther rest of the test I like\"}, {\"id\": \"2ac0b434-4550-11ea-9d3e-60f6774aa532\", \"language\": \"en\", \"text\": \"Meanwhile, my BDE still isn\\u2019t allowing us to buy gym equipment. Got it.\"}, {\"id\": \"2ac0b435-4550-11ea-b230-60f6774aa532\", \"language\": \"en\", \"text\": \"Good, I'll be out by then.\"}, {\"id\": \"2ac0b436-4550-11ea-bc75-60f6774aa532\", \"language\": \"en\", \"text\": \"Let\\u2019s see Miley\\u2019s fat ass do the test. \"}, {\"id\": \"2ac0b437-4550-11ea-97c8-60f6774aa532\", \"language\": \"en\", \"text\": \"#boss\"}, {\"id\": \"2b18307a-4550-11ea-9f0b-60f6774aa532\", \"language\": \"en\", \"text\": \"100 squats \\n\\n100 pushups\\n\\n100 situps \\n\\n10km run\\n\\nEvery day\"}, {\"id\": \"2b18307f-4550-11ea-a08b-60f6774aa532\", \"language\": \"en\", \"text\": \"So, here's the big flaw I see. You've talked a little bit about how some people are struggling with a ton of different events. So you want to grab this and you want to fix. Cool.\\n\\nOne problem... if they're struggling with pull-ups, then saying \\\"50 pull ups\\\" is meaningless. You may as well say 1000 or 1000000, they're not gonna' do 50. If they can't knock out 10 pullups reliably, then that's the number they need to do, and then overtrain beyond that with a second set or partner assisted. And then that's enough.\\n\\nSame thing goes for a lot on there. If they can't run an 8 minute mile, 3x 7:00 minute miles is just going to be failed repeatedly, and you run a high risk of drastically increasing the injuries.\\n\\nIn short, I like what you're aiming for, but you need to develop workouts that are achievable for their *current* state of fitness, not the state you want them to be at.\"}, {\"id\": \"2b183081-4550-11ea-bfde-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"2b183084-4550-11ea-844b-60f6774aa532\", \"language\": \"en\", \"text\": \"JFC dude you're going to have so many fucking injuries from muscular exhaustion. Additionally, I will bet my wife's asshole the diets to go along with this are mediocre at best, which will kill any muscle growth.\\n\\n4 days of intense workouts with 15 minutes warm up and 10 minutes cool down stretching.\\n\\n1 day of sitting on the couch like a God damn American\\n\\n1 day of super light cardio with 45 minutes of stretching\\n\\n1 day of only cardio.\\n\\nThis is a base model for numerous programs, follow it .\"}, {\"id\": \"2b183086-4550-11ea-b80c-60f6774aa532\", \"language\": \"en\", \"text\": \"I see injury. Injury like a mf if you do this.\"}, {\"id\": \"2b183087-4550-11ea-984b-60f6774aa532\", \"language\": \"en\", \"text\": \"Homie, this is awful.\\n\\nThe effort is solid.\\n\\nBut you clearly have no idea how to design a workout schedule.\\n\\nGet with your MFT. Don't pull shit out of thin air, and don't think 2/days are realistic every single day after work.\"}, {\"id\": \"2b183089-4550-11ea-b84f-60f6774aa532\", \"language\": \"en\", \"text\": \"Staggered column discipline is the most important thing I see on this list\"}, {\"id\": \"2b18308b-4550-11ea-bd3d-60f6774aa532\", \"language\": \"en\", \"text\": \">and the individual soldiers who don\\u2019t pursue fitness in their free time.\\n\\nWell what does your unit's first formation and COB look like on a daily basis?\"}, {\"id\": \"2b18308d-4550-11ea-ae8a-60f6774aa532\", \"language\": \"en\", \"text\": \"High repetitions of any exercise can and will lead to injury. \\n\\nMy suggestion would be to break up the big sets into smaller multiple sets.\\n\\nAlso if your not gainfully employed throughout the day have them do 15-20 push-ups on the hour all day.\"}, {\"id\": \"2b18308f-4550-11ea-babf-60f6774aa532\", \"language\": \"en\", \"text\": \"> So my platoon just averaged like 230 on the latest PT test   \\n>  \\n>\\\\*proceeds to implement PT plan that platoon with 230 average could never, ever handle\\\\*\\n\\nThere are plenty of resources designed for APFT improvement. As a team leader start with a plan like that for your team and let the results speak for themselves.\"}, {\"id\": \"2b183090-4550-11ea-9b8d-60f6774aa532\", \"language\": \"en\", \"text\": \"Are you providing time during the work day or is it expected to stay after 1700 to complete the \\\"afternoon\\\" portion? \\n\\nLooks like youve put a lot of thought into this\"}, {\"id\": \"2b183092-4550-11ea-826e-60f6774aa532\", \"language\": \"en\", \"text\": \"Squats, deadlift, and running on the same day and no recovery days? I hope you like plateauing because this is how you plateau. What are your fitness goals. I see no plan for progression.\"}, {\"id\": \"2b183093-4550-11ea-8c71-60f6774aa532\", \"language\": \"en\", \"text\": \"I can literally max a pt test following a basic strength training program that is 45 minutes and only 3 times a week. Add in some basic running program and you are set. It's really obvious you have very little real knowledge of how to design a program. Yet you are trying to reinvent the wheel. Why don't you just use the resources that exist?\"}, {\"id\": \"2b183095-4550-11ea-8665-60f6774aa532\", \"language\": \"en\", \"text\": \"How are you just going to leave out wheeler gulch....\"}, {\"id\": \"2b183097-4550-11ea-b127-60f6774aa532\", \"language\": \"en\", \"text\": \"Thanks for the feedback thus far. Ultimately I want to see results and the dudes get stronger and higher PT Scores. Then they can develop their own routines internally. I just find it frustrating that no one seems to give a fuck and blow it off as just \\u201cgo to the gym\\u201d or \\u201cyou need to run more.\\u201d\\n\\nI am not an expert which is why I\\u2019m asking for feedback, so I appreciate alternative solutions and critiques.\"}, {\"id\": \"2b183099-4550-11ea-a2f1-60f6774aa532\", \"language\": \"en\", \"text\": \"This is maybe too much training and will lead to injuries. Go look up the training regimen of Olympic sprinters, I'll try and edit this when I have time to find it, but suffice to say olympic level athletes whose whole job is to train don't train this much. \\n\\nPeople need significantly more rest time than this to really improve.\\n\\nYour soldiers will likely improve more with less training and a greater focus on diet modification.\"}, {\"id\": \"2b18309a-4550-11ea-a93d-60f6774aa532\", \"language\": \"en\", \"text\": \"Not bad, but head on over to CronusFit.org and look at their free squad pt plans. These guys are former batt boys and know what they\\u2019re doing.\"}, {\"id\": \"2b18309c-4550-11ea-8753-60f6774aa532\", \"language\": \"en\", \"text\": \"Everyone thinks they're a personal trainer. What is your pt score and what excersize do you do every week?\"}, {\"id\": \"2b18309f-4550-11ea-9b32-60f6774aa532\", \"language\": \"en\", \"text\": \"Focus on one area a day. Not pullups and and running in same day....\"}, {\"id\": \"2b1830a0-4550-11ea-881a-60f6774aa532\", \"language\": \"en\", \"text\": \"The standard is 180. If the army wanted a higher standard then they would raise it.\"}, {\"id\": \"2b1830a1-4550-11ea-b80e-60f6774aa532\", \"language\": \"en\", \"text\": \"Depends on what your guys are struggling on as well\"}, {\"id\": \"2b1830a3-4550-11ea-a19c-60f6774aa532\", \"language\": \"en\", \"text\": \"You are using your push muscles for several days in a row.  Dont do that.\"}, {\"id\": \"2b1830a4-4550-11ea-a226-60f6774aa532\", \"language\": \"en\", \"text\": \"Looks good\"}, {\"id\": \"2b7125ff-4550-11ea-8497-60f6774aa532\", \"language\": \"en\", \"text\": \"I have an opinion\"}, {\"id\": \"2b712600-4550-11ea-9785-60f6774aa532\", \"language\": \"en\", \"text\": \">Furthermore, in combat, the number one reason for soldier evacuation is musculoskeletal disorders (24 percent),\\n\\nI don't know how I feel about this.\\n\\nThey're essentially saying that this new physical condition will significantly reduce this.\\n\\n...but is that the cause?  Or is it the nature of the war's we're fighting.\\n\\nWe're loading up Soldiers with a shit ton of gear, and marching them through **the Hindu fucking Kush**.  Or telling them to get up and down from guard towers or hescos weighed to shit in poorly built structures.\\n\\nWe're also benefiting from being in such a modern era that we can afford to do this.  WWII they weren't evacing dudes because they twisted their ankle or fucked their shoulder up.\\n\\nPart of this is the cost of doing business.  I'm just not sure how *this* test, specifically, will prevent the type of muscoskeletal issues they're talking about.\"}, {\"id\": \"2b712602-4550-11ea-a881-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"2b712605-4550-11ea-b918-60f6774aa532\", \"language\": \"en\", \"text\": \"The deadlift is fine, anyone that complains improper form is going to fuck up Joe's back is dumb. Joe has been picking up shit wrong for decades that's why so many dudes have back problems. Teaching proper form could help remedy that. \"}, {\"id\": \"2b712606-4550-11ea-91c2-60f6774aa532\", \"language\": \"en\", \"text\": \"It's going to take too long\\n\\nBut at least I don't have to do sit-ups ever again. \"}, {\"id\": \"2b712609-4550-11ea-bf0c-60f6774aa532\", \"language\": \"en\", \"text\": \"So I've taken and passed the ACFT. My APFT is consistently 280+, I have no profiles, so I'm not out of shape and bitching for the sake of that. \\n\\nThe test takes a long time to set up and administer, and there are currently no planned alternate events for those with profiles, which is the wrong answer. I think it is an insane amount of setup for those situations where you have a small number of people taking a short notice PT test for schools, boards, and whatnot. \\n\\nI absolutely fucking hate how many nuanced fucking mini-standards there are for the hand release pushups. Current pushup form can end up a point of controversy sometimes, those will be doubly so as people can't figure out how not only to grade them, but how to perform them. The rest position rules are pretty harsh. I fucking hate them.  Just replace that dogshit with actual pushups that are mostly retard-proof and an Army staple. I max APFT pushups and the hand release pushups I found to be pretty frustrating. I find hand release pushups to be basically haram. A sin against Army tradition. A bastard exercise. Leave that weirdo shit to the Air Force and let soldiers do pushups as we have been for generations. \\n\\nI am in favor of the deadlift. Love deadlifts. Can't say a negative word against that. \\n\\nThe sled drag carry and the sprints are miserable but make sense. \\n\\nThe two mile run might as well be a one miler with a faster standard. You're already smoked at that point so what is the difference? The second mile is going to be the same slow pace with more time and more misery. I could have kept running at that pace for several more miles, but I don't think I could have done it any faster. Those sprints and deadlifts really fuck with the muscles that you would use to go faster. \\n\\nPRT, as the Army currently conducts it, does not provide proper preparation for the ACFT, no matter how much those within the program stubbornly believe it does. It's straight denial and it is embarrassing, to be completely frank. \\n\\nSo... I have mixed feelings. It is being treated as set in stone, which is wrong, it needs a lot of work as any soldier with common sense who took the test can probably vouch for. Good idea fairies need to respond to critical feedback. \"}, {\"id\": \"2b71260a-4550-11ea-96be-60f6774aa532\", \"language\": \"en\", \"text\": \"A bit fucking late there bud\"}, {\"id\": \"2b71260c-4550-11ea-a8c0-60f6774aa532\", \"language\": \"en\", \"text\": \"I\\u2019m at Eustis and we are the test site, for one medical company we started at 545 and finished at 830 it sucked \"}, {\"id\": \"2b71260d-4550-11ea-b652-60f6774aa532\", \"language\": \"en\", \"text\": \"A fucken tad behind here pal \"}, {\"id\": \"2b71260f-4550-11ea-b81f-60f6774aa532\", \"language\": \"en\", \"text\": \"> My biggest concerns for the ACFT would be  \\n>  \\n>the  deadlift. Form is critical and half assed training could result in a  slew of injuries. Trap bar helps because it's more natural mechanically  but still easy for a joe to f\\\\* himself up.  \\n>  \\n>the  leg tuck. I dont feel it accurately represents a motion a soldier would  do. If anything it should be a full swing up to touch ankles over the  bar as if they were prepping to shimmy down a rope.  \\n>  \\n>the medicine ball throw is just plain silly.  \\n>  \\n>release  pushups. Not everyone will have this issue but i personally find it to  be an awkward ROM that puts more torque of my shoulders than normal PU's  \\n>  \\n>cost  of equipment and speed with the test can be administered. The quoted  times to complete the test for a full unit just dont seem realistic to  me unless you have a fuckton of equipment and graders and spend a bunch  of time setting up beforehand.\\n\\n&#x200B;\\n\\nI think you pretty well addressed everything that came to mind when I saw it.\\n\\nI could see the potential for sprains / injuries from the ball thing if people aren't training for that ROM.\\n\\nI'm wondering if each installation will eventually have a ACFT facility constructed to accommodate all of the equipment needs. It wouldn't be fair to dump this on the local gyms or for each individual unit to have their own equipment. I wonder who's getting rich off this.\\n\\nI'll be amazed if this makes it to full implementation in its current form and if it stands the test of time. \"}, {\"id\": \"2b712610-4550-11ea-9066-60f6774aa532\", \"language\": \"en\", \"text\": \"The deadlift is the best measure for a soldier\\u2019s overall strength \\n\\nThe leg tuck measures the same strength of the muscle group needed for getting oneself over a wall or fence\\n\\nThe medicine ball throw measures the strength of the muscle group needed for lifting heavy objects or helping another soldier climb something\\n\\nThe release pushups measure the muscle group needed for pushing someone or something away from yourself\\n\\nThe sprint/drag/carry simulates running to a wounded soldier, dragging them to cover, shooting while on the move, and carrying ammo cans\\n\\nThe two mile run is still there because some general insisted on it. Expect to add about two minutes to your run time.\\n\\nMy company was able to get through the test in about an hour and a half. During the ACFT course, it took the same amount of time for 100 people on 16 lanes. The Army is planning to stand up a whole fitness training branch in order to administer the test and help with physical training.\\n\\nI\\u2019ve fully bought into the test, it\\u2019s so much better than the APFT. Definitely a better measure of physical fitness than the APFT, and a regular workout regime in a gym would directly improve your results on the ACFT. It\\u2019s easy to pass, harder to do well. And it\\u2019s definitely exposing a lot of soldiers who have just been skating by with the minimum.\"}, {\"id\": \"2b712611-4550-11ea-8792-60f6774aa532\", \"language\": \"en\", \"text\": \"It's alright. I think a couple of the exercises are just more difficult than they are worth. By that I mean they are just awkward. Hand release push-ups and the leg tuck are awkward exercises that don't provide much for you. If I could make the test it would be deadlift, sprint, pull ups, 2 mile run.\"}, {\"id\": \"2bd6bf50-4550-11ea-92c2-60f6774aa532\", \"language\": \"en\", \"text\": \">As far as it being too expensive, people overinflate the costs of the equipment.\\n\\nYou're not paying attention.\\n\\nThe complaint about the equipment is **not** the cost, but simply the logistical coordination.\\n\\nSo...Each BN has a set?  Each Company?\\n\\nIt get stored in a MILVAN or CONNEX somewhere, and 'someone' will hold that key.\\n\\nAnd every time you want to run it, you are going to pull out, and transport, all that equipment, to the field site.\\n\\nThat set-up time should not be discounted.  You will essentially need to grab a detail.\\n\\nSo...what happens when we have like 3 or 4 people out of tolerance (maybe they were TDY, whatever), and we need to run an event?\\n\\nYou're gonna wind up grabbing all that gear.\\n\\nAnd don't forget; when we do a fuck-ton of people at once, it's got to all get completed within the time limit.  So...how many lanes are you running at once for each event?\\n\\nIf this is one set per BN, this now means the entire BN, every company, is going to need to deconflict with any PT needs.\\n\\nThis will lead to another thing the S3 is in charge of.  And probably someone in BN or S3 is the holder of the key for this magical connex.\\n\\nEveryone ask yourselves; How competent is your 3 shop?\\n\\nWhen we go to do a PT test and realize a couple of the medicine balls are torn/ripped, or the sled is fucked up, any of that; how's the scramble to unfuck that going to look like?  Call around to each BN, find the Key Guy for that unit, get to their milvan, sign it over, bring it to the field site.\\n\\nIt just seems like there are endless ways that adding in more equipment, that is **not** necessarily 'on hand', can go badly.  Your on-post gym have medicine balls?  You think the people running that are going to be like \\\"Yeah that's fine go grab all my medicine balls and take them outside into the field and just bring them back!\\\".  Everyone ask yourselves; How many kind, supportive, helpful gym civilians have you run in to?\\n\\nHonestly, **the previous APFT wasn't an excellent measure of fitness, and certainly not practical/'combat' fitness**.  But it was a 'good enough' metric that worked for a lot of people.  Body fat is the same way.\\n\\nThe biggest argument against doing a 'dunk tank' for BF was logistics.  Well, I'll be damned, certainly seems like we're ramping up our logistics requirements...So remind me again, why are we still tape testing?  I get it, there's a change in the works, it's being considered -- it should have come hand in hand with the new PT test.\\n\\nDoing something that's not really better, but is different, **is worse then doing something at all**.\\n\\nHow are we doing this while deployed, or in a more austere environment?  All deployed organizations lugging around a fucking milvan of shit?\\n\\n'Then come up with something better'.\\n\\nSure thing; it's called the PFT and the CFT, and the [fucking Marine Corps](https://www.fitness.marines.mil/PFT-CFT_Standards17/) already figured this out.  It utilizes less equipment, is more easily conducted in any number of environments, and provides (imo) a better holistic fitness look.\\n\\nWe managed to steal the Corps' idea and do it worse then people who **literally eat crayons**.\"}, {\"id\": \"2bd6bf56-4550-11ea-9d1b-60f6774aa532\", \"language\": \"en\", \"text\": \"I highly doubt this test will weed out ANY 120 lb cross country runner.\"}, {\"id\": \"2bd6bf57-4550-11ea-997d-60f6774aa532\", \"language\": \"en\", \"text\": \"What makes you think this is an unpopular opinion? This is shared by almost every Soldier I know, and has been expressed here just about every time it's brought up.\\n\\nThe only real problem is that it has no alternate events, which is fucking finally being addressed by the retards in charge of that.\"}, {\"id\": \"2bd6bf5b-4550-11ea-9f50-60f6774aa532\", \"language\": \"en\", \"text\": \"I like the new test, however, I feel that females will get the short end of the stick with the deadlift event solely being numbers based. I have a 90pound female in my unit. No amount of training is gonna enable her to deadlift 4 times her body weight if she wants to max and even if she could she's gonna have to work way harder than her male/bigger counterparts purely because genetics weren't in her favor. Add on to the fact PT scores factor in largely for E5/E6 promotions and you have the potential for mass complaints. However, that's always going to be an issue with a gender neutral fitness test and there's no real way to avoid it\"}, {\"id\": \"2bd6bf5e-4550-11ea-b55e-60f6774aa532\", \"language\": \"en\", \"text\": \"Actually I thought the biggest compliant was that testing will take a lot longer.\"}, {\"id\": \"2bd6bf61-4550-11ea-885b-60f6774aa532\", \"language\": \"en\", \"text\": \"I didn't workout/ run for almost four months prior to my diagnostic ACFT earlier this month. I also had a four mile ruck march the day before where I ran the last two miles.  I made 70 or over on each event. Medicine ball throw was the only one I had an issue with, because it takes practice to get the form right. But then again, my genetics are pretty decent so that helps. I also liked the test, it actually felt like a test.\\n\\nSled drag carry is the most rigorous imo.\"}, {\"id\": \"2bd6bf62-4550-11ea-a4c1-60f6774aa532\", \"language\": \"en\", \"text\": \"It should be fine if not done too often. I enjoyed the test and thought it was much more telling. I didn't do well on it but I at least met or exceeded the standards for my div as an 11b on most events.\\nHonestly equipment shouldn't be the problem if it's handled intelligently. This is the Army though...\\nOnly issue was time for me. It took us I believe over 2 hours to go through the new test. That's a lot of time for how much you actually do. That should go down with time but I'm curious by how much.\"}, {\"id\": \"2bd6bf63-4550-11ea-a9f7-60f6774aa532\", \"language\": \"en\", \"text\": \"This isn't an unpopular opinion at all. It surely isn't perfect, but I think it is a big improvement on the current APFT.\"}, {\"id\": \"2bd6bf64-4550-11ea-aad5-60f6774aa532\", \"language\": \"en\", \"text\": \"As a Guard bum, I have a huuuuuge issue with the logistics of implementing this test. First, let's make the laughable assumption that we *actually* get the equipment in time and *actually* have enough for an entire battalion. \\n\\n&#x200B;\\n\\nCurrently, I legally have 39 days a year to half-way sufficiently train my guys not to fly our shit into the ground and do all this other administrative BS that some active duty moron at big-Army (with 365 days a year to wreck his soldiers' lives with pointless shit)  tells us we have to do so we can put it in a BS documents to show to some ARMS dude once every few years. Sorry, getting side tracked here. \\n\\n&#x200B;\\n\\nNow, I'm hearing that in order for the test to be completed in the allotted 70 mins (or whatever it is), it either has to be administered in small groups with a handful of graders or you're going to need a ton of graders to administer it within the allotted time to a larger group, all because someone thought it'd be a solid idea to create a test -- which incase anyone forgot, has to be administered to every soldier in the Army -- with 5 events per soldier in a 70 minute window.\\n\\n&#x200B;\\n\\nGiven the latter two facts, I'm now going to have to shave off at substantial part of that very precious and limited time to administer a test that, for all intents and purposes, is simply design to tell me that my aviators can deploy. From an administrative perspective, it does the same thing as the APFT: \\\"Can I deploy this soldier?\\\"\\n\\n&#x200B;\\n\\n If I'm dismissive, it's because even if my guys fail, we're in such a pilot shortage that we're not going to chapter out a competent pilot who's meeting his minimums and isn't a total fat-body. So essentially I'm spending potentially  two training days (if not more) to administer a test with the same administrative result as the previous test that I could administer in 2 hours on any given drill day. Granted the APFT is a garbage measure of overall physical fitness and combat readiness and, personally, I perform well on both, so it's here-nor-there on that, but as a NG-let, there simply isn't a strong enough Return On Investment for me to endorse this test.\"}, {\"id\": \"2bd6bf65-4550-11ea-b398-60f6774aa532\", \"language\": \"en\", \"text\": \"Yea I don't think that's an unpopular opinion. I think the only people worried about the new ACFT are those who have not an ounce of true strength or endurance but for some reason have managed to score well enough on the APFT for years. BLUF, the ACFT will test your strength, endurance, speed, and agility. APFT tested how well you could get through two minutes of pushups, situps, and a two mile run.\"}, {\"id\": \"2ca76169-4550-11ea-a8ea-60f6774aa532\", \"language\": \"en\", \"text\": \"It would be done through JKO\"}, {\"id\": \"2ca7616b-4550-11ea-8985-60f6774aa532\", \"language\": \"en\", \"text\": \"6 ounce curls\\n\\n10 minute smoking by an NCO\\n\\nDrunk obstacle course\\n\\nOnly these three events can adequately ensure a soldier is ready for peacetime garrison/non combat arms line unit army.\"}, {\"id\": \"2ca7616e-4550-11ea-8532-60f6774aa532\", \"language\": \"en\", \"text\": \"I don't know what it would look like (I actually kinda like the Marine CFT) but I would immediately get rid of sit ups.\\n\\nSit ups do nothing but test how good you are at sit ups, with very little cross over into \\\"functional\\\" testing. Not to mention are the actual #1 cause of injury due to PT tests (56% of injuries).\\n\\nThe risk of sit-ups vastly outweighs the reward and practical application worthy of testing imo.\"}, {\"id\": \"2ca76171-4550-11ea-976a-60f6774aa532\", \"language\": \"en\", \"text\": \"I'd eliminate the 2 mile for some kinda 1 mile sprint. If you ever need to run 2 miles in modern warfare odds are you're a dead man no matter how fast you are.\"}, {\"id\": \"2ca76176-4550-11ea-8990-60f6774aa532\", \"language\": \"en\", \"text\": \"Beer mile and cock pushups\"}, {\"id\": \"2ca76177-4550-11ea-9f7b-60f6774aa532\", \"language\": \"en\", \"text\": \"Fucking get rid of doing that shit in formation and have a ban on any group larger than a platoon doing PT together except the occasional company run.  Absolutely no unit larger than a company running if subordinate units area expected to remain together.\"}, {\"id\": \"2ca76179-4550-11ea-a682-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"2ca7617b-4550-11ea-9750-60f6774aa532\", \"language\": \"en\", \"text\": \"Over 36 are exempt. \"}, {\"id\": \"2ca7617e-4550-11ea-a43a-60f6774aa532\", \"language\": \"en\", \"text\": \"Deadlift\\n\\nDeadlift\\n\\nBench\\n\\nDeadlift\"}, {\"id\": \"2ca76180-4550-11ea-8ffc-60f6774aa532\", \"language\": \"en\", \"text\": \"1 rep max bench press. 135 is 60 points, 300 is 100 points. That is all, no other events. CHEST DAY EVERY DAY DONT BE A PUSSY!\"}, {\"id\": \"2ca76182-4550-11ea-980a-60f6774aa532\", \"language\": \"en\", \"text\": \"1. Design an obstacle course. Course should have sprinting/rapid change of direction, crawling, climbing, and possibly carrying something.\\n\\n2. Build one on every Army post.\\n\\n3. The PT test is how fast you can get through the course. Pick a maximum and a minimum for each age group.\\n\\nCould easily be gender neutral, tests full-body fitness and proficiency in movement similar to what is needed in combat*. Done.\\n\\n^^*disclaimer: ^^I ^^have ^^never ^^been ^^in ^^combat.\"}, {\"id\": \"2ca7886e-4550-11ea-93fd-60f6774aa532\", \"language\": \"en\", \"text\": \"Swap out situps for the rower.\"}, {\"id\": \"2ca78870-4550-11ea-8912-60f6774aa532\", \"language\": \"en\", \"text\": \"pushups \\n\\npullups\\n\\nbodyweight squats\\n\\n10 km ruck with 20 kg pack, (6 miles/44 lbs) maybe as a separate event \"}, {\"id\": \"2ca78872-4550-11ea-b144-60f6774aa532\", \"language\": \"en\", \"text\": \"Make holding feet a 4th event.\"}, {\"id\": \"2ca78873-4550-11ea-8f5f-60f6774aa532\", \"language\": \"en\", \"text\": \"Nice try, Army Times.\"}, {\"id\": \"2ca78874-4550-11ea-b40e-60f6774aa532\", \"language\": \"en\", \"text\": \"I've thought about this a bit, and here are some of the limitations:\\n\\n- has to be pretty minimal equipment, both for time and fairness considerations.\\n- events must be easy to judge, with minimal ambiguity about what is correct and what is not.\\n- events must require minimal skill (olympic lifts are probably not good here, nor is anything above gymnastic rings).\\n- events and the test need to be completed in a timely fashion\\n- you need to be able to test a whole company (or more, potentially) in a timely fashion\\n- ideally, you want to be able to do this wherever you are.\\n- it has to measure fitness in a significantly better way than the current APFT does\\n\\nFor weights, any time you start saying x% of bodyweight, you have to organize everyone by weight, have a lot of weights available and ready, or swap them out and hope privates can do plate math at 0400.\\n\\nA 4-6 mile ruck march will take 60-90 minutes, if everyone passes.  You also need everyone to have a rucksack with all the appropriate gear/weight in it.  Do you flag a guy because he forgot an item that would have put his rucksack into the correct weight?  I love rucking and think it should be done more, but I don't think it would be an effective part of the standard APFT.\\n\\nRope climbs would be great, but then you need a rope to climb.  I was in the Army for years before I was ever asked to do a pullup for the Army.  Getting all those pullup bars installed on every installation was a big deal, and there are often not enough of them on some installations or at some PT fields.\\n\\nI've heard a suggestion for a 10-minute kettlebell swing challenges as a potential test, as it hits upper body, lower body, core and cardio all in one, but I'm not sure I'm convinced.\\n\\nAny kind of obstacle course is likely not going to be the same from post to post, and can't be done at all if you are assigned to a non-Army installation.\\n\\nI can shoot down ideas all day, but here are my actual suggestions:\\n\\n- add a pulling motion.  Pullups are the obvious choice, but other rows might be acceptable.\\n\\n- change the situp event.  Easiest change would be toes to bar or knees to elbows leg lifts.\\n\\n- add a sprint, probably 300-400m.  Short enough that you can sprint, long enough to see a clear difference in times between people. \\n\\nI would like to see a way to move on from the events as well.  If you can max your pushups, the Army should start testing you on 1-arm pushups, or dips.  If you can max your toes-to-bar, start testing ab wheel rollouts.  This makes the test far more complicated to administer, but a graduated ability scale would help people understand that there is more to fitness than simply passing/maxing the APFT.  \\\"Do more X\\\" is not always the way to get more fit, especially when there are only three possibilities for X that completely ignore the posterior chain.\"}, {\"id\": \"2ca78877-4550-11ea-bcbe-60f6774aa532\", \"language\": \"en\", \"text\": \"Cyber guy here. Instead of log pt, we should do Cisco switch pt\"}, {\"id\": \"2ca78878-4550-11ea-a105-60f6774aa532\", \"language\": \"en\", \"text\": \"Overhead press is a better indicator of strength than the bench. \"}, {\"id\": \"2ca78879-4550-11ea-8c84-60f6774aa532\", \"language\": \"en\", \"text\": \"12 mile road march with full combat load (actual full mags)\\nQualify with weapon at the end (using ammo you carried)\\nLift 5 full ammo cans over your head into the back of of a truck.\\nFireman carry your battle buddy to a bar.\"}, {\"id\": \"2ca7887c-4550-11ea-9beb-60f6774aa532\", \"language\": \"en\", \"text\": \"Something ambiguous, confusing, and kept tightly under wraps for a long while so the Army Times still has something to write about.\"}, {\"id\": \"2ca7887d-4550-11ea-b971-60f6774aa532\", \"language\": \"en\", \"text\": \"UFC cage match, winners pass, losers fail. \"}, {\"id\": \"2ca7887f-4550-11ea-8f41-60f6774aa532\", \"language\": \"en\", \"text\": \"Push ups\\nPull ups\\nBody weight squat\\n250yd sprint\\n300yd shuttle sprint\\n\\n\\n\\n\\nDisclaimer: the PT test is just measure your physical health, it's not a combat test and was never intended to be. Units are supposed to ensure Soldiers are capable in combat.\\n\"}, {\"id\": \"2ca78880-4550-11ea-8a8e-60f6774aa532\", \"language\": \"en\", \"text\": \"Typing test.  Graded on WPS. \"}, {\"id\": \"2ca78881-4550-11ea-9c90-60f6774aa532\", \"language\": \"en\", \"text\": \"I'd be happy if Push Ups got replaced with a flexed arm hang. No Push Up grader grades equally and it pisses me off to no end when I can take a PT test for five days straight and while averaging the same for Sit Ups and the run, my Push Ups could be Plus/Minus 15-30 range because each grader has their own measure of what a correct push up is.\"}, {\"id\": \"2ca78882-4550-11ea-acf9-60f6774aa532\", \"language\": \"en\", \"text\": \"The UK Army has 2 tests. They have one for general fitness (basically the AF pt  test, 1.5mi run, 60 sec push ups, 60 sec sit ups), that they are called upon at any time and expected to be able to do. This is just to ensure that soldiers are staying in shape. \\n\\n\\nThey have another test that they train for, which is more combat related with a ruck and some other things. \\n\\n\\nThis is what I think we should do, one test for fitness which would be to keep our PT test the same except add pull ups and exchange sit ups for rower or some other core thing. Anyone can be called up to do the pt test at any time. We should be staying in shape all year long for general fitness, not just training 1mo in advance. \\n\\n\\nAnother test for combat, this can be Unit or MOS specific but should have some of the following:\\n\\n6mi ruck at 17-18 min pace with 30lbs\\n\\nfarmers carry\\n\\nlitter carry (medical)\\n\\nBuddy carry\\n\\nRun with weapon and in ACU's\\n\\n\\n\\n\"}, {\"id\": \"2ca78883-4550-11ea-9708-60f6774aa532\", \"language\": \"en\", \"text\": \"Me?\\n\\nInstead of offering my professional-but-non-expert-in-the-correct-field opinion and then forcing it down everyone's throat because THAT'S THE WAY WE DO IT HERE, I'd hire a team of credentialed expert civilians who would actually come up with something of benefit to the Army.\\n\\nSpecifically, MPRI so I could get in line for a sweet follow-on career with them I earned by handing them a contract while I was still in.\"}, {\"id\": \"2ca78885-4550-11ea-9471-60f6774aa532\", \"language\": \"en\", \"text\": \"The standards would be the same for males and females.\"}, {\"id\": \"2ca78888-4550-11ea-a2d0-60f6774aa532\", \"language\": \"en\", \"text\": \"Situps burn in hell, pushups getreplaced with dips, 2 mile gets replaced with sprints as you described, and something with an obstacle course. And litter carries.\"}, {\"id\": \"2ca78889-4550-11ea-808f-60f6774aa532\", \"language\": \"en\", \"text\": \"Change it to the Air Force's PT test\"}, {\"id\": \"2ca7888b-4550-11ea-ac5f-60f6774aa532\", \"language\": \"en\", \"text\": \"Paused dips, with a one second count at the bottom of the rep.\\n\\nPullups/chinups (individual choice), must lock out elbows at bottom, chin must be over bar at the top, legs cannot be lifted past hip level during the repetition, and no kipping.\\n\\nDeadlift 1.5x bodyweight for 3+ reps.\\n\\nTimed 100, 400, 800meter sprints.\\nSled pull with 1.5x bodyweight on sled.\\n\\nEnd with planks for time, minimum one minute, arms extended (starting pushup position).\"}, {\"id\": \"2ca7888d-4550-11ea-946d-60f6774aa532\", \"language\": \"en\", \"text\": \"1. Deadlift X percentage of body weight for a X amount of reps (pass/fail)\\n2. 1 mile jog\\n3. 1 minute for X amount of pushups\\n4. 1 minute for X amount of pullups \\n5. 1 minute for X amount of situps\\n6. 100M sprint (pass/fail)\\n\\nNo gender difference in standards for combat arms, but for everyone else, it's not that important.\\n\\nEach event is worth 50 points. 35 points is required for a Go. The standard is to get at least a 35 or a Go in 5/6 events and how about the same minimum of 180 points (or 60% overall). That way, if you suck at something in particular or fuck something up, it's not your career, you can make it up in other events, but it tests a wider variety of things in a bit less time overall with a bit more applicability to soldier requirements. You can score bonus points in the pushups, situps, and pullups per repetition, and maybe something mathematical with the deadlift. \\n\\nAlso I want to throw in the option to swap any event with a ruck the following morning or just for bonus points, because rucking is fucking. \"}, {\"id\": \"2ca7888e-4550-11ea-baf1-60f6774aa532\", \"language\": \"en\", \"text\": \"Do you look in shape? Then you passed. Does your gut hang over your pants? You failed \"}, {\"id\": \"2ca78891-4550-11ea-9ffa-60f6774aa532\", \"language\": \"en\", \"text\": \"400m sprint instead of the 2 mile run. 800m would also be okay.\\n\\nPull ups.\\n\\nPush ups.\\n\\nI would also support something like a weighted sled drag on a pass/fail basis. Even if you can't actually fight, I want to know you could drag somebody's ass a short distance to safety if needed. I don't see this being implemented because of the need for equipment, which would slow down test implementation.\\n\\nI also think a rowing event should be an alternative cardio event.\"}, {\"id\": \"2ca7af67-4550-11ea-9712-60f6774aa532\", \"language\": \"en\", \"text\": \"I'd leave it exactly the same, except, I'd reverse the order.\\n\\nBecause fuck you, that's why. :D\"}, {\"id\": \"2ca7af69-4550-11ea-a358-60f6774aa532\", \"language\": \"en\", \"text\": \"Just change the run to 1.5 miles (follow Air force standards) and add pullups (follow Marine Corps standards).\\n\\nFat people can cheat height/weight with fat necks. But fat people can't do pullups.\"}, {\"id\": \"2ca7af6b-4550-11ea-bd64-60f6774aa532\", \"language\": \"en\", \"text\": \"Timed standardized confidence course. The end.\"}, {\"id\": \"2ca7af6c-4550-11ea-87d1-60f6774aa532\", \"language\": \"en\", \"text\": \"The issues I have with your apft is the equipment used and the injuries. Keep in mind that 30-40% of the Army has never touched a barbell or done any serious weight training before osut. So a squat or farmer's walk will be out of the question. I like the idea of testing sprints but it would be difficult to implement. Anything in the Army HAS to be idiot-proof. 800m-3300m runs work well because runners get spaced out and a few seconds deviation won't matter much. \\n\\nI would keep it short and simple. Max pull ups, Max dips, 1.5-2 mile run for everyone followed by an 8-12 mile ruck for CA. \\n\\nEdit: I also dislike the Marine CFT. It doesn't really test combat readiness. IMHO the 12 mile ruck is a much better Combat Fitness Test\"}, {\"id\": \"2ca7af6d-4550-11ea-95ec-60f6774aa532\", \"language\": \"en\", \"text\": \"10 PU, 10 SU, 1 mile run. \"}, {\"id\": \"2ca7af6e-4550-11ea-89d3-60f6774aa532\", \"language\": \"en\", \"text\": \"Replace the two mile run with a 500m sprint + 6 mile run. The two mile is in an awkward not really distance and not really sprint place. \\n\\n\\n\\nReplace situps with plank (your choice if on your elbows or in the front leaning rest). \\n\\n\\n\\nRaise female passing PU score to 30. \\n\\n\\n\\nIf you must keep the 2 mile run than lower passing female score to (at most) 16mins. \\n\\n\\nMandatory swim event. \"}, {\"id\": \"2ca7af6f-4550-11ea-b5fb-60f6774aa532\", \"language\": \"en\", \"text\": \"I feel like I'll get a lot of shit for this but, I'd like to see the whole age bracket go away or at least changed. I'm only 23 so maybe that's why I have this opinion. Gets me pretty salty when all my 38 year old PSG has to do is show up and score a 270. \"}, {\"id\": \"2ca7af70-4550-11ea-8575-60f6774aa532\", \"language\": \"en\", \"text\": \"Just do the Combat Readiness Assessment minus the Dummy carry. It's a really easy test anyway. \\n\\nRescue Randy is fucking retarded when the dummies don't have functional knees\"}, {\"id\": \"2ca7af71-4550-11ea-835c-60f6774aa532\", \"language\": \"en\", \"text\": \"Considering I have built a web application that will score your performance against the Army, Air Force, Marine, and Navy Fitness test I've thought about this question quite a bit and designed our own form of an ideal fitness test.  It includes a 2 minute event for push-ups, a 2 minute of Burpees, and a 1.5 mile run.  \\n\\nThis will test your core without putting the stress on your lower back caused by Sit-ups\\nIf you're interested in testing yourself against it, or the other tests, go to www.bodyval.com\"}, {\"id\": \"2ca7af72-4550-11ea-b934-60f6774aa532\", \"language\": \"en\", \"text\": \"2 mile run, 5 mile run,12 mile ruck at 35 lbs dry w/ assigned weapon, push ups, pull ups, standing shoulder press, CWST, rope climb.\\ndone twice a year but its done over a whole week \"}, {\"id\": \"2ca7af75-4550-11ea-934c-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"2d83f567-4550-11ea-ad6a-60f6774aa532\", \"language\": \"en\", \"text\": \"Hello, one ranger school please\"}, {\"id\": \"2d83f56b-4550-11ea-a29a-60f6774aa532\", \"language\": \"en\", \"text\": \"I\\u2019m not gay, but let\\u2019s bang OP. \\n\\nTYFYS. \"}, {\"id\": \"2d83f56f-4550-11ea-9537-60f6774aa532\", \"language\": \"en\", \"text\": \"I think the Ranger school bit makes sense, actually, in the POG world because it does set you apart.\\n\\nThat said, I'm not going to go because that looks hard and I really just don't want to go.\"}, {\"id\": \"2d83f573-4550-11ea-bcf3-60f6774aa532\", \"language\": \"en\", \"text\": \"ONCE AGAIN.\\n\\n**SIR THIS IS A ZAXBYS** \"}, {\"id\": \"2d83f576-4550-11ea-bc0a-60f6774aa532\", \"language\": \"en\", \"text\": \"I honestly didn't read all this - just skimmed, but holy shit did you write it? I hope people that need to read this, do - and learn. Thank you.\"}, {\"id\": \"2d83f578-4550-11ea-81e0-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"2d83f57b-4550-11ea-8c6a-60f6774aa532\", \"language\": \"en\", \"text\": \"BUT I NEEDED A 6 INCH LIFT ON MY TRUCK TO ASSERT MY DOMINANCE.\"}, {\"id\": \"2d83f57d-4550-11ea-9a6e-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"2d83f580-4550-11ea-968e-60f6774aa532\", \"language\": \"en\", \"text\": \"As an 18yo straight out of Highschool, Going to BCT in a few days. Saving this post for future reference. \"}, {\"id\": \"2d83f583-4550-11ea-9f4a-60f6774aa532\", \"language\": \"en\", \"text\": \"Airsofter forgot a mag? 99% of my tactical training in the Army did not involve a magazine.\"}, {\"id\": \"2d83f584-4550-11ea-bc1c-60f6774aa532\", \"language\": \"en\", \"text\": \"I love you. \"}, {\"id\": \"2d83f585-4550-11ea-9817-60f6774aa532\", \"language\": \"en\", \"text\": \"Goddamn 11-Bullshitter... I wish I had an NCO or 3 like you.\\n\\nLots of good, direct, fluffless, informative info\\n\\n\\u2022 Will Upvote Ahead Of Peers\\n\\n\\u2022 Has Leadership Potential in r/army\"}, {\"id\": \"2d83f586-4550-11ea-bedb-60f6774aa532\", \"language\": \"en\", \"text\": \"Perty gud\\n\\nTyfys\\n\\n^saved\"}, {\"id\": \"2d83f587-4550-11ea-aea3-60f6774aa532\", \"language\": \"en\", \"text\": \"I would also add, read some regulation. The Army has already answered all your questions and wrote them down. You will be amazed on how much knowledge exists with leaders not knowing.\\n\\nhttps://armypubs.army.mil \"}, {\"id\": \"2d83f588-4550-11ea-b244-60f6774aa532\", \"language\": \"en\", \"text\": \"> A popular analogy is that water will start to boil at 212*F. Adding more heat will not make the water boil faster.\\n\\neither you fucked it up, or that's one of the shittiest \\\"popular\\\" analogies I've ever read.\"}, {\"id\": \"2d83f589-4550-11ea-be04-60f6774aa532\", \"language\": \"en\", \"text\": \"Wow this is great! This is amazingly useful information that I wish I had ten years ago but still can apply much of it now. Thank you and keep it up! \"}, {\"id\": \"2d83f58a-4550-11ea-bc6c-60f6774aa532\", \"language\": \"en\", \"text\": \"Good lord, thank you! All great points, but the finance-related stuff is something so many people, not just SMs, are just never taught. The people responsible for for teaching new SMs these things blow it off and it infuriated me because then they wonder why young SMs can\\u2019t manage money properly. \"}, {\"id\": \"2d83f58b-4550-11ea-93ea-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"2d83f58f-4550-11ea-9824-60f6774aa532\", \"language\": \"en\", \"text\": \"Legitimate question - as a future (hopeful) 17C, is there any *real* chance of me getting sent to Ranger School, even if I ask for it and my PT score is 300?\"}, {\"id\": \"2d83f592-4550-11ea-b5cb-60f6774aa532\", \"language\": \"en\", \"text\": \"Fuck me, i got declined for the Credit Card. Is there another way i could build credit? Im in AIT right now and could totally use a credit card for little purchases like protein and my personal hygiene stuff that i have to buy monthly. \"}, {\"id\": \"2d83f595-4550-11ea-b5d2-60f6774aa532\", \"language\": \"en\", \"text\": \"I agree with everything except the aversion to carb heavy foods. Carbohydrates are one of the building blocks of life. Obviously there is a difference between good and bad carbs (french fries vs brown rice), but avoiding carbs all together is definitely detrimental to making physical strength/endurance gains. \"}, {\"id\": \"2d83f597-4550-11ea-a78a-60f6774aa532\", \"language\": \"en\", \"text\": \"Thank you so much for taking the time to write this and providing the links for more detailed resources.  I will be sharing the fuck out of this. \"}, {\"id\": \"2d83f598-4550-11ea-8ec7-60f6774aa532\", \"language\": \"en\", \"text\": \"when ur mos can\\u2019t go to ranger school :/\"}, {\"id\": \"2d83f599-4550-11ea-b9ea-60f6774aa532\", \"language\": \"en\", \"text\": \"This is amazing and 100% accurate on all of the points. You did a good thing. Thank you.\"}, {\"id\": \"2d83f59a-4550-11ea-b727-60f6774aa532\", \"language\": \"en\", \"text\": \"Is there a TL;DR for this :)\\n\\nTo piggy back\\n1) for finances \\\"the index card\\\" by Helaine Olen is a worthwhile read\\n2) for athleticism: \\\"Becoming a Supplement Leopard\\\" by Dr. Kelly Startlet will help you lift properly, prevent injury, and recover from injury...all from Ft. Couch\"}, {\"id\": \"2d83f59c-4550-11ea-b747-60f6774aa532\", \"language\": \"en\", \"text\": \"Haha this dumbass thinks i'm gonna read that\"}, {\"id\": \"2d83f59e-4550-11ea-a803-60f6774aa532\", \"language\": \"en\", \"text\": \"Look guy, most of this advice is great, but you need to stop pretending to know about exercise physiology and nutrition.  Dairy isn't bad.  Keto is bullshit.  Pose running is a method for reducing shear forces and oscillations in athletes with poor proprioception and connective tissue strength, not for performing at a high level.  Aerobic training your third aspect of fitness and fundamental for training the other two to any meaningful extent.  The only aspect of nutrition that might be responsible for a plateau is caloric/specific micronutrient deficit.  Eating fried chicken won't magically make you weaker or slower.\\n\\nI see people pushing bullshit like this all the time because there are very few entry barriers in the fitness industry.  The only time I can be bothered to call it out is when you're potentially putting it out in my formation.\"}, {\"id\": \"2d83f5a0-4550-11ea-94a3-60f6774aa532\", \"language\": \"en\", \"text\": \"Here to add another recommendation for The 4 Hour Body. If you\\u2019re a fat little fatty and want to do something about it, Tim\\u2019s Cyclic Ketogenic Diet is wonderful. I recommend the book to all my Soldiers who are on ABCP, and those who read it have all come off.\\n\\nHands down the most important advice in here is to start investing early. Max your Roth IRA contributions at $5,500 a year (most will spend more on dip and strippers) and just watch it grow.\"}, {\"id\": \"2d83f5a2-4550-11ea-96d1-60f6774aa532\", \"language\": \"en\", \"text\": \"What's better for building credit. \\n\\nUSAA or American Express card? \"}, {\"id\": \"2d83f5a5-4550-11ea-b0eb-60f6774aa532\", \"language\": \"en\", \"text\": \"Saving for later when I'm not enjoying a Friday Bloody Mary and my doggos. \"}, {\"id\": \"2d83f5a6-4550-11ea-871d-60f6774aa532\", \"language\": \"en\", \"text\": \"Thank you OP. This is great advice\"}, {\"id\": \"2d83f5a7-4550-11ea-bae5-60f6774aa532\", \"language\": \"en\", \"text\": \"best post so far, upvote.\"}, {\"id\": \"2d83f5a8-4550-11ea-9283-60f6774aa532\", \"language\": \"en\", \"text\": \"Awesome\"}, {\"id\": \"2d83f5a9-4550-11ea-940b-60f6774aa532\", \"language\": \"en\", \"text\": \"A lot of this is good advice for dudes not in the service as well. I'm glad this was the first thing I read this morning. \"}, {\"id\": \"2d83f5aa-4550-11ea-ad34-60f6774aa532\", \"language\": \"en\", \"text\": \"I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\\n\\n- [/r/navyseals] [Pretty Solid Advice from a Former Infantry Dude](https://www.reddit.com/r/navyseals/comments/8kla84/pretty_solid_advice_from_a_former_infantry_dude/)\\n\\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*\"}, {\"id\": \"2d83f5ab-4550-11ea-bcd9-60f6774aa532\", \"language\": \"en\", \"text\": \"> The Army LOVES to teach you all kinds of lame things like SHARP\\n\\nI\\u2019m not shocked by my experience in the army, looking back. Ouch.\"}, {\"id\": \"2d83f5ac-4550-11ea-9129-60f6774aa532\", \"language\": \"en\", \"text\": \"Hey man, \\n\\nThanks for that write up. I am actually going to do that running \\\"experiment\\\" with my soldiers on Monday at PT. A bunch of them (and many people in general) run on their heels and I don't think they see that they can probably run so much faster and easier if they run on their toes and midfoot more. \\n\\nI was a gymnast for a long damn time and we had to run or walk anywhere we went \\\"toe-heel\\\" so I actually think that helps me a lot. I also take it for granted that most of society didn't walk around like crazy people (walking toe heel.... it looks weird lol). \\n\\nAnyway. Thanks for the write up! Love it. \"}, {\"id\": \"2d83f5ae-4550-11ea-9c4a-60f6774aa532\", \"language\": \"en\", \"text\": \"So I'm probably going to be told to shut my phone off before takeoff soon, so deal with it if I missed where it's been said. Yes, I see it at the top of the thread, but no one addressed it seriously.\\n\\nMy biggest regret from my military service is not having at least attempted SFAS. Don't do what I did and think you weren't \\\"ready\\\" for SFAS and then ETS not even having attempted. Knowing what I know now about myself, post 11B/vol FF/EMT/Peshmerga volunteer combat medic, there's no reason I shouldn't have at least gone to SFAS and potentially could have even been an 18 day non-select. I'd be ok with that. \\n\\nBuddy of mine, whom I inspired to join the Army. He wanted to be a 68W, but apparently at the time they were full.  This would be 09 time frame, if you're wondering. So this guy still wants to be a medic, so he signs up for 18X ,goes through Infantry OSUT, Airborne, SOPC (Special Operations Preparation Course), Selection, 18D course, doesn't pass NREMTP, so they send him to 18E, he passed, and now he's just a few years off E-7.  He's 31, used to be completely financially irresponsible, huge alcoholic, starting to delve into hard drugs, waited tables from age 17 until 22, and was at best going to end up lower middle management of a Best Buy or something had he not enlisted.\\n\\nMoral of the story, don't wait.  I kick myself every time I hear about Special Operations anything. \"}, {\"id\": \"2d83f5af-4550-11ea-9979-60f6774aa532\", \"language\": \"en\", \"text\": \"Jokes on you. I sucked a dick for 2 years, then continued sucking dick in the shittiest places on earth *just* for the OPSCORE.\"}, {\"id\": \"2d83f5b0-4550-11ea-93b8-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"2d83f5b4-4550-11ea-9719-60f6774aa532\", \"language\": \"en\", \"text\": \"Fuck Dave Ramsey. Debt is not evil. There is no need to mix religion and financial advice.\\n\\n\"}, {\"id\": \"2d83f5b5-4550-11ea-a469-60f6774aa532\", \"language\": \"en\", \"text\": \"Is TSP even worth it as a reservist?\\n\\nTrying to save the little money I have after AIT to go to college possibly graduate school. \"}, {\"id\": \"2d83f5b8-4550-11ea-ad5a-60f6774aa532\", \"language\": \"en\", \"text\": \">Don\\u2019t eat fried meat, carb heavy food (bread, spuds, rice, pasta, etc.), or refined sugar. Don\\u2019t drink dairy, gatorade, or alcohol\\n\\nYou're killing me smalls :(\\nthat said, i'm still in my mid 20's so I can probably still eat whatever I want for another year or three\"}, {\"id\": \"2d83f5ba-4550-11ea-b426-60f6774aa532\", \"language\": \"en\", \"text\": \"ELI5?\"}, {\"id\": \"2e244222-4550-11ea-8f82-60f6774aa532\", \"language\": \"en\", \"text\": \"Sir, I am a Warrant Officer. PT doesn't exist\"}, {\"id\": \"2e244224-4550-11ea-9de1-60f6774aa532\", \"language\": \"en\", \"text\": \"I ain't reading all that. Do pushups, you. \"}, {\"id\": \"2e246901-4550-11ea-b777-60f6774aa532\", \"language\": \"en\", \"text\": \"So you're saying I should run more at a jog pace?  While singing?  Check Roger hooah\"}, {\"id\": \"2e246903-4550-11ea-9ac6-60f6774aa532\", \"language\": \"en\", \"text\": \"I'm more interested in being AMRY STRONG, do a write up on that\"}, {\"id\": \"2e246906-4550-11ea-a606-60f6774aa532\", \"language\": \"en\", \"text\": \"Can't, got an appointment at dental. And then one at physical therapy for my shin splints.\"}, {\"id\": \"2e246908-4550-11ea-a5af-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"2e24690b-4550-11ea-b825-60f6774aa532\", \"language\": \"en\", \"text\": \">But what if I\\u2019m not infantry \\n\\nI\\u2019m a 19D so yeah, I\\u2019m basically infantry\"}, {\"id\": \"2e24690e-4550-11ea-9451-60f6774aa532\", \"language\": \"en\", \"text\": \"We all know that this is correct, because it's backed by nearly every exercise science professional, trainer, rehab-er...damn near everyone.\\n\\nBut for some reason, the Army prefers to put some 21 year old dumbass in charge, or lets Officers just run every day until a certain percentage of the formation falls out.\\n\\nGet out of here with your intelligent, cited, knowledgeable information. It has no place in the Army.\\n\\n\"}, {\"id\": \"2e246910-4550-11ea-a405-60f6774aa532\", \"language\": \"en\", \"text\": \"TYFYS. \"}, {\"id\": \"2e246911-4550-11ea-8077-60f6774aa532\", \"language\": \"en\", \"text\": \"Sir this the Charlie's at the Px, I just need to know how much bacon, ranch, and nacho cheese you want on your fries.\"}, {\"id\": \"2e246912-4550-11ea-aa70-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"2e246915-4550-11ea-9b54-60f6774aa532\", \"language\": \"en\", \"text\": \"https://i.imgur.com/oAc9DCK.gifv\"}, {\"id\": \"2e246916-4550-11ea-967d-60f6774aa532\", \"language\": \"en\", \"text\": \"You must be swift as a coursing river with all the force of the great typhoon, with all the strength of a raging fire and mysterious as the dark side of the moon. \"}, {\"id\": \"2e246917-4550-11ea-b243-60f6774aa532\", \"language\": \"en\", \"text\": \"If you\\u2019re advocating for the ACRT, I\\u2019m going to have to downvote. \"}, {\"id\": \"2e246919-4550-11ea-9da4-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"2e24691b-4550-11ea-a9a8-60f6774aa532\", \"language\": \"en\", \"text\": \"The cancer of the Army has all gathered to this post, specifically to trash it without reading a single paragraph. \\ud83d\\ude10\"}, {\"id\": \"2e24691c-4550-11ea-a412-60f6774aa532\", \"language\": \"en\", \"text\": \"A couple of SR20 motors will pull a premium right before Race Wars\"}, {\"id\": \"2e24691f-4550-11ea-b4f1-60f6774aa532\", \"language\": \"en\", \"text\": \"This is /u/fuckswithtoasters in about 10 years\"}, {\"id\": \"2e246920-4550-11ea-b64e-60f6774aa532\", \"language\": \"en\", \"text\": \"I remember asking my psg why we didnt focus on carrying each other and bounding as opposed to \\\"oh shit PT... 5 mile run\\\". He dead ass looked at me and said \\\"officers have a lot of say in what the PT plan is\\\".\\n\\nOf course our PL was a damn sprinter. So we ran for like 3 days outta the week.\\n\\nThis post motivated me. I love it. Even as a heavy short guy (5\\\" 7, 210 average), i at one point felt i wasnt built for the army because i was a stocky dude even at my lightest. I no shit looked at myself and was like \\\"damn. Im heavy. But i can do infantry shit\\\". Wtf yo? It sucks ass when all youre told to do is run for 5 miles, when you know damn well wearing 70 pounds of crap isnt gonna care of you can run 5 miles in 30 minutes.\\n\\nI still think the bend and reach should be mandated as part of the apft. But w.e.\"}, {\"id\": \"2e246923-4550-11ea-8823-60f6774aa532\", \"language\": \"en\", \"text\": \"Hey guys, four weeks out of every month I coach strength and conditioning. Like many of you, I didn't read this entire long ass post by an amateur fitness enthusiast who has minimal, if any, qualifications to be directing your training.\\n\\nI don't want to address all the wrong things he said in this post. It would take a while. There were some good things too! I'm sure! I narrowed it down to criticizing the little fixation on recovery aids at the end (foam rolling for \\\"recovery\\\" is dumb btw. PM me for deets) and the requisite \\\"I'm a tacticalmountainoperatelete and focusing  on aerobic capacity is dumb\\\" before settling on the latter.\\n\\nThere are many reasons to develop your aerobic work capacity from an occupational standpoint. We spend long days under load in harsh climates. Adaptations that tend to accompany aerobic development, such as increases in plasma volume, cardiac output, tolerance for exertion, and higher lactic threshold are all conducive to tactical fitness.\\n\\nHowever, by far the biggest benefit to the tactical athlete is increased capacity in all the other aspects the OP is talking about.  For every sprint, there is a corresponding resynthesization of creatine phosphate, clearance and reconversion of lactate, rebalancing and resynthesization of hormones, rebuilding of stretched and damaged structural proteins, etc. These are all aerobic processes. OP is correct when he says sprinting once is an anaerobic process. He doesn't consider that sprinting repeatedly is an aerobic process as well. Athletes who lack an aerobic foundation lack the foundation for improvement in their total fitness. Just because the Army historically has been very bad at developing aerobic fitness doesn't mean that it's a waste of time. It just means that leadership didn't know how to coach it.\\n\\nIn conclusion, I'm very excited to see initiatives like THOR3 evolve into POTFF and hope to see a proliferation  of strength and conditioning professionals, athletic trainers, and physical therapists in the active army.\"}, {\"id\": \"2e246928-4550-11ea-bcd4-60f6774aa532\", \"language\": \"en\", \"text\": \"When I started reading this, I was thinking to myself, fuck, this sounds exactly like some two scoops of hooah officer speech. Read down to \\\"when I was a brand new 2LT\\\" That tells me everything I needed to know.\"}, {\"id\": \"2e24692a-4550-11ea-a25f-60f6774aa532\", \"language\": \"en\", \"text\": \"is this post on the commanders book list?\"}, {\"id\": \"2e24692b-4550-11ea-95e5-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"2e24692d-4550-11ea-8d84-60f6774aa532\", \"language\": \"en\", \"text\": \"TLDR\"}, {\"id\": \"2e246931-4550-11ea-8a4b-60f6774aa532\", \"language\": \"en\", \"text\": \"Excellent post. Although I've been out since '12, I really need to get back in shape. One thing I didn't think I'd miss was the morning PT. It's so easy to do it in your platoon, but when you're a civvie and doing it alone, there's no one to motivate each other. I sure wish I could go back in just for that, but I'll settle for saving this post and hope for the best.\"}, {\"id\": \"2e246933-4550-11ea-b642-60f6774aa532\", \"language\": \"en\", \"text\": \"Everything that was written doesn\\u2019t count, OP wasn\\u2019t wearing a PT belt.\"}, {\"id\": \"2e246934-4550-11ea-9ff1-60f6774aa532\", \"language\": \"en\", \"text\": \"Jesus Christ, this is like every motto speech from an O3/Below combined.....\"}, {\"id\": \"2e246936-4550-11ea-93e5-60f6774aa532\", \"language\": \"en\", \"text\": \"Great write up!\"}, {\"id\": \"2e246937-4550-11ea-8dbe-60f6774aa532\", \"language\": \"en\", \"text\": \"omg who are you\"}, {\"id\": \"2e246938-4550-11ea-b710-60f6774aa532\", \"language\": \"en\", \"text\": \"But sir how will my chain of command know I'm a good soldier?\"}, {\"id\": \"2e246939-4550-11ea-9bae-60f6774aa532\", \"language\": \"en\", \"text\": \"Every fat body in the army should get chaptered out for being a liability in my opinion \"}, {\"id\": \"2e24693b-4550-11ea-9e25-60f6774aa532\", \"language\": \"en\", \"text\": \"I love your post.  I was Navy (don't hold it against me).  I'm working towards law enforcement now and hate the cooper standards.  I've been looking for a regimen that is all encompassing instead of training to run or training to push the ground.  \\n\\nWhat do you mean by \\\"release\\\" when speaking about the ruck/run?\\n\\n\"}, {\"id\": \"2e24693d-4550-11ea-9eb6-60f6774aa532\", \"language\": \"en\", \"text\": \"Sir, that\\u2019s great but this is the order window. \"}, {\"id\": \"2e24693e-4550-11ea-988e-60f6774aa532\", \"language\": \"en\", \"text\": \"Mountain Tactical Institue programs are pretty dm good if anyone wants a possible training path.  \"}, {\"id\": \"2e24693f-4550-11ea-beb8-60f6774aa532\", \"language\": \"en\", \"text\": \"Thanks for this. \\n\\nPT is for sure a passion of mine. I will for sure be using a few of those workouts from the 4 week sample.\\n\\nI really like the concept that we are professional athletes but for the sport of combat, and will most likely relay this a great deal to my soldiers when they lose sight of the goal of PT. \\n\\nThanks again for a great write up!\"}, {\"id\": \"2e246940-4550-11ea-9efd-60f6774aa532\", \"language\": \"en\", \"text\": \"This article is just as good as the last one, which is to say not very. It **does** sound like someone who started in the 82nd, though.\"}, {\"id\": \"2e246941-4550-11ea-b34a-60f6774aa532\", \"language\": \"en\", \"text\": \"Not necessarily, until you have been a professional athlete, it is very difficult to comprehend the unrelenting stress of training and sheer amount of work to perform at an elite (top 1% minimum) level on a consistent basis. I have been an elite athlete and now train elite athletes (quite a few who have joined and become soldiers of high caliber). Something I have learned is, generally speaking and if the individual has some good character, many (if not most) professional sport athletes (even competitive professional gamers for their brilliant strategic/reactionary minds) could become elite soldiers. If you have been in an elite unit, most will call themselves \\\"normal guys\\\". I even knew a stellar operator, a full-time pastor in SF who wasn't very athletic, nor in the greatest shape, but he had good character, and never gave up, but it would have been tremendously difficult for him to put the work in for becoming an elite sport athlete.\"}, {\"id\": \"2e246942-4550-11ea-98dd-60f6774aa532\", \"language\": \"en\", \"text\": \"That was cringey\"}, {\"id\": \"2e246943-4550-11ea-a528-60f6774aa532\", \"language\": \"en\", \"text\": \"Saved that PT plan, thanks for this\"}, {\"id\": \"2e246944-4550-11ea-a01d-60f6774aa532\", \"language\": \"en\", \"text\": \"Any thoughts on conditioning/build up to this level? If I have someone who isn't passing the APFT, where do they start in this?\"}, {\"id\": \"2e246946-4550-11ea-a380-60f6774aa532\", \"language\": \"en\", \"text\": \"4/10 shitpost. Less words, more dank.\"}, {\"id\": \"2e246947-4550-11ea-b20d-60f6774aa532\", \"language\": \"en\", \"text\": \"Why do we have litters if we have to carry 1 on 1?\"}, {\"id\": \"2e246948-4550-11ea-a225-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"2e24694a-4550-11ea-a61e-60f6774aa532\", \"language\": \"en\", \"text\": \"I can't decide if reading this is worse than PowerPoint classes. Oh wait, yes, it is. \"}, {\"id\": \"2e24694c-4550-11ea-a90f-60f6774aa532\", \"language\": \"en\", \"text\": \"I didn't read any of that, but does this mean we get to do inline hockey for sports PT now?\"}, {\"id\": \"2ec1a43c-4550-11ea-b5ad-60f6774aa532\", \"language\": \"en\", \"text\": \"18 series Combat Dive Supervisor here. Respect for these guys. Then obligatory snarky comment about SF being awesome. Which it is. \"}, {\"id\": \"2ec1a441-4550-11ea-8446-60f6774aa532\", \"language\": \"en\", \"text\": \"I wanted to be a diver but the recruiter told me it would take more than a year to find a contract.  Then, I almost got a spot at dive school, but my squad leader was like \\\"Noooo\\\" we can't have anyone in our squad going to any schools.  And guess who got my spot to go to dive school.  My fucking squad leader and he failed so yea fuck him.\\n\\nGreat write up though OP.  Maybe I'll look and see if there are any reserve spots open and re enlist. \"}, {\"id\": \"2ec1a443-4550-11ea-9ebb-60f6774aa532\", \"language\": \"en\", \"text\": \"Very nice.\\n\\n\\n\\n\\n\\nI would like to hear from a 12M next.\"}, {\"id\": \"2ec1a446-4550-11ea-9e69-60f6774aa532\", \"language\": \"en\", \"text\": \"What is career progression for you like realistically\"}, {\"id\": \"2ec1a448-4550-11ea-9555-60f6774aa532\", \"language\": \"en\", \"text\": \"I kind of wish they emphasized swimming a *tiny* bit more for at least PT related stuff. People far greater than I at PT failed the GAFPB but I earned the thing because I can swim and they can't. Real bummer.\\n\\nKudos, OP, that sounds like a real kick in the nuts. I'm curious to know what life is going to be like for you after AIT. \"}, {\"id\": \"2ec1a44b-4550-11ea-8f40-60f6774aa532\", \"language\": \"en\", \"text\": \"I'm actually curious about what equipment you're on. I'm guessing SCUBA is some wack return hose regulator on doubles? They put you on a rebreather at all?\\n\\nEdit: also -- do you get trained for accelerated deco, or do you just do it on air?\"}, {\"id\": \"2ec1a44d-4550-11ea-b9d4-60f6774aa532\", \"language\": \"en\", \"text\": \"I kept reading this as 'Drivers' and was trying to figure out why swimming and diving was so important to the job.\"}, {\"id\": \"2ec1a44e-4550-11ea-a23c-60f6774aa532\", \"language\": \"en\", \"text\": \"Just when you thought it was safe to go back in the water.\"}, {\"id\": \"2ec1a44f-4550-11ea-8e06-60f6774aa532\", \"language\": \"en\", \"text\": \"What does your career path and promotion potential look like?  If it is as limited as I\\u2019m guessing, why choose army over navy where the field is broad with lots of upward mobility?\\n\\nCool write up.  Very interesting MOS that I\\u2019d never thought of before. \"}, {\"id\": \"2ec1a451-4550-11ea-af1c-60f6774aa532\", \"language\": \"en\", \"text\": \"12D washout here. I went to 169th back in March. Phase one was good except for the damn treading with no hands. I couldnt eggbeater for shit! \\n master diver was super chill, big older guy, and the dive sup. was the tatted up young cat. \\nI forget their names, but maybe you saw them?\\nCongratulations on making the cut!\"}, {\"id\": \"2ec1a453-4550-11ea-9d23-60f6774aa532\", \"language\": \"en\", \"text\": \"This was pretty interesting. I'm hardly a good swimmer, I know just enough to survive in the water, but diving in the military always seems like it would be a badass job. Good luck my dude.\"}, {\"id\": \"2ec1a454-4550-11ea-ba0c-60f6774aa532\", \"language\": \"en\", \"text\": \"Is it any different if you are already dive master in the civ world, or just forget it all and do everything the same? \"}, {\"id\": \"2ec1a456-4550-11ea-a641-60f6774aa532\", \"language\": \"en\", \"text\": \"I'm trying to figure out if I know you from FLW since I've been at B169 for about 20 weeks.\"}, {\"id\": \"2ec1a458-4550-11ea-bd5b-60f6774aa532\", \"language\": \"en\", \"text\": \"I tried convincing my readiness nco to let me go but unfortunately the one NG unit we had in texas got moved out of state or liquidated idk. I thought id have a better chance getting to dive school then sapper I was wrong\"}, {\"id\": \"2ec1a45a-4550-11ea-965c-60f6774aa532\", \"language\": \"en\", \"text\": \"Great write up.  Whats the day to day work life of a 12 D in the reg army like? Do you get to do your job much?\"}, {\"id\": \"2ec1a45c-4550-11ea-92dd-60f6774aa532\", \"language\": \"en\", \"text\": \"How far along were you when you had the barracks change? I was at 169 during that time, total clusterfuck\"}, {\"id\": \"2ec1a45e-4550-11ea-b4d9-60f6774aa532\", \"language\": \"en\", \"text\": \"I remember the whole fiasco with people trying to leave to see family and everything, whole lotta mismanagement and miscommunication with the situation\"}, {\"id\": \"2ec1a460-4550-11ea-894a-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"2ec1a462-4550-11ea-8a6b-60f6774aa532\", \"language\": \"en\", \"text\": \"Sir, this is a McDonald's\"}, {\"id\": \"2ec1a463-4550-11ea-a21d-60f6774aa532\", \"language\": \"en\", \"text\": \"And the winner for the longest post ever goes to.....\"}, {\"id\": \"2f6361f8-4550-11ea-8044-60f6774aa532\", \"language\": \"en\", \"text\": \"It's tough because ultimately the tasks you have to pass on the APFT have very little/nil bearing on how you can perform as a soldier. However, the Army does need an efficient and easy way to assess 1,000,000+ soldiers on their overall physical fitness. And although there is plenty of exceptions, most of the time when someone sucks on the PT test, they are not in exceptional shape when it comes to other tasks. But there are plenty of people that are.\\n\\nI guess what I would like to see is just something a little more comprehensive. Realize that once every six months, we need to take more than a morning, possibly closer to one day, to really assess someones physical fitness. Incorporate more combat specific/related task. Like can you pick up and carry a dummy that ways the same as an average U.S. soldier a certain distance in under a certain time? Can you, with a standard combat load, cover a certain distance on foot in a time limit? Those are just two, random tests off the top of my head. \\n\\nBut, a problem with the current one, is the Army's utter devotion to it above all. So basically, when it comes time to PT, we are training to pass the PT test, not training to be effective combat fighters. We neglect what would be more useful exercises/PT programs, because that would lead to a decrease in PT scores, even though we could actually become more effective on the battlefield.\"}, {\"id\": \"2f6361fb-4550-11ea-9c64-60f6774aa532\", \"language\": \"en\", \"text\": \"We need to stop changing everything. \"}, {\"id\": \"2f6361fc-4550-11ea-bb29-60f6774aa532\", \"language\": \"en\", \"text\": \"I think it is fine. It shows that soldiers can complete multiple fitness tasks.  While you will never run two miles in a combat situation it shows that you have some sort of endurance.  \"}, {\"id\": \"2f6361fd-4550-11ea-abeb-60f6774aa532\", \"language\": \"en\", \"text\": \"I think the APFT is great for what it is: an equipment-less assessment of upper body strength, core strength, and cardiovascular endurance that can be done fairly quickly.\\n\\nTo give an example, ruck marching is incredibly important as a soldier skill, but can require more safety preparation, requires hydration, requires preparing and weighing rucks (if only casually and at the squad level), and takes several times longer than an APFT if you want to cover a substantial distance.\\n\\nI think there's a lot of value in doing stuff that isn't army unit PT, but weightlifting, for example, is hard to accommodate everyone on base for, so ultimately the whole Army cannot be based off gym PT without a substantial years long overhaul.\\n\\nSoldiers should definitely be assessed by their units on other tasks like buddy carries, though that is in PRT under the guerrilla drills section now, but the APFT does represent a good foundation for force wide physical fitness assessment to be built upon, in my mind. At least for me, my APFT performance tracked fairly well with my overall fitness level.\"}, {\"id\": \"2f6361fe-4550-11ea-b10e-60f6774aa532\", \"language\": \"en\", \"text\": \"The tape test needs to be used as a screening tool instead of the end-all bodyfat measurement standard by which we discipline and separate soldiers.  If a soldier pops tape, send them to the BodPod at AWC for precise checking. \\n\\nI'm a big dude, so tape is like my existential enemy.  BodPod puts me at 3 - 6% BF below where tape puts me - IF I suck in. Tape fluctuates vastly depending on who is taping,  whether they know *how* to tape,  and what you've eaten recently.  BodPod is always steady. \\n\\nTape is pseudoscience,  scrap it. \"}, {\"id\": \"2f6388d4-4550-11ea-9603-60f6774aa532\", \"language\": \"en\", \"text\": \"I would much rather see pull-ups (and the flexed arm hang) than push-ups on the APFT.  There is a glaring inconsistency across the entire Army when it comes to proper push-up form, as some graders are way too lenient while others are way too strict.  I have seen people with horrible form get a lenient grader and max their push-up score way too much.  The only way to cheat a pull-up is kipping, and there's no way in hell that would be allowed if we actually tested pull-ups.\\n\"}, {\"id\": \"2f6388d6-4550-11ea-b7d1-60f6774aa532\", \"language\": \"en\", \"text\": \"Yes. Situps are terrible for your back/neck, especially while holding the back of the head. Switch to crunches and IDGAF. \"}, {\"id\": \"2f6388da-4550-11ea-82fe-60f6774aa532\", \"language\": \"en\", \"text\": \"Personally, I'm more of a fan of the test they used for WWII GIs. Tested more body parts, and the furthest you had to run was 300m(whether this is a positive or negative is up to you, I just don't like the run.) They had it on a graded scale too, so it wasn't just pass/fail.\\n\\nAs it stands now, the APFT provides a pretty good baseline for physical fitness IMO. It needs no equipment and can be performed pretty much anywhere. My biggest issue with it is that the pass/fail nature of it, I.E., a 180 is technically the standard, but passing with a 180 is obviously inadequate.\"}, {\"id\": \"2f6388dc-4550-11ea-b1f1-60f6774aa532\", \"language\": \"en\", \"text\": \"Have you heard of the combat fitness test? \\n\\nThere -are- PT tests designed to \\\"better measure\\\" combat effectiveness.\\n\\nThe point is that they are not worth implementing force wide because of time and equipment required. \\n\\nThe current one is nonsensical, because it's pushed by the same Army group of geniuses who came up with PRT. If the Swimmer is your idea of a good workout, you're clearly retarded. So this circlejerk won't go anywhere. \"}, {\"id\": \"2f6388df-4550-11ea-b23a-60f6774aa532\", \"language\": \"en\", \"text\": \"It's fucking garbage. You have rail thin skinny dudes getting 300s but can barely lift up another soldier. There should be a PT test that incorporates deadlifts, pullups, and sprints.\"}, {\"id\": \"2f6388e1-4550-11ea-b78c-60f6774aa532\", \"language\": \"en\", \"text\": \"I would only be happy if they included the new [Hip Stability Drills] (http://youtu.be/PNNFF3YdIMs?t=16s) in the APFT.\"}, {\"id\": \"2f6388e2-4550-11ea-ab3f-60f6774aa532\", \"language\": \"en\", \"text\": \"I would just be happy if males and females were tested to the same standard.\"}, {\"id\": \"2f6388e4-4550-11ea-b364-60f6774aa532\", \"language\": \"en\", \"text\": \"Add pull-ups, and a mile to the running event. Make the apft a quarterly event. Get rid of PRT. \"}, {\"id\": \"2f6388e6-4550-11ea-832d-60f6774aa532\", \"language\": \"en\", \"text\": \"Do what the air force does and make the waste part of it. Remove sit-ups cause its not fair for tall people.\"}, {\"id\": \"2f6388e7-4550-11ea-82ba-60f6774aa532\", \"language\": \"en\", \"text\": \"I think the test should be conducted over 4 days, with a graded event each day. 5 mile run, 12 mile road march (full combat equipment), a muscular endurance round robin, and finally, the obstacle course.\\n\\nYou can all proceed to lose your minds now and freak out.\"}, {\"id\": \"2f6388e8-4550-11ea-886b-60f6774aa532\", \"language\": \"en\", \"text\": \"From another post I made long time ago:\\n\\n\\\"The Army would have a list of ten or fifteen physical exercises or \\\"events\\\" with a scoring system for each. Events could include push ups, different run distances, pull ups, shuttle runs, etc. Every six months, or whenever it's time for a PT test, three or four events are chosen at random in a lottery type situation. The events are conducted in the order they were picked. 100 points per event.\\nThis system would create soldiers who are more rounded physically and prevent people from only training the classic 3 events.\\\"\\n\\nOr we could also just have every do a standard 12 mile ruck march in 3 hours then immediately drop rucks and take a PT test. If everyone got a 180, you could say they are pretty fit. \"}, {\"id\": \"2f6388e9-4550-11ea-b8e3-60f6774aa532\", \"language\": \"en\", \"text\": \"Yes it absolutely needs revamping. I took one recently and passed even though I hadn't worked out since coming back from Afghan and getting drunk the night before.\"}, {\"id\": \"2f6388eb-4550-11ea-bd69-60f6774aa532\", \"language\": \"en\", \"text\": \"APFT should just be a crossfit WOD\"}, {\"id\": \"2fb7a205-4550-11ea-811c-60f6774aa532\", \"language\": \"en\", \"text\": \"Did you sign them?\\n\\nMe, I'd start going up the chain and asking to be swapped. Starting with that platoon sergeant who placed you there. \\n\\nCause this is bullshit.  \\n\\nAnd go to CIF. \\n\\n\"}, {\"id\": \"2fb7a206-4550-11ea-9d65-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"2fb7a20b-4550-11ea-b67a-60f6774aa532\", \"language\": \"en\", \"text\": \"Firstly, go seek help! Don't let those self-destructive thoughts go any further. \\n\\nThe other thing is: I don't understand how you got an Article 15 (extra duty). If three guys ganged up on you, how were you the one who ended up on charges? \\n\\nThe part about backdated counseling is ridiculous, too. \"}, {\"id\": \"2fb7a20c-4550-11ea-a0dd-60f6774aa532\", \"language\": \"en\", \"text\": \"Soooo... did you sign these back dated counselings?  How the fuck are they going to effect things if you havent been properly counseled?  \\n\\nIt sounds like you're getting some shit slid your way... but Im interested in the other side of these things.\"}, {\"id\": \"2fb7c8da-4550-11ea-8f34-60f6774aa532\", \"language\": \"en\", \"text\": \"How long until your ETR is over?\"}, {\"id\": \"2fb7c8dc-4550-11ea-b0c2-60f6774aa532\", \"language\": \"en\", \"text\": \"Wait the 6 counselings are purely counselings right? We'll keep pushing on and prove to your new first line/PL&PSG . That you're a good soldier. You're probably close to a PCS or at least a new company right?\"}, {\"id\": \"2fb7c8de-4550-11ea-b7c8-60f6774aa532\", \"language\": \"en\", \"text\": \"It's over this July, I have already talked to the recruiter about returning but recently got ICL surgery, which kind of extends a return.\"}, {\"id\": \"2fb7c8df-4550-11ea-977f-60f6774aa532\", \"language\": \"en\", \"text\": \"I am more than willing to go into detail on both sides of every single issue I was 'counseled' on if you would like a PM...not trying to throw anyone under the bus here and I'm not sure if he's on r/army \"}, {\"id\": \"2fb7c8e0-4550-11ea-bb08-60f6774aa532\", \"language\": \"en\", \"text\": \"And no I didn't sign them.\"}, {\"id\": \"2fb7c8e1-4550-11ea-bae0-60f6774aa532\", \"language\": \"en\", \"text\": \"I am 3 years from the end of this contract. I want to stay in as long as I can but I'm lacking motivation. I've been promised the promotion board for the past six months now but something training wise kept coming up. SL C also shows huge favoritism in the platoon and is sending the other cat (who is the new TL) who failed selection with me to the board over me next month (they are friends)\"}, {\"id\": \"2fb7c8e2-4550-11ea-a2f5-60f6774aa532\", \"language\": \"en\", \"text\": \"I never was actually counseled. He came in one day while I was on staff duty and handed me the counselings. He typed them up while he was in air assault school.\"}, {\"id\": \"2fb7c8e3-4550-11ea-bc97-60f6774aa532\", \"language\": \"en\", \"text\": \"It was not an official article 15. We were still in Germany and I was just put on KP duty by my Plt Sgt to appease the sir as punishment while everyone else went out on the town for the 4th of July. The other two didn't get an any kind of trouble. The whole incident was pushed under the rug, even after I went to the 1st Sgt about it (he ended up getting fired about a month later from some other shit)\"}, {\"id\": \"2fb7c8e4-4550-11ea-9ba9-60f6774aa532\", \"language\": \"en\", \"text\": \"I have never received an art15. Like I said, never got in trouble in my career till I came here.\"}, {\"id\": \"2fb7c8e5-4550-11ea-ad00-60f6774aa532\", \"language\": \"en\", \"text\": \"Sounds like you're in a unit with a bunch of small dicked guys suffering from little man syndrome. I wish you the best of luck, OP, that sounds fucking rough... Also learn how to properly respond to comments on here. \"}, {\"id\": \"2fb7c8e7-4550-11ea-bc85-60f6774aa532\", \"language\": \"en\", \"text\": \"OP:\\n\\n* Don't sign those counselings.  Tell your SL you're going to the PSG to set the record straight, and do so.\\n\\n* If you're a TL your SL shouldn't be treating you like shit like that, especially in front of the joes, if any were there.\\n\\n* ~~Explain the situation to your PSG, remind him \\\"You said you wanted me in this spot because I fight and don't take any shit, well, this is me not taking any shit.  He's trying to do shady shit and screw me over with backdated counselings.\\\"  Then see what your PSG's fix for the situation is.~~ Just saw that you said your PSG is gone.  Explain the situation to whoever is the new PSG or whoever is filling his shoes.  Backdated counselings are a no-go; again, do not sign them.\\n\\n* Get in there and get that PT back up to snuff.  To hell with your SL; he sounds like a douchebag spotlight soldier.\\n\\n* Let your SL be your motivation to pass selection.  You want to get away from toxic fuckwads like him.\\n\\n* Not sure what to say about your wife; only you can decide if your marriage can be or should be saved.  If not, then wait until the divorce is final before you find somewhere else to dip your wick.  Last thing you need at the moment is an adultery situation being discovered by your douchebag SL.\\n\\n* Be professional as fuck.  Let any shit that Douchebag Squad Leader tries to throw your way roll off your back.  It's nothing to you.  You don't care about his opinion; it's as meaningless to you as if he were a civilian.  If he tries to do something concrete to trip you up, deal with it like a professional, but above all *don't let him get under your skin.*  Let him feel like his snark is as ineffective as punching the wind.  If somebody says \\\"Man, why does he have it out for you so bad\\\", just *act like you hadn't even noticed*, if possible.  He's nothing.  He's wind, a breeze you hardly even notice.\\n\\n* Do the PT, train up, make it your mission in life, crush selection, and when you make it, know that you've surpassed toxic fucks like your former SL.\\n\\nYou were right, /u/jeebus_t_christ, you were [right](https://youtu.be/SxBkN5UsPz0).  *This* is the toxic shit I never had to deal with at all in my platoon. Three and a half years in that platoon, and nothing of this sort ever came my way, thank God.\"}, {\"id\": \"2fb7c8e9-4550-11ea-857f-60f6774aa532\", \"language\": \"en\", \"text\": \"Can we get a tl;dr?\"}, {\"id\": \"2fb7c8ea-4550-11ea-8026-60f6774aa532\", \"language\": \"en\", \"text\": \"My 3 years as a PL, first in an MP line unit, and then MI staff unit, showed me first-hand how excellent Soldiers can get fucked over by circumstances, bad luck, terrible first-line leadership, and general apathy. Reach out to me privately if you ever want to talk and get some counseling from the officer side - a lot of my time as an LT was spent fixing the toxic atmospheres that leaders like your SL create and leave behind.\\n\\nAs an aside, this is also the reason why we, as an Army, are losing great Soldiers that will take us to the next level. And people wonder why we have retention issues every year.\"}, {\"id\": \"2fb7c8ec-4550-11ea-b815-60f6774aa532\", \"language\": \"en\", \"text\": \"I love my wife, we are however currently separated and have been for the past year. I still love her like a bad habit though.\\n\\nWeird about the username thing?\\n\\nJames is actually my real name. Morrissey not.\"}, {\"id\": \"2fb7c8ee-4550-11ea-a330-60f6774aa532\", \"language\": \"en\", \"text\": \"I didn't sign them.\\n\\nI would've gone to CIF a long time ago but we aren't allowed to just go on our own and basically have to get an appointment through Plt Sgt. For whatever reason, this hasn't happened. Optempo is insane here.\"}, {\"id\": \"2fb7c8ef-4550-11ea-8090-60f6774aa532\", \"language\": \"en\", \"text\": \"I'm tracking. Just trying to find the motivation. Worn down like a broken nail at this point.\"}, {\"id\": \"2ff91210-4550-11ea-9f09-60f6774aa532\", \"language\": \"en\", \"text\": \"Take anything you read from Army Times with a grain of salt. They are very rarely correct, and you can usually assume details are wildly off. Army Times is good for reading about things that already happened, or for getting a gist of where the Army is headed. Anything else might as well come from the National Enquirer.\"}, {\"id\": \"2ff9390a-4550-11ea-97ed-60f6774aa532\", \"language\": \"en\", \"text\": \"Heavy, significant, moderate. Three levels. Each MOS has one of those ratings. 4 events. Power throw, standing long jump, \\\"deadlift\\\", shuttle run. Heaviest weight you have to deadlift on the trap bar is 160 lbs. 5'3 long jump. 14'9 throw. 43 shuttles. \"}, {\"id\": \"2ff9390d-4550-11ea-b5cb-60f6774aa532\", \"language\": \"en\", \"text\": \"Here's the breakdown per MOS, WOMOS and AOC:\\n\\nhttps://drive.google.com/file/d/0BxBTqr4tL36eREdKQVBLbXhiSVE/view?usp=sharing\"}, {\"id\": \"2ff93910-4550-11ea-abab-60f6774aa532\", \"language\": \"en\", \"text\": \"Anyone knows roughly how fast I need to run 2miles to pass 43 shuttles?\"}, {\"id\": \"3061f293-4550-11ea-bf5b-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"3061f296-4550-11ea-a733-60f6774aa532\", \"language\": \"en\", \"text\": \"Pretty much. They say it won't affect your career but it does. Go to an off base psychologist or something \"}, {\"id\": \"3061f298-4550-11ea-96ac-60f6774aa532\", \"language\": \"en\", \"text\": \"Fears of this happening are part of what eventually led one of my soldiers to suicide. He didn't want to seek help because he didn't want to give up career opportunities.\\n\\nNow he doesn't have any career opportunities, because he's dead.\"}, {\"id\": \"3061f299-4550-11ea-8e4d-60f6774aa532\", \"language\": \"en\", \"text\": \"Meeting the bare minimum.\\n\\nBeing rectangled away.\\n\\nGetting in trouble only a strategic amount of times or with tact.\\n\\nTaking ONLY automatic promotions.\\n\\n\\\"I did it Sarge. Just guess I didn't do a good job\\\"\\n\\nNatty Light.\\n\\nAll it takes to be a great Combat MOS solider. Anymore than that and the Army begins to get suspicious. Fucks over perfectly good soldiers like yourself. That shit pisses me off.\\n\\nSomeone mentioned:\\n\\n1 night in the dumps ruined years of a perfectly good soldiers career. Shit pisses me off.\"}, {\"id\": \"3061f29a-4550-11ea-bf21-60f6774aa532\", \"language\": \"en\", \"text\": \"Dickbags, go through One Source. They will link you to an off base counselor and everything is confidential. Don't like that person, they will set you up with a new one. All free, no paper trail, all confidential. \"}, {\"id\": \"3061f29c-4550-11ea-b3a3-60f6774aa532\", \"language\": \"en\", \"text\": \"Military One source. Keep in mind, smart leadership always uses the words \\\"most of the time\\\" and \\\"usually\\\" when talking about how Behavioral Health will effect your career.\"}, {\"id\": \"3061f29d-4550-11ea-a3b1-60f6774aa532\", \"language\": \"en\", \"text\": \"Go to the Chaplain!!!!!! They can't tell a soul what you talk to them about and many have knowledge of psychology. \\n\\nEdit: words\"}, {\"id\": \"3061f2a0-4550-11ea-b4ea-60f6774aa532\", \"language\": \"en\", \"text\": \"I had a really alright psg a lot of years back (more like 4..) and I had things going on and requested bh. He and a ssg took me aside and gave me a long list of reasons why that would not be a good idea. About half my company was taken off the deployment list a few days prior. \\nThey talked me out of it and told me to use the chaplain or a different source but NOT bh for these reasons. About two weeks later a few of us were added back to the roster and I was luckily added back as well. But I know that if I hadn't taken their advice, I would have been in the same boat OP. I did however come to find out, the acting company commander heard the entire ordeal and acted on the NCOs\\nI know this doesn't directly help you, but t is why I ALWAYS tell soldiers not to ever go to BH unless suicide/homicide/reclassing to 19D are on their minds. \\nThey need to know that BH is not a venting place, but a place for people with behavioral problems to be screened and fixed. \"}, {\"id\": \"3061f2a1-4550-11ea-994e-60f6774aa532\", \"language\": \"en\", \"text\": \"I've known this ever since I got in. I would never even mention to someone in my unit that I was considering thinking about possibly feeling like I might want to go check it out. No cartilage in your knees, spine all crooked, headaches, feet outta whack, hips not moving right? That's fine. There's a profile for that. Anything on the mental side of the house? Keep that shit to yourself unless you want out or are gonna harm yourself/others. Push it down, suck it up, and drive on. Your mental health can wait until you ETS.\\n\\nWhat's even funnier is I'm sure I've taken some Army training that has told me there's no stigma associated with seeking mental help. Sorta like EO and SHARP: you can file a complaint, but not if you want a career. Just another dirty little Army open secret no one talks about.\"}, {\"id\": \"3061f2a3-4550-11ea-8a76-60f6774aa532\", \"language\": \"en\", \"text\": \"Same with ASAP, even self-referrals. I could not compete a flight physical for Warrant because I self enrolled 2 years ago and completed the program. These programs they tell you to go to if you need help, with no criticism mind you, fuck your chances of progressing. \"}, {\"id\": \"3061f2a4-4550-11ea-b39b-60f6774aa532\", \"language\": \"en\", \"text\": \"Even afterwards it affects you. Looking for life insurance and the company wanted to see my medical records. Sure, no problem, underwriting needs to do its thing. \\n\\nApparently I have panic attacks multiple times a week, which I didn't know about. \\n\\nSo now I have to get that fixed. \"}, {\"id\": \"3061f2a5-4550-11ea-975b-60f6774aa532\", \"language\": \"en\", \"text\": \"Damn near everyone an arms distance from me during my deployment is out and dealing with PTSD from 12 years ago. I am one of the few still in and I'm going strong, but I still see body parts every day. I refuse to talk about it through BH channels for this very reason. Either they will think I'm lying for the VA since I didn't report it or they'll over react. Six years to go. Hang in there folks.\"}, {\"id\": \"3061f2a7-4550-11ea-89b5-60f6774aa532\", \"language\": \"en\", \"text\": \"I'm a behavioral health specialist and its stories like this that make me hate my MOS. If I wasn't assigned to a CSH and focused on combat operational stress control, I would have reclassed long ago\"}, {\"id\": \"3061f2a9-4550-11ea-8f7d-60f6774aa532\", \"language\": \"en\", \"text\": \"Behavioral health is a fucking joke.  I've dealt with two different clinics at two different posts.  I had some shit I was dealing with when I got back from Afghanistan, my situation had become so volatile and my drinking so bad that I swallowed my pride and went to BH.  Thinking I would get help I was given different pill concoctions that only added to my problems and made me worse.  It got so bad that my wife hit her breaking point and I almost lost my marriage.  Over the course of about a year, not once did anyone from either clinic give a rats ass about me.  The only thing they gave a shit about was whether I was taking my meds or not.  After a while I just got fed up with it all.  I flushed all my pills, cancelled all my appointments with behavioral health, and started seeing an offpost provider on my own dime.  While I can't say that everyday is a good day for me, I can say that my life is a hell of a lot better than it was when I was relying on big army to help me. My wife and I started working on us and now things are pretty stable and a lot better than they were.  Sorry for the long rant, but my experience with Army behavioral health has left a really sour taste in my mouth.\"}, {\"id\": \"3061f2aa-4550-11ea-bc87-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"3061f2ad-4550-11ea-bc37-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"3061f2af-4550-11ea-ad3e-60f6774aa532\", \"language\": \"en\", \"text\": \"Sad to say, but it seems to affect lower enlisted the most. E7 and above go to behavioral health plenty. I guess the rationale is that you haven't been in long enough to have needed help. Just realize you're probably better off \"}, {\"id\": \"3061f2b0-4550-11ea-a1c5-60f6774aa532\", \"language\": \"en\", \"text\": \"Wow, fuck those douchebags. Turning people down for making sure their mental health is squared away is unacceptable. I totally understand if there is an existing mental condition, but one behavioral health visit is fucking *not* the same as that. Get your shit together Army. How fucking dare any position of authority make it seem like it's the lowest level's fault when a soldier kills himself (oh, if only we threw more ACE cards at our friends' faces) when the institution will fuck over soldiers who try to stay on top of their mental life and nip problems in the bud. And they're going to lecture *me* on a stigmatizing culture? Fuck all of that. It's shit like this that reinforces the culture against seeking counseling. In a perfect world, *everybody* would do mental health checkups and make sure your brain is good like you make sure the rest of you is good. \\n\\n100% unacceptable. What a fucking disgrace that this happened to you OP. Zero fucking excuse. Fuck that. \"}, {\"id\": \"3061f2b1-4550-11ea-b605-60f6774aa532\", \"language\": \"en\", \"text\": \"I am the farthest thing from religious, but when I got shit I need to talk about, I go to the chaplain and tell him to leave god out of it. Works wonders. \"}, {\"id\": \"3061f2b2-4550-11ea-828a-60f6774aa532\", \"language\": \"en\", \"text\": \"VA Vet Center is a good option. No direct link to VA or Chain of Command. Worked for me. YMMV\"}, {\"id\": \"3061f2b3-4550-11ea-8725-60f6774aa532\", \"language\": \"en\", \"text\": \"Be me. Be depressed and goto BH. Be prescribed therapy and antidepressants. Become more functional human being. Experience nothing mentioned in OP's post. \\n\\nMind you I don't give a fuck about selection or any of that, which I could see BH having some effect on, but if you want to be your average careerist soldier going to get help when you need it is going to be far less detrimental than putting a bullet into your head. \\n\\n\\nThis post is bad and you should feel bad. \"}, {\"id\": \"3061f2b5-4550-11ea-81b8-60f6774aa532\", \"language\": \"en\", \"text\": \"This is true. I'll share my little story. \\n\\nFirst this...this shit fucked me up. Right here:\\n\\n**AR 40-501, Section 2-27, line g:**\\n\\n> History (demonstrated by repeated inability to maintain reasonable adjustment in school, with employers or fellow workers, or other social groups),**interview**, or **psychological testing** revealing that the degree of immaturity, instability, personality inadequacy, impulsiveness, or dependency will likely interfere with adjustment in the Armed Forces does not meet the standard.\\n\\nBehavioral health can end your career. It cannot get you kicked out automatically, as it requires Surgeon and Commander coordination. However, it can halt opportunities. Depression can end your career but can be turned around. My diagnosis cannot. BUT, my story ends with high hopes!!!\\n\\nI can't apply for commissioning programs while I'm still in. My last commissioning physical expired last year (they last 2 years) and didn't last enough for me to apply to programs this year. When I attempted to re-do a commissioning physical late last year, the PA deemed as \\\"unfit for commissioning\\\" due that stupid interview \\\"diagnosis\\\" on my record and the physical was halted that moment. I wanted to cry when I walked out of the clinic.\\n\\nAbout 2 years ago, I built a packet for flight medic school. My last piece was to interview the flight psychologist. Long story short, she put something in my record which literally jeopardized my whole career path goal: commissioning. She did not recommend me for flight crew duty, she put something on my record, under mental health. IAW with AR 40-501 Ch. 2, accession standards are very strict on mental health and categorize any \\\"history\\\" of mental history as \\\"does not mean the standard.\\\"   While psychologists in the Army cannot \\\"diagnose\\\", they can \\\"code\\\" or *label* certain diagnoses with the interview and psychological tests (which I did for flight medic packet). This allowed, as per Army regulations. Yes, if you have 1 session or \\\"**interview**\\\" with the psychologist, and he/she labels you, it can jeopardize your career, if you want to commission. This is literally allowed, straight from Army regulations. I'm not joking.\\n\\nI blew the IQ portion out of the water (top 15%) but she shattered my dreams with that\\\"diagnosis\\\" of her.  If I want to, I could push for a chapter under this \\\"diagnosis\\\". Behavioral health and command would probably laugh at me. However, if I want to commission, I'd be denied service and no one skips a beat. Isn't that fucked up? I don't even take medicine or therapy for this. I could, but I won't because I function well. Do I have this? No, it's not a mental illness either. I won't say what, but just know it's very broad. And if you get it in your record, it can fuck you up.\\n\\n**Ok. So did I give up?** Almost. I was devastated. I wanted to literally kill myself. I googled my situation and found similar sotires, but nothing like mine. My diagnosis is a career killer.\\n\\nI spent countless hours researching and asking the right people (a few people in this forum also) how to go about this. Luckily, I had good rapport with some ROTC programs near my base & across the country. The one that helped me the most was an Air Force Detachment (funny, huh?) and Army ROTC office in a very prestigious university. They explained the cadet commissioning process very very well. My buddies inside AMEDD explain the military medical record side. So I connected the pieices and figured it out.. It's complicated but simple.\\n\\n*There is a way.* I can still commission.\\n\\nThe only way I can commission is if I **exit** the service, and attempt a physical through a civillian doctor (which almost every cadet and HPSP student does). It's shitty, but my only way & ticket. Why? As per DODMERB records, I'm still fine with no issues. DODMERB and the military records don't share (thanks HIPPA). And it will stay like that.\\n\\nCan I fight the \\\"diagnosis\\\" right now? Yes. Of course. You know how the best way to wins battle is to not fight them? This is one of those cases. \\nIf I fight the diagnosis and win (rightfully so), I don't want that shit on my DODMERB record. DODMERB is lenient with waivers and prior service (supposedly), but I ain't risking shit. Someone in here got pisssed because I said I'd lie to DODMERB, but the reality is this shit is real and career killer. I'm not hiding Diabetes or any physical issues. It's literaly a diagnosis from psycholgist after 3 hours of IQ testing and ONE \\\"interview\\\" session. Fuck her.\\n\\nThis shit has created so many headaches, but if there's will there's a way! [IT IS THE ONLY WAY!](https://www.reddit.com/r/Accounting/comments/5acvaa/a_tale_of_two_roommates_the_banker_and_the/) If there's will, there's a way!. But I'll get the last laugh.\\nI can still finish my degree and pre-reqs while I'm in. By the time I get out, I can apply to any ROTC program as a grad student. I already have 3 ROTC programs in the US that can hand me over a contract if I apply as a grad student & now I'm looking into nursing schools. One nursing school will take me anytime (Thanks Norwich) You know what I'm aiming for, career wise? \\n\\n66R.\\n\\nYeah flight psychologist, I'll be able to \\\"diagnose\\\" while you still gotta be everyone's bitch & make notes. \\n\\nIf any you ever decide to join an ROTC program, visit it and always speak to the cadre! They are your biggest help. The biggest help was the Air Force ROTC Capt at a detachment and she guided me though this shit so much. I need to send her a bottle wine once I commission. \\nAlso, thanks u/dnldcs. There's a few others in here, but can't remember. Hangover.\\n\\nThanks for listening.\\n\\n**Oh, what was my \\\"diagnosis?\\\"**\\nCode 301. \\n\\n\"}, {\"id\": \"3061f2b6-4550-11ea-860f-60f6774aa532\", \"language\": \"en\", \"text\": \"A lot of churches offer counseling and you don't necessarily have to be a Christian to take part (both marriage and b/h).\"}, {\"id\": \"3061f2b8-4550-11ea-bbb0-60f6774aa532\", \"language\": \"en\", \"text\": \"I still suggest going to behavioral health if you are considering suicide or think you are *this close* to killing somebody. Getting booted out of the Army isn't as bad as doing time in a cold cell in Kansas and ruining lives. If anything try to see a BH person offpost. It isn't as easy for the Army to track those visits. It is possible, but it takes more work. \"}, {\"id\": \"3061f2b9-4550-11ea-b75f-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"3061f2bb-4550-11ea-9686-60f6774aa532\", \"language\": \"en\", \"text\": \"Does this kind of stuff apply before enlistment? \\n\\nI asked about this is the recruiter thread, but only in regards to actually enlisting. Few years ago I saw a therapist because my life was shitty (job loss, gf loss, move back in with parents, etc all in the span of  couple weeks) and I was fat and eating like crap. My GP at the the time gave me cymbalta (which I never took and threw away after my first meeting with the therapist). The therapist said that I didn't have depression, which the GP thought I might have, and acted as support for a couple months while I lost weight and focused on school. Been 100% ever since then (and even then, was more just being a bitch and whining more than anything else).\\n\\nFrom everything I've gathered/been told, this should have no impact on me getting in. But, does anyone with firsthand experience, or anyone on here who handles this kinda stuff regularly, know if seeing a civilian doctor before enlistment, even without a depression diagnosis, will impact schools, deployments, etc once I am in?\"}, {\"id\": \"3061f2bc-4550-11ea-8823-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"3061f2be-4550-11ea-88ee-60f6774aa532\", \"language\": \"en\", \"text\": \"What about when I wanna gets my adderall??\"}, {\"id\": \"3061f2bf-4550-11ea-b778-60f6774aa532\", \"language\": \"en\", \"text\": \"So I went to BH because I thought maybe it was possible I have ADHD. The social worker I saw told me I was super well adjusted and she personally didnt think there was anything wrong with me, if I wanted I could see a psychiatrist or go to the TBI clinic. I declined especially after the intake interview that I didnt see coming. Could this affect my career?\"}, {\"id\": \"3061f2c0-4550-11ea-a893-60f6774aa532\", \"language\": \"en\", \"text\": \"Hey, better yet.  If you were a Soldier and you married a Soldier and you seek BH, you can also screw up your Spouses career.\"}, {\"id\": \"3061f2c1-4550-11ea-a037-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"3061f2c4-4550-11ea-879f-60f6774aa532\", \"language\": \"en\", \"text\": \"How come shitbags seem to always max their PT test and shoot expert?\"}, {\"id\": \"30f2017e-4550-11ea-a14d-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"30f20180-4550-11ea-8078-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"30f20183-4550-11ea-8187-60f6774aa532\", \"language\": \"en\", \"text\": \"What about the unholy amalgamation that is the RSTA squadron?\\n\\nI'll remember getting to inprocessing at my brigade as a PFC, watching all the other 11Bs get picked up by battalions, only to hear \\\"All the 19Ds and Lovemidget, wait over here.\\\" \\n\\nI turned to the soldier next to me and asked, \\\"What's a 19D?\\\" \\n\\nto which he responded, \\\"We're Cav Scouts.\\\" \\n\\n\\\"What the fuck is a Cav Scout?\\\"\\n\\nHe looked me straight in the eyes and very matter of fact said, \\\"We ride around behind enemy lines on dirtbikes and dune buggies.\\\"\\n\\nI spent 6 years in a RSTA squadron, all because I was sent to SDM while I was in Airborne hold instead of going to Javelin training. Being an 11B surrounded by Cav Scouts is a hell I would not wish on anyone else. Having to do their Spur Ride and go to EIB, being made to wear a Stetson with a yellow cord, being given a saber as an ETS award. Shudder.\\n\\nAlso, never saw any fucking dirt bikes or dune buggies. \"}, {\"id\": \"30f20185-4550-11ea-97b2-60f6774aa532\", \"language\": \"en\", \"text\": \"And this complicated shit is why I'm a mechanic. I just fix the trucks, don't really care who they fucking belong to.\"}, {\"id\": \"30f20187-4550-11ea-871e-60f6774aa532\", \"language\": \"en\", \"text\": \"My worst time in the Army was in infantry battalions. The best time is in a cav unit, my platoon got detached to 2-13 cav for our Iraq deployment, I got the spurs, it was the only well run unit I was in. Loved it. \"}, {\"id\": \"30f20188-4550-11ea-9b0f-60f6774aa532\", \"language\": \"en\", \"text\": \"Awesome post. As Ive said before, in my own experience, the leadership of Cav units always take better care of us MI guys whenever we get attached to them for training events. They let us give capabilities brief so their guys understand what we can do to help them, they make sure we get where we need to be. Theyre good guys to work with. I legitimately think they have a pretty cool job.\"}, {\"id\": \"30f2018a-4550-11ea-99af-60f6774aa532\", \"language\": \"en\", \"text\": \"I wish there were more posts like this explaining the other MOS's of all branches\"}, {\"id\": \"30f2018b-4550-11ea-8776-60f6774aa532\", \"language\": \"en\", \"text\": \"Just to echo what /u/just_foo was saying, you also have to consider the contribution of the cavalry as combat multipliers in certain scenarios geared towards their unique skills and training. So while there are about 1,800 infantrymen in an ABCT and only 376 cavalry troops, sometimes those 376 troops can get a lot more done than the infantry. This is regularly demonstrated at a gloryhole off highway 190 outside Fort Hood. \"}, {\"id\": \"30f2018d-4550-11ea-8563-60f6774aa532\", \"language\": \"en\", \"text\": \"Huh. Quality post. I've always wondered what *exactly* modern Cav was for, and now I know. I'm pretty sure I've drunkenly meandered on over to the neighboring Cav Squadron Staff Duty desk to ask them, but I don't remember if they told me to fuck off or not.\"}, {\"id\": \"30f2286c-4550-11ea-a168-60f6774aa532\", \"language\": \"en\", \"text\": \"I've been in the Cav for most of my 11 years..I agree completely with the intent of the Spur Ride, but you're right, it turns into a mass hazing event. Which is why our SQDN CDR won't let us do one..now everyone is trying to go to the Cav leaders course.....good thing I've already got spurs and a Stetson\"}, {\"id\": \"30f2286d-4550-11ea-a551-60f6774aa532\", \"language\": \"en\", \"text\": \"So if the Cavalry was historically an elite force, why don't they have a monarchy title? Aka Queen of Battle and King of Battle.\\n\\nKind of joking but also serious question. \"}, {\"id\": \"30f22872-4550-11ea-931f-60f6774aa532\", \"language\": \"en\", \"text\": \"You're still gay tho \"}, {\"id\": \"30f22874-4550-11ea-b2e0-60f6774aa532\", \"language\": \"en\", \"text\": \"I was a cavalry officer with an infantry platoon in an infantry troop in a cavalry squadron which was part of an airborne infantry brigade. No one knew what they were supposed to be. I remember explaining to my (all infantry) guys what a Green 2 report actually was (along with the other color reports) and just saw a light go on like \\\"oh shit, the cav actually does stuff...\\\"\"}, {\"id\": \"30f22879-4550-11ea-ab5d-60f6774aa532\", \"language\": \"en\", \"text\": \"Excellent post, thanks for the write up. \"}, {\"id\": \"30f2287a-4550-11ea-aa7b-60f6774aa532\", \"language\": \"en\", \"text\": \"This is awesome. Well done. I can see the OER bullet now, \\\"Educated a bunch of Reddit troglodytes on the finer points of Cavalry history. Without his input, the Army subreddit would have just been a desert of gay jokes, shit posting and cavalry-hate.\\\"\\n\\nSeriously, good read. You should probably publish something sometime. \"}, {\"id\": \"30f2287b-4550-11ea-8a83-60f6774aa532\", \"language\": \"en\", \"text\": \"All I can say is... Great post, Sir.  \"}, {\"id\": \"30f2287c-4550-11ea-888f-60f6774aa532\", \"language\": \"en\", \"text\": \"All of this chatter about Cav, and nothing about Aviation?\\n\\nIts probably for the best. AirCav is just the same shit we do; with silly hats and misplaced Texas pride that they are better\"}, {\"id\": \"30f2287e-4550-11ea-b83b-60f6774aa532\", \"language\": \"en\", \"text\": \"> Halfway down the trail to Hell,\\n\\n>In a shady meadow green\"}, {\"id\": \"30f2287f-4550-11ea-8a66-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"30f22881-4550-11ea-92b4-60f6774aa532\", \"language\": \"en\", \"text\": \"I would argue that the Air Cavalry's role, doctrinally, would be a reconnaissance function, rather than a dragoon analog. The -58 fleet wound up performing a lot of CCAs, but all of the pre-GWOT utilization pointed more towards recon & movement screening. \"}, {\"id\": \"30f22883-4550-11ea-b4e0-60f6774aa532\", \"language\": \"en\", \"text\": \"> The spur-ride is another beast entirely. When conducted properly, it's a validation of your understanding of the core doctrinal tasks required of cavalrymen, coupled with a physically and mentally demanding set of challenges designed to test your self-discipline and toughness.\\n\\nWe put the HA in hazing.\"}, {\"id\": \"30f22884-4550-11ea-b058-60f6774aa532\", \"language\": \"en\", \"text\": \"I know this is off topic from the point of the post, but I was just wondering what made you choose Armor/Cav as your branch?\\n\"}, {\"id\": \"30f22886-4550-11ea-82c0-60f6774aa532\", \"language\": \"en\", \"text\": \"Except the modern cavalry Stetson was adopted based on Western movies from the 60's/70's more than anything else, it isn't \\\"traditional.\\\" \\n\\nA traditional cover for cavalrymen that cavalry actually wore in the \\\"Old West\\\" would be a kepi, or the campaign hat worn by drill instructors ( which didn't used to be wore all flat and pointy at the top.)\"}, {\"id\": \"30f22887-4550-11ea-bb1a-60f6774aa532\", \"language\": \"en\", \"text\": \"You make an inference that the infantry are the ones worrying about what the cav says and does. But from my outside view (I'm merely a pog, although I spent time with both), I noticed most of the shit talk comes from the cav guys making comments.\\n\\nExtremely informative post nonetheless. We need more of this on some other mos's.\"}, {\"id\": \"30f2288a-4550-11ea-bf5f-60f6774aa532\", \"language\": \"en\", \"text\": \"Did you go to ARC to be a cav officer?\"}, {\"id\": \"30f2288c-4550-11ea-992a-60f6774aa532\", \"language\": \"en\", \"text\": \"So can you explain why every time cav dudes come around to whatever FOB or outpost anywhere the porta-shitters (or inset anything else be it walls, ect) get a collage of dicks drawn on them? I mean you always have 1 in/on each but it seems cav units just are really artistic and go total https://youtu.be/IDWXpfS-il4?t=28s super bad with it.......I started to think the 8% he was talking about all become Cav.....I really did. \"}, {\"id\": \"30f2288e-4550-11ea-8091-60f6774aa532\", \"language\": \"en\", \"text\": \"As of 2011 Air Cavalry was solely the purview of the Kiowa Warrior conducting recon and security in the scout role and light attack in the CCA role. It is my understanding that there are no more Air Cav, *a la* Ia Drang Valley, anymore. Air Cavalry squadrons are in the proces of fielding Apaches to continue the doctrinal mission with a different horse.  \\n\\nRegardless, great write up.\"}, {\"id\": \"30f22890-4550-11ea-bab7-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"30f22892-4550-11ea-8d21-60f6774aa532\", \"language\": \"en\", \"text\": \"My favorite part about the Cav is all the dick.\"}, {\"id\": \"30f22894-4550-11ea-ab20-60f6774aa532\", \"language\": \"en\", \"text\": \"You're right, the rivalry is one-sided. You guys like peckers and we don't. I could do a write up about the Cav way faster.\\n\\n\\nThe Cavalry..\\n\\n\\nGay.\"}, {\"id\": \"30f22896-4550-11ea-b2d6-60f6774aa532\", \"language\": \"en\", \"text\": \"You forgot to mention the Cavs scout's predilection for sheep.\"}, {\"id\": \"3129d140-4550-11ea-bc4c-60f6774aa532\", \"language\": \"en\", \"text\": \"This was great mac, thanks so much for the write-up!\\n\\nI get they started counting from September, but from your perspective, it sounds like this essentially started in July, yeah?\\n\\nCongratulations on it being complete, and receiving your ratings!  Enjoy the terminal leave!\\n\\nWhat I *don't* see here, is anything about them **actually fixing you**.  How's that working out?\"}, {\"id\": \"3129d142-4550-11ea-9133-60f6774aa532\", \"language\": \"en\", \"text\": \"Thanks for this. I'm currently in the MEB process, so this helps put my mind at ease on how long this may take.\"}, {\"id\": \"3129d143-4550-11ea-a4cb-60f6774aa532\", \"language\": \"en\", \"text\": \"Damn I'm jealous. I got an an MEB for my back, three herniated disks, several other compressed, and degenerative disk disease and only got 20% for it (Army side), ended up with 70% total. Would've been nice to have Tricare.\"}, {\"id\": \"3129d148-4550-11ea-a5f1-60f6774aa532\", \"language\": \"en\", \"text\": \"Stolen from u/35mango\\n\\n>Ahh. My bad. It is cheap as fuck to ensure your family Through Tricare Prime once you medically retire. I would still use Tricare the fam and VA (and) VA Choice for yourself. You'd still pay premiums and deductibles for the family through Tricare but no deductibles for yourself if you use VA and VA Choice.\\n\\n>I keep harping on VA Choice because it's a wonderful fucking program assuming the incoming administration doesn't fuck with it. Any appointments outside of 40 miles or 30 days and you can make a few phone calls to get that shit expedited and closer. It gets a bit tedious at first but you get used to it. Since you're probably the most broken in your family (not to be offensive) I would definitely look into it. Also, if you're too broken to work then look into Medicaid as well. The three working together means you never have to wait as long or pay as much as if you had one or none of them. \\n\\n>Source: I use all three. Some might call me a mooch on society but my body is all jacked up. When I need fixing. I need fixing as quickly (and as cheaply) as possible. Promise me you'll do all your research before you ETS. My PEBLO steered me down the right path and I'll be forever grateful. \\n\\n \"}, {\"id\": \"3129d149-4550-11ea-89f2-60f6774aa532\", \"language\": \"en\", \"text\": \"My packet should be sent to the PEB by next Friday I hope.\\n\\nBeen a month now waiting.\"}, {\"id\": \"3129d14a-4550-11ea-a20c-60f6774aa532\", \"language\": \"en\", \"text\": \"What all did you claim if you don't mind me asking? I'm waiting on my NARSUM to return and I'm at day 18.\"}, {\"id\": \"316ef79b-4550-11ea-9af4-60f6774aa532\", \"language\": \"en\", \"text\": \"I recently endured an MEB / PEB as well that ended with a finding of Fit for Duty at an FPEB. I recommend going to pebforum.com if you haven't already done so.  \\n  \\nMy biggest piece of advice is to know what outcome you want from the board ASAP so that when you fill out your paperwork and go through your evaluation appointments, you can inform your physicians and your PEBLO so that they can help you build whatever narrative favors your desired outcome.\"}, {\"id\": \"316ef79c-4550-11ea-ab60-60f6774aa532\", \"language\": \"en\", \"text\": \"I appreciate this (Thanks for taking the time), and questions like /u/randomguy1411 has.  These threads with recent experiences on topics that are always of interest (MEB being one) make for great localized resources on the subreddit.  I often refer people to such threads -- such as Glencrakken's write up about going Reserves to Active.\\n\\nAppreciate you keeping us updated.\"}, {\"id\": \"316ef79d-4550-11ea-89b6-60f6774aa532\", \"language\": \"en\", \"text\": \"[deleted]\"}, {\"id\": \"316ef79f-4550-11ea-bea1-60f6774aa532\", \"language\": \"en\", \"text\": \"I went through the MEB process for back as well. I was retired and so on. The absolute best advice I can give you is, get in contact with an AW2 advocate. They are they ONLY people that seem to know how things work. People along the process will tell you all sorts of incorrect info. They are well meaning but it only confuses the process. \"}, {\"id\": \"316ef7a1-4550-11ea-9590-60f6774aa532\", \"language\": \"en\", \"text\": \"If an MEB has been initiated and the SM wants out, he/she is getting out. It's just a formality at that point. Now you might get <30% which is not ideal, but they're not going to turn around and say you're fit for duty once the MEB has been initiated unless you make it very clear that that's what you want AND you're not totally broken. He'll be given an opportunity to list every ailment he feels was caused by his time in service with the PEBLO and then they will assign a third party doctor to examine those issues. What that doc says will determine the rating. Whatever his commander said will have way less to do with what the PEB ultimately determines. When I went through the process I had a new commander take over about two weeks or so before my MEB was initiated. His written statement couldn't have been more than a sentence or two long. \\n\\nThis is anecdotal evidence but in every case I saw while I was going through the process, if the SM wanted to stay in all they had to do was say so to the peblo and they'd kick them back and cancel the MEB. However, in the three cases where I saw that, the SM was looking at <30% for sure. If you're truly broken it may be a tougher task to convince them to cancel the MEB. \\n\\nAs far as a timeframe goes, I went through mine back in 2012 in Ft. Lewis. If I remember correctly it was ten months from the date my PA initiated the MEB until I signed out. I didn't appeal anything and I only claimed two things with the doctor. Unless they've made the process a lot more efficient I would say it's going to be minimum eight months and up to two years if you appeal and fight for every last % point. \\n\\nIf you dig deep into pebforum.com you can find a PDF document that lists just about every possible injury you can have and what range of percentages the PEB will assign for that injury. I know two of my buddies got med boarded for their back and it's one of the widest ranges so there's definitely going to be some room for you to appeal unless you get \\\"lucky\\\" and get like 70% of whatever the max for back injuries is. \\n\"}, {\"id\": \"316ef7a5-4550-11ea-a00a-60f6774aa532\", \"language\": \"en\", \"text\": \"This is the Profile's free text copypasta:\\n\\nAlong with no APFT events or load bearing, no >20lbs carry, no body armor longer than 30min...\\n\\n> Profile created per Civ provider's, Dr. XXX, recommendation dated 06/2X/2016 of no Deployment, no move, no PCS for continued care with undetermined return to full duty date or\\ncondition prognosis.\\nRESTRICTED: No running, jumping, or Military Movement Drills.\\nNo combatives.\\nConditioning Drill 1: No Power Jump or V-Up.\\nNo Heel Hook or Leg Tuck.\\nLoad bearing: No foot march or movements with body-armor/ruck.\\nNo standing in gear or in formation > 30 min.\\nWalk at own pace and distance not to exceed 30 minutes. Must be able to maintain 3 mph without pain or limp, otherwise must use Endurance Training Machine.\\nMODIFIED*: Preparation Drill, Conditioning Drill 1 (Mountain Climber, Leg Tuck and Twist, Modified Push-Up).\\nPush-Up/Sit-Up Drill: May perform crunches.\\nStrength Training Machines/ Free Weight Training: at own weight and tolerance**.\\nEndurance Training Machines: Elliptical.\\nSwim at own tolerance***.\\nClimbing Drill 1 (Straight-Arm Pull, Pull-Up, Alternating Grip Pull-Up).\\n4 for the Core, Hip Stability Drill, Recovery Drill.\\nSTANDARD: Preparation Drill: Forward Lunge.\\nShoulder Stability Drill.\\nEndurance Training Machines: Bike, Upper Body Cycle.\\nRecovery Drill: Overhead Arm Pull.\\n*Soldier may modify these activities and the movements required to reach the starting position in accordance with Ch 6, FM 7-22.\\n**When performing Strength Training, must ensure that the position or movement does not strain the spine\\n***May participate in approved aquatic rehabilitation program.\\nClimbing Drill: must execute caution when mounting and dismounting the bar; if spotters are not able to safely assist or if the Soldier has to jump down to the ground, this activity should be\\nrestricted and not performed.\\nSoldier will be placed in Level 1 (gym-based) or Level 2 Reconditioning Program according to entry and exit criteria in Ch 6, FM 7-22.\\nAdditional Physical Readiness Training RESTRICTIONS:\\nNo Guerrilla Drill\\nNo Obstacle Course\\nNo Conditioning Drill 2 and 3\"}, {\"id\": \"316ef7a6-4550-11ea-a1b6-60f6774aa532\", \"language\": \"en\", \"text\": \"Could you by chance compile a general list of what documents are required to have for this process? I'm jut starting my MEB and want to have my ducks in a row before going too far in and needing to backtrack. \\nThank you!\"}, {\"id\": \"31ae32c3-4550-11ea-9ff0-60f6774aa532\", \"language\": \"en\", \"text\": \"This might sound like an odd suggestion.  Try reading a book called 7 Habits of Highly Effective People.  It really helped me take a new perspective of life and situations.   \\n\\n\\n\"}, {\"id\": \"31ae59b9-4550-11ea-978a-60f6774aa532\", \"language\": \"en\", \"text\": \"I will inbox you my number if you need to talk man.. call anytime of the day or night..\"}, {\"id\": \"31ae59ba-4550-11ea-bbb6-60f6774aa532\", \"language\": \"en\", \"text\": \"Talk to the veterans hotline , or someone you trust. Chaplain, pastor, etc. Get help if you need it \"}, {\"id\": \"31ae59bb-4550-11ea-8549-60f6774aa532\", \"language\": \"en\", \"text\": \"What's a \\\"non-combat zone in Afghanistan\\\"? \\n\\nThat aside go get the help you need. \"}, {\"id\": \"31ae59bd-4550-11ea-a685-60f6774aa532\", \"language\": \"en\", \"text\": \"You really need a therapist. Some of the anxiety stuff you describe reminds me of a time when I suffered from social anxiety some years ago. I know, talking to people and seeing them on a regular basis is really hard right now. You probably feel them making judgments on you even though it's not happening. The lack of sleep, sex drive, and the loss of interest in the upkeep of your home and yourself is most likely you being very depressed. You've also got some very serious paranoia issues you're dealing with. If I were you, I would leave your weapons with someone you can trust. Maybe lock them up in a chest and leave it with your dad. With these types of issues, you might have an episode with a stranger catching you off guard at your business or in public. Perhaps you could talk to someone first and work up the nerve to make an appointment with a therapist. I'm not saying all of these problems will be solved instantly, but they help you understand why this all happening and what you could do to control it.\"}, {\"id\": \"31ae59be-4550-11ea-a603-60f6774aa532\", \"language\": \"en\", \"text\": \"Lots of good ideas in the other comments. You really need to get to the VA ASAP. it's going to take some time to get better, in the meantime you should get yourself a dog. \"}, {\"id\": \"31ae59bf-4550-11ea-8a1e-60f6774aa532\", \"language\": \"en\", \"text\": \"Seek professional help. Do not wait any longer. You cannot keep trying to go through this alone. Hotline, priest, VA doctor, non VA doctor, AA sponser...whatever and whoever...find a trained and licensed mental health professional and start a dialogue. Anything is better than nothing. You have a history of substance abuse. You have ignored the concerns of your friends and family. You've got a wall of text here that includes textbook symptoms. When it comes down to it, if you don't do anything to improve your situation then you're actually fine with how you feel. It's time to be honest with yourself. You need to take action and gain some self respect. Keep your chin up man. The world is what you make of it.\"}, {\"id\": \"31ae59c0-4550-11ea-86cf-60f6774aa532\", \"language\": \"en\", \"text\": \">What if I do qualify for military compensation but it\\u2019s like only 10%\\n\\nI don't think this benefit should be your main goal.  Instead, the main goal should be to work with a therapist to change how your brain is processing all the information it receives.  If you can make this change, then you be successful in a working environment and be proud to earn 100% of your income, and never need the VA disability program.  \\n\\nFocus on the therapy and the outcome.  Also, you might consider asking a doctor to prescribe one of those take-home sleep apnea tests.  You wear it at night for about a week, and it measures your sleep patterns.  Sleep deprivation can cause a laundry list of problems.  \\n\\nRegarding the girl, sometimes you're just not that into her.  She could be really beautiful, but if sparks don't fly, then the chemistry is off.  Heal thyself, worry about girls later.  \"}, {\"id\": \"31ae59c1-4550-11ea-a43f-60f6774aa532\", \"language\": \"en\", \"text\": \">I usually get only 5-6 hours of sleep a night and wake up as many as 4 times sometimes during the night; other days I am fine. When I wake up, sometimes I forget to breathe, then my adrenaline kicks in and I sit up instantly breathing in quick short and shallow bursts. I am trembling. It doesn\\u2019t last long, less than a minute, as I convince myself to breath heavy deep breathes to control myself.\\n\\nThis sounds like acute sleep apnea.\\n\\nhttp://en.m.wikipedia.org/wiki/Sleep_apnea\\n\\nSleep apnea can cause a wide range of behavioral and psychological issues through a physiological anxiety response and lack of sleep. Basically you stop breathing in the middle of the night, your body and mind freak out thinking you're suffocating. Most of the physiological and psychological states you're experiencing, including anxiety, fatigue, listlessness/lack of motivation, unnecessary fear response, can be attributed to  a lack of REM sleep.\\n\\nI would get a test done, which generally includes sleeping overnight at a lab or hospital. Treating it is easy.\\n\\nGood luck, and I hope you find relief soon.\"}, {\"id\": \"31ae59c3-4550-11ea-b587-60f6774aa532\", \"language\": \"en\", \"text\": \"Thank you for sharing your experiences and feelings. I read all of it.\\n\\nI'm concerned about your suicidal thoughts. Obviously you are concerned too, or you wouldn't have made this post. It doesn't mean you're crazy, but it does mean you have problems on your mind and you're thinking about it. This is called suicidal ideation.\\n\\nDon't try to \\\"handle it yourself.\\\" *Call the Veterans Crisis Line at 1-800-273-8255 and Press 1.* It's free, and you can talk to some people who will connect you to resources to help you out. You're still part of a larger family of veterans, and we have resources to help you.\\n\\nYou can also call 1-800-273-TALK (8255) to talk to someone else, but they won't be necessarily experienced in veterans issues.\\n\\nEven though you were in a non-combat role, you probably had your share of rocket attacks and indirect fire at KAF. Plus other stresses come from garrison life, such as having to live in a space with scummy thief roommates. The stress and BS of Army life takes a toll. Did you know that the highest rate of suicide is among junior soldiers who never deployed?\\n\\nThe reality is that many people share your feelings. I encourage you to call the hotlines above and get some help. Also, Military One Source offers a certain number of free counseling sessions.\\n\\nResolve to call a provider about your feelings today. I had suicidal feelings at age 15, and I never, ever shared that with anyone. I was dangerously close to doing something stupid. I'm about to turn 30 in a week, and that time is so, so far behind me now. I'm celebrating my birthday with a loving wife while on vacation in a beautiful foreign country. Life does get better. Every day gets better. But you have to act and do your part to make it better. Call the hotline.\"}]}"