"{\"documents\": [{\"id\": \"0ce622dc-4550-11ea-92f3-60f6774aa532\", \"language\": \"en\", \"text\": \"So... this shit is happening, for obvious reasons a lot of people still don't think it is real but, the NSN for equipment is in FEDLOG so, game over folks.\\n\\n\\nAnyway, more seriously, feel free to move this if fits better somewhere else.  \\n\\n\\nSelf Intro(Feel free to skip): I am SSG So&So, in a Support Maint. Co. and I prefer pronouns he/him/his. 16 years guard, 1 \\\"deployment\\\" as shop NCOIC at Buehring, Federal Technician in ELM shop, currently 94F30F1 (Also 92A, 91G, 74D), new age hybrid who wrestled, played football and basketball, ran track, does warrior competitions, etc... but also scored a 99 on ASVAB lowest line score MM: 126, loves anime, comics, videos games, spends 60+ hours a week on my $6,000 PC, etc.  I am the leader of my units nerd herd, but also a jock... I don't know what box I fit in, so feel free to cram me into whatever.  Intro over.\\n\\n\\nInfo/Background(again feel free to skip to \\\"Meat and Potatoes\\\") :\\nI have been tracking the ACFT since mid 2000's when the Army first started looking to replace the APFT.  Was excited about APRT/ACRT from 2010's, then APRT got scrapped for safety, and ACRT for cost.  They went back to the drawing board, and eventually in 2016 there was whispers of a new test the Army Combat Readiness Test.  I was excited again, when the first draft of proposed standards came out, I download, printed and passed around stating \\\"This is happening guys\\\" as everyone told me \\\"No chance\\\"\\nhttps://drive.google.com/file/d/0BxFF0w68yhRvZy12SDNFVExPUjQ/view\\n\\n\\nThey eventually changed a few things, the maximums came down, the minimums changed, 3 tiers were added, events were slightly altered, the name was changed to Army Combat Fitness Test, alternate exercises were proposed and we have arrived to where we are now.\\n\\n\\nMeat and Potatoes : My state sent some guys to Eustis to become level III certified, they came home and started moving around the state doing level II certifications.  You MUST have a level II to conduct the ACFT as NCOIC.  I recently attended their first class and thought I would come on here and attempt to pass on as much as I could as A LOT of people are in denial about the ACFT and levels of knowledge is low IRL and online.\\n\\n\\nA lot of information, IE equipment specs, scores, event, are on the .mil website, so in general I will not be covering that kind of stuff.  If you have questions I will try my best to answer them, and possibly update this thread as info changes.\\nhttps://www.army.mil/acft/\\n\\n\\nSome of the information i'll provide is not in any Reg or info available, it is being taught at Eustis, so if everyone is taught at Eustis you might see some grading differences at schools than home station, I will try and denote these as I go.\\n\\n\\nArmy Combat Fitness Test Requirements : \\n2.5M X 40M, per lane, of well manicured grass or turf (40X40 for 16 lanes)- to conduct the ACFT the grass can be moist(morning dew) but not wet(rain).  Should be free of hazards, NCOIC should walk each lane for safety.\\nTwo Mile looped or down and back course - no more straight shots\\nRequired equipment - On the .mil\\nOne NCOIC(Cert II+), and One grader(Cert I) for every 4 testers.\\n\\n\\nACFT \\\"Side Stuff\\\" : For time purposes, 4 testers per grader essentially means 4 people can take the test at a time per lane that you have.  So if you have 16 lanes you can evaluate 64 people in 1 test, 8 lanes 32 people, etc.  If you have more people that you can test in 1 shot you generally have 3 options.  If you have enough graders, then you can start a 2nd group while the first group is doing Pushups and they'll be staggered slightly behind.  If you are limited on graders, you can start a 2nd group after first finished, or on a different day.  Testers CAN NOT touch anything during setup, if they want to move up on deadlift they go to another lane or GRADER changes the weights.  The test goes surprisingly fast cause only 4 people per \\\"line\\\".  It is also at it's EASIEST in a group.  Rest between events as of now is 2min-3min-3min-4min-5min, this is the MINIMUM rest and only applies if testing 1-2 soldiers, otherwise your rest is how long it takes to be your turn for the next event (If everyone runs 3:30 on SDC your rest is 11-12min for LTK).\\n\\n\\nACFT Scoring : As of right now, your category is determined by your MOS's Physical Demand Rating.  These can easily be found\\nHere : https://apftscore.com/acft.php\\nHowever... your commander can also fill out a DA Form whatever(TBD?) to set a unit wide standard for his soldiers.\\nSo... In my shop(FedTech side) is another 94F, he is in an airborne SF unit.  If we go to NCOES together, we have the same standard, but once back home I am Moderate(Gold) and he is Heavy(Black).\\n\\n\\nThe actual Test : All soldiers will be expected to review the ACFT regulations 48 hours before test, so there is almost no \\\"reading\\\" for the NCOIC anymore.  A grader will run all testers through the Preparation drills, then everyone will have 10 minutes to warm up for the deadlift.  It is suggest you work up to ~65% \"}, {\"id\": \"245b3bdb-4550-11ea-a49f-60f6774aa532\", \"language\": \"en\", \"text\": \"The ACFT is 2 years away and while there may be adjustments, I think it would in my best interest to start preparing now. I currently run, do sit ups, push ups, and ruck regularly and that's done me just fine in my ARNG career so far. That's clearly not going to be cutting it anymore. I have access to a regular gym, but I do not have a place where I can practice the power throw, sled drag, kettle bell carry, or leg tuck (my gym only has handle bar pull up areas). And I do not forsee any place where I practice the ACFT as a continuous event.\\n\\n**Let's pretend I have access to 0 equipment but I have access to a track/football field and 2 hours a day for the next 2 years. Not ideal but I imagine that many ARNG/USAR soldiers will be in this position. What body weight exercises will best prepare me for each event?**\\n\\nFor reference:\\n\\nTrapbar deadlift\\n\\nStanding power throw with 10 pound medicine ball\\n\\n50m sprint, 50m 90lb sled drag, 50m laterals, 50m 2-40lb kettlebell carry, 50m sprint\\n\\nLeg tuck on straight pull up bar\\n\\n2 mile run\"}, {\"id\": \"24b9816a-4550-11ea-b5de-60f6774aa532\", \"language\": \"en\", \"text\": \"  \\n\\n2. FRAGORD 1 TO TRADOC TASKORD IN191691- REDISTRIBUTION OF ARMY COMBAT FITNESS TEST (ACFT) EQUIPMENT. This TRADOC FRAGORD advises that The Center for Initial Military Training (CIMT) has initiated the redistribution of Army Combat Fitness Test (ACFT) equipment throughout the Initial Military Training (IMT) Enterprise in order to start full implementation of the ACFT NLT 01 October 2019 (FY20) at all Army Training Centers (ATCs), Centers of Excellence and Proponent Schools. This will set the conditions for the ACFT in the Operational Force beginning in FY21. The IMT Enterprise (IMT ONLY) will implement the ACFT as the test of record for all training courses that start on or after 1 October 2019 (FY20) to include Basic Combat Training (BCT), Advanced Individual Training (AIT), One Station Unit Training (OSUT), Basic Officer Leader Course-Branch (BOLC-B), and Warrant Officer Basic Course (WOBC). https://www.milsuite.mil/book/docs/DOC-670764\"}, {\"id\": \"254c9c7a-4550-11ea-93e5-60f6774aa532\", \"language\": \"en\", \"text\": \"Revolutionary War through the Civil War: Walk for days without dying.  Death means you failed.\\n\\nPost Civil War (Officers and Cadets only) to 1906: \\n\\n> 15' Wall climb (no rope or other equipment)\\n\\n> 60\\\" saddle vault (running leap into a saddle)\\n\\n> 8 minute mile run\\n\\n> 10' Running long broad jump \\n\\n> 3 mile ruck march in full kit 60 minute time limit\\n\\n> Swim test (lots of conflicting information about it. Some sources say there was no swim requirement, others say 45 second breath hold at the bottom of the pool or 25y submerged swim).\\n\\n1906 to 1920:\\n\\n> Individual regiments were required to implement a physical fitness test that could be administered weekly and at a minimum would contain a 12 mile ruck march in full kit over rough terrain for foot troops and 18 miles for cavalry in 3 hours .  \\n\\n> An annual 45 mile 3 day ruck was required for foot troops, and a 3 day 90 mile ride was required for cavalry.\\n\\n1920 to 1941 (the World War One Individual Efficiency Test):\\n\\n> 100m dash (minimum time 14 seconds)\\n\\n> 12' running broad jump\\n\\n> 8' Wall climb (no rope or other equipment)\\n\\n> 30y grenade toss for distance and accuracy\\n\\n> Obstacle course (left to the individual regiments to design)\\n\\nFollowing the end of WW1, fitness testing was again turned back over to the individual regiments, though on paper they were required to complete the IET annually.  There is a lot of debate around whether that happened or not. A lot of historians argue that a lack of fitness was a key factor in the US's initial difficulties in WW2.\\n\\n1941 to 1942 the Fitness Performance Test \\n\\n> 100m dash (minimum time 14 seconds)\\n\\n> 4' Running High Jump\\n\\n> 12' Running broad jump\\n\\n> 20 Push Ups\\n\\n1942 - 1950 \\n\\n> squat jumps\\n\\n> wide leg sit-ups\\n\\n> pull-ups\\n\\n> push-ups\\n\\n> 300-yard shuttle run\\n\\nWhile the test was scored, there was no pass or fail.  Lower scores kept you from being promoted, kept out of elite units, and as a result many lower scoring individuals who lacked a specialized skill set found themselves in combat faster than those with high scores who received additional training.\\n\\n1950 to 1961\\n\\n> Army publishes official requirements for combat and non-combat units, updates scoring, and adds four events for combat units\\n\\n> 75y Dash in 12 seconds\\n\\n> Triple Jump 15'\\n\\n> 5 second rope climb for distance 10' minimum\\n\\n> 8 minute mile run\\n\\n1961 to 1980\\n\\n> 40y low crawl \\n\\n> 20' horizontal ladder\\n\\n> grenade throw \\n\\n> Agility Run\\n\\n> 1-mile run\\n\\nThese events were conducted in boots, pants, and t-shirt.\\n\\nI know I said this test lasted until 1980...but things got a little crazy in the 70's.  There was almost a return to the Regimental fitness test model of the pre-World War One days.  \\n\\nThere were lawsuits launched against the military claiming some of the tests were racist (Army SOF had a swim test requirement, that many felt was aimed to keep African Americans out) or sexist (uniform scoring standards regardless of sex).\\n\\n1980 to 2020\\n\\n> 2 minutes of push-ups\\n\\n> 2 minutes of sit-ups\\n\\n> 2 mile run\\n\\nThis test, born in peace time and in an age of dawning political correctness, was easy and cheap to administer.  That it is a poor indicator of battlefield performance was largely secondary to it being cheap and easy.  \\n\\nFor all that snark, it did establish a fairly uniform minimum fitness requirement, with the truth being if you were focused on general fitness and being combat effective, you would crush this test without training for it.  \\n\\nUnfortunately, the focus became on teaching to the test and it showed on the post September 11th battlefields.\\n\\nIn 2003 some units adopted the Upper Body Round Robin (UBRR) test for their order of merit list.  There was a push in the SOF and Ranger communities to adopt it as a formal test, replacing the APFT.\\n\\n>1 minute of push-ups\\n\\n>1 minute of sit-ups\\n\\n>AMRAP pull-ups\\n\\n>AMRAP dips\\n\\n>AMRAP bench press 80% of body weight\\n\\n>20' rope climb in 20# vest\\n\\n>1 min heel hooks\\n\\n>4x25m shuttle sprint\\n\\n>5 mile run or 5 mile ruck\\n\\nCiting the high risk of injury to shoulders and the equipment requirements, the Army declined to formally authorize the UBRR.\\n\\nIn 2010 the Army Physical Readiness Test was proposed.  It consisted of:\\n\\n> standing long jump\\n\\n> 1-minute of rowers (replaced sit-ups, not a rowing machine)\\n\\n> 60-yard block shuttle run (down and back picking up and putting down blocks)\\n\\n> 1.5 mile run\\n\\nIn 2012 the Army backed away from the proposed changes, and I have yet to really figure out why.\\n\\n2020 to ????? The Army Combat Fitness Test\\n\\nArmy Combat Fitness Test:\\n\\n> 3 Rep Hex/trap bar Deadlift (140# min)\\n\\n> Standing Power Throw (10# ball 4.5 meters)\\n\\n> T/Hand release military push-ups (10)\\n\\n> Sprint Drag Carry (3:00)\\n\\n> Leg Tuck (1)\\n\\n> 2 mile run (21:00)\\n\\nFor reference at my Reserve Unit's unofficial \\\"diagnostic\\\" I (46 yo male who scores around 225 on the APFT) scored:\\n\\nDL: 330# (97)\\n\\nSPT: 13m (100)\\n\\nT/HRP: 30 (70)\\n\\nSDC: 2:26 (66)\\n\\nLTK: 12 (84)\\n\\n2 mile run: 17:30 (73)\\n\\nTotal Points: 490 (average 82 points per event)\\n\\nObservations: \"}, {\"id\": \"25a2330d-4550-11ea-b031-60f6774aa532\", \"language\": \"en\", \"text\": \"Just took the full PT test known as Army Combat Fitness Test (ACFT) our platoon had to test it out and get the scorings to CSM, Its 6 events total \\n\\n1-Dead lift i dont know the standards on it but they had us do 180lbs And they said you can go up to get more points but it was set to 180 for us\\n\\n2-Push ups (and no its not T pushups its when you go down you lift your hands from the ground)\\n\\n3-10 lbs ball back throw (one to try it out and two attempts and they take the highest score)\\n\\n4-Sprints followed by sled pulling (forgot the weight on it) back and forth , 80 lbs kettlebells (2 40lbs kettlebells) moving back and forth, laterals back and forth and sprints again\\n\\n5-leg tuck\\n\\n6- 2 mile run\\n\\nI got to say its easy to pass but its not so easy to max the events and what can mess you up is the form like when you do the dead lift and the leg tuck i dont know if our NCOs were just making it hard or they just have no clear info on it and we were told that it will be a record starting 2020 and the scoring is MOS based so for example if you are in a combat MOS your 2 mile run is 18 mins to pass if you are in a support combat MOS its 12 mins to max and 19 mins to pass (which is my MOS) there is no age or gender standard. \\n\\nP.S\\n\\nENGLISH IS NOT MY FIRST LANGUAGE SO PLEASE PARDON MY WEAK GRAMMAR \"}, {\"id\": \"27792aa9-4550-11ea-94ed-60f6774aa532\", \"language\": \"en\", \"text\": \"So recently at drill we had a run-thru of the ACFT. I can see WHY the Army wants to push it. It really does focus on your entire body as opposed to the APFT. It is ALSO going to have the effect of forcing out a lot of older and fatter soldiers who can't keep up with some of this shit. \\n\\n&#x200B;\\n\\nI can also see a lot of soldiers injuring themselves b/c they don't properly train with weights prior to the test. You can bang out sit-ups, push-ups, and running just about anywhere. But the ACFT is gonna require you to regularly workout with weights and develop a proper form or else you'll be laid out from a back spasm b/c you carried the kettlebells wrong during the Sprint-Drag-Carry. \\n\\n&#x200B;\\n\\n&#x200B;\"}, {\"id\": \"2917f21e-4550-11ea-8a5b-60f6774aa532\", \"language\": \"en\", \"text\": \"We have been talking about the new PT test all morning. Most of the individuals I\\u2019ve talked to have a lot of grudges with it. \\n\\nThe deadlift is one main point of contention. They say it\\u2019s too dangerous and everyone will get injured. While I agree that poor form will fuck you up, I still think adding the deadlift is a step in the right direction. Deadlifting is one of the most beneficial exercises you can do. If you\\u2019re in the Army and not deadlifting, then you deserve to do to poor on this test. \\n\\nThe amount of random \\u201cfit\\u201d people who can max the current test but know fuck all about anything besides pushups, sit-ups and running is infuriating. \\n\\nAnd what the fuck is a leg tuck?? I\\u2019ve never seen that until the exercises for this test came out. Why not just do a normal hanging leg raise? \\n\\nAlso, we all know how uncoordinated Army people are so I\\u2019m just looking forward to that aspect. \\n\\nAnyways, I redeploys in less than 2 weeks  and I\\u2019ll take a double cheese burger with fries. \\n\\n\"}, {\"id\": \"2ac0b438-4550-11ea-a6df-60f6774aa532\", \"language\": \"en\", \"text\": \"So my platoon just averaged like 230 on the latest PT test... As an infantry platoon I find this unacceptable and blame both the leadership\\u2019s weak and uncreative approach to fitness and the individual soldiers who don\\u2019t pursue fitness in their free time. Naturally we are also in the field and it is difficult to have consistency as well. As a team leader who gives a fuck, I want to bring up my PLT / Squads fitness levels but need to pitch a nice structure to my PSG and PL.  I fucking hate running and Army PT like any sane person, but figured it was best to incorporate runs that would improve a 2 Mile run time instead of the usual \\u201crun from Point A to Point B in some random fucking pace/time/distance.\\u201d\\n\\n\\n\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\n\\nMonday\\n\\nMorning - Watts Field - APFT Focus\\n\\n- Run 1 Mile x 3 sets (Below 7:00)\\n\\n- 50 Pull-ups\\n\\n- 150 Push-ups\\n\\n- 150 Sit-ups\\n\\n\\nAfternoon - Gym - Leg Strength\\n\\n- Squat Pyramid (10x10)\\n\\n- Lightweight Deadlift (4x10)\\n\\n- Overheads Lunge / KB Farmer Carry (4 set)\\n\\n- Sled Push (4 x Heavy)\\n\\n- Hip Abduction / Deduction (4x10)\\n\\n- 100 Leg Lift\\n\\n- Free Lift\\n\\n\\n\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\n\\nTuesday\\n\\n\\nMorning  - Gym - Upper Body Strength\\n\\n- Bench Pyramid (10x10)\\n\\n- Incline Bench (4x10)\\n\\n- Skullcrusher / Close Grip Bench (4x10)\\n\\n- Dips / Pull-ups (50/50)\\n\\n- Cable/Machine Accessories\\n\\n- 100 Push-ups\\n\\n- 100 Sit-ups \\n\\n\\nAfternoon - Gym - Recovery\\n\\n- Slow Bike 20min\\n\\n- Rollout Muscles\\n\\n- Stretch\\n\\n\\n\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\n\\nWednesday\\n\\n\\nMorning - Stoneman Track - Speed\\n\\n- 60/120 Sprints (8 Rounds)\\n\\n- 100 Push-ups\\n\\n- 100 Sit-ups\\n\\n\\nAfternoon - Gym - Back Strength\\n\\n- Deadlift Pyramid (10x10)\\n\\n- Barbell Row (5x10)\\n\\n- 50 Pull-ups\\n\\n- 50 Toe-to-Bar\\n\\n- Farmer Carry (4 Rounds)\\n\\n- Cable Pulls (5x10)\\n\\n- Free Lift\\n\\n\\n\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\n\\nThursday\\n\\n\\nMorning - Motor Pool - Combat PT - 6 Mile Tactical Movement\\n\\n\\n-Slow tactical movement to yellow gate. 50lb  Ruck, Weapons, and TAPS. Utilize the local terrain to rehearse fundamental skills and SOP.\\n\\n\\nRehearsals:\\n\\n-Staggered Column discipline\\n\\n-Team Wedge discipline\\n\\n-Crossing LDA SOP \\n\\n-Clearing OBJ SOP\\n\\n-Suc/Alt Bounding rehearsal\\n\\n-Emplacing Security / SBF / Sectors of Fire\\n\\n-React to Contact\\n\\n-React to Ambush\\n\\n-Ready-Ups utilizing PEQ\\n\\n\\n\\nAfternoon - Gym - Shoulder Stability/Strength\\n\\n- Overhead Press (5x10)\\n\\n- 50 Pull-ups\\n\\n- Overhead Walk (6 sets)\\n\\n- Heavy Farmers Carry (6 sets)\\n\\n- Delt Raises (4x10)\\n\\n- Shoulder Rotations\\n\\n- 100 Push-ups\\n\\n- 100 Sit-ups \\n\\n- Free Lift\\n\\n\\n\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\n\\nFriday\\n\\n\\nMorning - Stoneman Track - Aerobic/Speed\\n\\n- 400m Warmup\\n\\n- 100m Race x 4\\n\\n- 200m Race x 4\\n\\n- 400m Race x 4\\n\\n- 800m Cooldown \\n\\n- 100 Push-ups \\n\\n- 100 Sit-ups\\n\\n\\nAfternoon - Gym - Recovery\\n\\n- Slow Bike 20m\\n\\n- Rollout Muscles\\n\\n- Stretch\\n\\n\\n\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\n\\nSaturday (Optional)\\n\\n\\nShakeout Run (3-5miles) and Free Lift \\n\\n\\n\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\n\\nSunday\\n\\nRecovery\\n\\n\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\\u2014\"}, {\"id\": \"2b1830a5-4550-11ea-9f40-60f6774aa532\", \"language\": \"en\", \"text\": \"https://www.armytimes.com/news/your-army/2019/01/24/a-better-safer-less-expensive-alternative-to-the-new-army-pt-test/\\n\\nThoughts? \\n\\nMy biggest concerns for the ACFT would be \\n\\n1) the deadlift. Form is critical and half assed training could result in a slew of injuries. Trap bar helps because it's more natural mechanically but still easy for a joe to f* himself up.\\n\\n2) the leg tuck. I dont feel it accurately represents a motion a soldier would do. If anything it should be a full swing up to touch ankles over the bar as if they were prepping to shimmy down a rope.\\n\\n3) the medicine ball throw is just plain silly. \\n\\n4)  release pushups. Not everyone will have this issue but i personally find it to be an awkward ROM that puts more torque of my shoulders than normal PU's\\n\\n5) cost of equipment and speed with the test can be administered. The quoted times to complete the test for a full unit just dont seem realistic to me unless you have a fuckton of equipment and graders and spend a bunch of time setting up beforehand. \"}, {\"id\": \"2b712612-4550-11ea-89a5-60f6774aa532\", \"language\": \"en\", \"text\": \"Some of the more common complaints I see against it are always \\\"it's too expensive to buy all the equipment for it\\\"; \\\"it's gonna cause a lot of injuries\\\"; \\\"it's too complicated\\\" etc.\\n\\n&#x200B;\\n\\nAs far as it being too expensive, people overinflate the costs of the equipment. You can make it work with a trap bar, 350lbs of weights, a pull-up bar (which literally every PT field ever has nowadays), a sled and two kettlebells, and a 10lb ball. I'm almost positive that it costs more to train one soldier through BCT alone than it does to gear up an entire company for the ACFT. Now how many shitbags that can't pass their PT test do you think are on average in each company, hm? As far as injuries go, this one is partly true. If proper form is taught and implemented, the only exercise I could really see where people would fuck themselves up would be trying to egolift on the DL. But here's a harsh truth of human physiology: if you push your body's strength to its limits (which is what a PT test should measure), the risk of injury is higher. Doing 5000 pushups in 25 seconds isn't an accurate measure of one's strength. The test being too complicated is one of the dumbest complaints I've heard though. As complicated as it is, it is still in no way a perfectly accurate measure of one's expected performance during a combat scenario, simply because the variables are too high. But I'll tell you what, it's a perfect compromise between complexity and realism. Showing you're able to perform high intensity tasks like the ones in the ACFT in quick succession and to standard will more than likely mean you'll be able to perform when called upon in the battlefield, especially with adrenaline rushing and whatnot.\\n\\n&#x200B;\\n\\nNow, let's talk about why I like it. What the hell happened to one army one standard? That 110lb chick from my platoon that can knock a 350 on her PT test might be a stud in the eyes of my PSG, she wouldn't be my first pick for who I'd want pulling my 190lbs ass (plus all my gear, probably closer to 300) out of a burning M109. The current PT test does not in any way reflect an accurate measure of one's ability in combat, and it's absolutely dumb that the highest PT score I've ever managed was when I weighed the least and was the weakest. This new PT test not only weeds out all the 120lbs cross-country types from the critical MOSes where their 300 PT scores won't mean shit, but it also implements different standards depending on the likelihood that your physical fitness will be a requirement in the mission. What this does is it gives the army an even larger pool of possible soldiers that may be excellent at desk job MOSes but couldn't be bothered to knock down their run to a 15:35 or do 42 pushups. Sure, a 22 minute 2-mile is ridiculously easy to get, but the actual MOS will more than likely not involve you rucking 50 miles with 100lbs of gear to save PVT Ryan.\\n\\n&#x200B;\\n\\nAs far as the injuries issue goes, Army has an issue in general with the way profiles are handled and the fact that permanent profiles even exist, but that's a can of worms on its own. That being said, from what I hear, they're planning on doing something about it where you can be separated if you're unable to regain a green deployment status.\"}, {\"id\": \"2bd6bf67-4550-11ea-8048-60f6774aa532\", \"language\": \"en\", \"text\": \"If Based SMA Dailey and General Milley gave you full authority in creating the next APFT, what would your ideal version look like?\\n\\nFor me, I'd keep the current APFT and standards, but add in additional exercises to be tested on a rotational basis.\\n\\nFor example, on APFT day, you do the PU/SU/2mile, followed by any two of the following: \\n\\n* Bench Press (X% of bodyweight for X reps)\\n\\n* Squat/Leg Press (Same)\\n\\n* Sprints (X distance in X time for X reps)\\n\\n* Rope Climb (Pass/fail)\\n\\n* 4-6 Mile Ruck (15min pace)\\n\\n* Farmers Carry (X Weight for X Distance)\\n\\n* Balance Beam?? (Distance only, pass/fail)\\n\\nI'm not sure about the balance beam thing. Balance is obviously important but i'm not sure how to test it.\"}, {\"id\": \"2ca7af77-4550-11ea-bb53-60f6774aa532\", \"language\": \"en\", \"text\": \"This post is dedicated to teaching you things the Army should teach you\\u2026but doesn\\u2019t. The Army LOVES to teach you all kinds of lame things like SHARP, Information Awareness, Cyber Awareness, and AT Level 1, but is TERRIBLE at teaching actual useful things like money, health, and fitness.\\n\\nFirst piece of advice is don\\u2019t be like either of these airsoft posers\\u2026 one has four chins and the other ***forgot to put a magazine in his weapon***.First rule of thumb is that OPSCORE does not = automatic baller status.\\n\\n[Airsoft Posers](https://i.redd.it/421b372piny01.jpg)\\n\\nNow that\\u2019s out of the way, we can move on to more important things. The military loves its silly acronyms, but one that I hate hearing aloud but loving seeing enforced is putting the Bottom Line; Up Front \\\\(BLUF\\\\). If you are like me, you hate having to dig for information, and especially hate writers who bury the point of their article under a thousand fluffy words. For that reason, I structure my articles in the BLUF format.\\n\\nSome people don\\u2019t care about details and shit; they just want to be given a recommendation. This post is simply a list of my personal recommendations to get a new freedom\\\\-loving, door\\\\-kicker on the \\u201cgainz\\u201d train to success. If you are currently sitting in your company day room on your phone \\\"waiting for the word\\\" on a Friday, this post is for you.\\n\\n## Money\\n\\n>Nothing is more eye opening then discovering you could end world hunger based off your wife\\u2019s spending habits at Starbucks\\n\\n1. **Read** ***If You Can: How Millennials Can Get Rich Slowly*** by Dr. William Bernstein. Make your wife read it. Then make your kids read it. Then read it again whenever you feel like you are screwing up financially. You can download it free [here.](https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&uact=8&ved=0ahUKEwj9qeDI9qjYAhUI9IMKHSbLDLsQFggpMAA&url=https%3A%2F%2Fwww.etf.com%2Fdocs%2FIfYouCan.pdf&usg=AOvVaw25wxjcA_8Pzo-SB3S580I5)\\n2. **Figure out your no\\\\-shit compensation package \\\\(direct & indirect\\\\).** So many young soldiers know their base pay and nothing else. Log\\\\-in to your\\u00a0[MyPay](https://mypay.dfas.mil/)\\u00a0and print out your Personal Statement of Military Compensation. This  document breaks down ALL compensation the military gives you, both *direct*: Base Pay, BAS, Special Pay, Bonuses, Housing, etc. and just as important, *indirect*: Pension, SGLI, Tricare, Dental, GI\\\\-Bill, Tuition\\u2019s Assistance, etc. This way, you won\\u2019t be surprised when you get out of the army and discover you actually have to pay to get your teeth fixed.\\n3. **Track your spending.**  If you don\\u2019t know where your money goes, you will not be able to make adjustments. Nothing is more eye opening then discovering you could end world hunger based off your wife\\u2019s spending habits at Starbucks. This is actually pretty easy. You don\\u2019t have to save all your receipts and you don\\u2019t need to create the mother of all  spreadsheets in Microsoft Excel. I recommend [www.mint.com](http://www.mint.com/) \\\\(or something similar\\\\). It\\u2019s free, simple to use, will track all your accounts, and will automatically create categorical graphs of your spending.\\n4. **Make a general budget.**  This makes some people cringe \\\\(including me\\\\). The key word is \\u201cgeneral\\u201d. It doesn\\u2019t have to be \\u201cwe will spend only $226.23 on groceries every month or we\\u2019ll die poor.\\u201d Take baby steps by budgeting your money into broad categories such as Housing, Transportation,  Food/Groceries, Entertainment, Retirement/Savings, Debt repayment, etc.  Once again, I recommend using\\u00a0[www.mint.com](http://www.mint.com/).\\n5. **Start investing in your Thrift Savings Plan immediately \\\\(like yesterday\\\\).**\\u00a0\\u00a0I don\\u2019t care if it\\u2019s 3&#37;, 5&#37; or 15&#37;. Obviously more is always better, but  just start investing SOMETHING!  If you already invest in the TSP but your money is sitting in the G Fund, go switch it RIGHT NOW! The system will automatically invest your money in the G Fund. DO NOT make the mistake I did and leave your money  stagnating the G Fund for over 7 years because you didn\\u2019t know better. Allocate your TSP allotment into the Roth option of the I\\\\-Fund, C\\\\-Fund, or L\\\\-Fund \\\\(or combination of all three\\\\) since you have a long time until you reach your 60\\u2019s. This is something you won\\u2019t care about now, because you are young and going to live forever. However, I guarantee you one day you will care, and you don\\u2019t want that time to be when you\\u2019re 35.  When you\\u2019re young is absolutely the most critical time to start  investing in your retirement because #compoundinterest and  #nodependents. Check out [this article](http://www.yourewelcome.blog/2018/04/23/difference-between-tsp-funds/) for simple, stupid advice on how to use your TSP.\\n6. **Use your GI Bill.**\\u00a0I am constantly blown away by how many soldiers get out of the army and don\\u2019t use this amazing benefit. If you don\\u2019t want or need to use it, stay in at least 10 years and give it to your spouse or kids.\\u00a0 If you don\\u2019t, you are literally pissing away bet\"}, {\"id\": \"2d83f5bb-4550-11ea-9939-60f6774aa532\", \"language\": \"en\", \"text\": \"[How to Workout like an Operator](https://youtu.be/1XlH7as17tc) (jk)\\n\\nIn the words of [Mat Best](https://www.youtube.com/channel/UCre2GibO9Vdb3C59VzDsFxQ), it\\u2019s scientifically proven that beards help you lift more weight.   However, since the vast majority of you won\\u2019t be allowed to grow beards, I guess you\\u2019ll have to settle for this post.\\n\\nIf  you were to watch any AFN commercial, you might think the Army exists for safety, SHARP, and PT belts\\u2026 WRONG! The army exists for one  reason and one reason only\\u2026to defeat the enemies of our nation and destroy those who wish to do us harm. You (a soldier) are an integral  part of that mission. You are either a) shooting some bad guy in the face or b) enabling the guy who shoots the bad guy in the face. If you aren\\u2019t  comfortable with that, join the [Peace Corps](https://www.peacecorps.gov/apply/).\\n\\n## BLUF:\\n\\n**Your \\u201csport\\u201d is combat** Combat requires [power, speed, and endurance](https://powerspeedendurance.com/).  Power allows you to move heavy things, speed determines how quickly you can do it, and endurance determines how long you can sustain it.\\n\\n**Your body is your primary weapon.**  If you are [unfit or injured](https://www.mobilitywod.com/), you are a liability to your unit, not an asset.\\n\\n**You are a professional athlete.** Professional athletes use their bodies to earn a living. Active duty Soldiers are [professional military athletes](http://mtntactical.com/fitness/military-athlete/). You are paid to work out for at least 1.5 hours every day. Your paycheck not only depends upon your fitness, but so does your combat  performance and survivability.\\n\\n**Run less, but faster!** If you are still running the same pace you ran 4 years ago, it\\u2019s time  to drastically cut the mileage and increase your speed, effort, and  recovery.\\n\\n## FITNESS ATTRIBUTES OF A MILITARY/TACTICAL ATHLETE.\\n\\n1)  High Relative Strength\\n2) High Work Capacity for Short/Intense Events\\n3) Stamina for multiple events over a long duration. Also, stamina for a  single long event.\\n4) Mental Toughness\\n5) Durability for a long career.\\n\\n## AMPLIFYING INFORMATION.\\n\\nIf  you cannot close with the enemy, you cannot destroy him. You are a  professional soldier. The goal of PT is to foster the idea that fitness   for the soldier should be a professional habit. You aim for job appropriate fitness not so you can max the APFT or another fitness evaluation, but because you\\u2019re a professional athlete. Fitness is   safety, mission accomplishment, and respect to your team. **Your PT Program should be combat focused.**\\n\\nBut what does that actually \\u201cmean?\\u201d The army pays lip service to that  bolded line all the time but is terrible at actually defining the  endstate and how to get there physically. We have been at war for 17 damn years and we are still assessing our physical readiness off a physical fitness test that was created in [1980](https://www.artofmanliness.com/2016/05/11/history-of-the-armys-pt-test/)! Coincidentally, the 80\\u2019s were the time where cardio-respiratory   endurance\\u00a0 dominated the health and fitness discussion in the civilian  world. Long, slow distance running/jogging rose to prominence, and the military began to see aerobic health as the end-all-be-all of overall   military fitness.\\n\\nHowever, the APFT has little connection to the physical tasks  actually required in combat. In  fact the Army openly admits it! But in the words of some wise staff officer, \\u201cYou get what you measure.\\u201d\\n\\nBecause  APFT scores are kept as part of soldiers\\u2019 official files and  repeated  failures can result in a soldier being separated from the  service, PT  invariably focuses on preparing soldiers to pass the APFT,  instead of  preparing for combat. Why would I go drag a skedco in  full kit when I\\u2019m  going to get promoted based off my ability to run a  sub-13 minute 2-mile?\\n\\n## VIGNETTE.\\n\\nWhen I was a brand new 2nd Lieutenant in \\u201cThe Division\\u201d aka the 82nd Airborne, we did Company 5-mile run Mondays, push-up/sit-up improvement   Tuesdays, practice APFT Wednesdays, Ruck-marches Thursdays, and   Battalion 5-mile run Fridays. We did this every week for my entire first  year. Oh by the way, we had a million dollar world-class gym that we   weren\\u2019t allowed to use during PT hours because PT had to be conducted  outside. We were a bunch of skinny, weak, man-boys who couldn\\u2019t  dead-lift our own body weights. And you know what, **we never really got any faster**.  We just kept pounding the pavement at an 8 minute-per-mile pace while fighting off shin splints, plantar fasciitis, or some other  nagging  overuse injury.\\n\\nFast forward 10 years and five deployments later. Never once did I run towards the enemy on a  paved road wearing PT shorts, running shoes,  and a PT belt. I did walk  really slowly up big ass mountains followed by climbing walls, sprinting  between buildings, vaulting through windows,  crawling through ditches, carrying litters, and dragging a casualty all  while wearing 60 to 70  lbs of bullshit.\\n\\n**The APFT doesn\\u2019t\"}, {\"id\": \"2e24694d-4550-11ea-ad4d-60f6774aa532\", \"language\": \"en\", \"text\": \"**Location**: Phase 1, Ft. Leonard Wood, MO. Phase 2, Naval Diving and Salvage Training Center (NDSTC), Panama City Beach (PCB), FL\\n\\n\\n**Length**: 29 weeks officially, 3 weeks in Phase 1 and 26 weeks in Phase 2. Expect longer, I'll get into this later.\\n\\n\\n**Requirements for MOS**: Skilled Technical (ST) : 106 OR General Maintenance (GM) : 98, General Technical (GT) : 107. Also you must be able to swim. This is not always a given.\\n\\n\\n**Dive Physical Fitness Test (DPFT)**: Minimum of 12:30 500 yard swim utilizing sidestroke or breast stroke (NOT COMBAT SWIMMER STROKE) You have to take this to start phase 1, and to continue training with phase 2.\\n\\n50 pushups\\n\\n\\n50 situps\\n\\n\\n6 pullups\\n\\n\\n12:00 min 1.5 mile run\\n\\n\\nIF YOU READ NOTHING ELSE: BE AQUATICALLY ADAPTIBLE. KNOW HOW TO TREAD WATER. DON'T FREAK OUT. BE A DECENT SWIMMER AT WORST. LEARN TO EGGBEATER TREAD. DON'T BE AN ASSHOLE.\\n\\n\\n**Background**: As of this writing I am in phase 2 in PCB, FL. This job as of right now is only open to active duty, and there aren't too many slots available at a given time. If you walk into a recruiter's office and tell them you want 12D, they'll at the very least tell you not to get your hopes up. However, slots do open up and it does not seem to be as rare as some other small MOS' like 12M (Firefighter).\\n\\n\\nYou go through this course with Seabee UCT divers as well. At least half of your instructors will be Seabees too. They have their own culture so definitely do your best to adapt. This course used to have officers and Coast Guard divers too but the Os do their own thing now and Coasties do that ND jaunt.\\n\\n\\n**Reception and BCT**: You'll go to BCT in Ft. Leonard Wood, MO. Upon arrival to the intolerable hellscape that is the 43rd Reception Battalion, you'll go through all the same hoops as everyone else. The only real difference throughout reception and BCT that you'll experience is you'll have to sign a paper saying you can swim, assuming your recruiter didn't give it to you. You'll also likely be pooled with the other prospective 12Ds and small-batch MOS' that have to go to the same place at the same time. For instance, there were 14, 12Ds in my reception (and BCT) and we got grouped with two 12Ms. I was in reception for 7 days, whereas guys I arrived with were gone in 3-4 days. They wait to pool everyone together so that means you'll be in limbo for a while. Once you have everything done you'll basically sit around and feel like an asshole until you ship.\\n\\n\\nOnce you do ship, your BCT experience will not be much different from anyone else. I personally went to a normal BCT but half of the guys in my class got tacked on to random OSUTs and just left at 10 weeks while the guys they were with went on about their 12B and 31B way. Honestly (not that you'll have control of it) you'll be better off going to a normal BCT. Telling people you're a wannabe diver will usually elicit a \\u201cwell what are you going to reclass to?\\u201d sort of response but my buddies who were in a 12B OSUT got singled out a lot more by the drill sergeants. Ultimately it's not anything like what you'll be exposed to in dive school but dealing with more shit than you have to isn't fun. The MP OSUT my other buddy went to seemed like a joke, but YMMV. An important note is that a lot of BCTs don't let you do pullups with any regularity so make sure you're on your game before you ship, pullups get a lot of people.  My BCT ran the shit out of me but we did basically zero pullups, my friends had the opposite experience, it all depends and you can't rely on BCT getting you where you need to be. So do your best to focus on weaknesses, the better you are at calisthenics the easier your time will be overall. Specifically stuff like flutter kicks, bear crawling etc, you won't do much of what you need in BCT so do what you can when you can. As of writing this I have heard that people are getting pool time in BCT from the phase 1 instructors so look forward to that, as I understand it people are quitting before they even get there.\\n\\n\\n**Pre Phase 1**: Upon graduation of BCT, you'll probably walk over to Bravo Co. 169th Engineering Battalion. The barracks are decent, it's 3 to a room for the most part, you'll stay with other divers most likely. The barracks themselves house 3 additional MOS', 12Y, 12T and 12R. You won't have too much to do with them as far as your day-to-day goes but when I went you stayed on the second floor with the 12Ys. You'll see them at night and on the weekends, the 12Y and 12T are long AITs as well so you'll get to know them, I met some really good dudes who I keep in touch with. \\n\\n\\nWhen I went to B169, I was afforded a family pass for the first weekend I was there after graduation. Don't quote me here, but if your family sticks around after your BCT graduation you should be able to hang out with them a little longer. No overnight passes are afforded in AIT, but on the weekends at B169 you'll be able to check out for pass in the morning and go about your day with a\"}, {\"id\": \"2ec1a465-4550-11ea-ad80-60f6774aa532\", \"language\": \"en\", \"text\": \"Do you think the Army's current Physical Fitness Test works as it is? If so, why? If not, what changes could be implemented to improve the way that a soldier's physical fitness level is tested? \\n\\nPart of the issue here is obviously Army's goals with the test-is the APFT supposed to ensure physical preparedness for combat? Is it simply supposed to maintain, with height and weight standards, professional appearance? Though I'd argue both, perhaps some would say that the latter has slipped through the cracks in recent decades. \\n\\nPersonally, I don't think the current APFT accurately measures the physical ability of soldiers. Like many other tests, I think it mostly shows how well prepared the person is for the test alone. While being in really good shape and scoring high on the APFT aren't mutually exclusive, I wonder how the Army could implement a system that is more demanding (i.e. not a test that someone in decent shape could simply train for 2 weeks prior to pass)\\n\\nI'm interested in hearing your thoughts. Maybe there's some decent studies/ articles that all could share with the rest of us as well.\"}, {\"id\": \"2f6388ed-4550-11ea-b986-60f6774aa532\", \"language\": \"en\", \"text\": \"Hello everyone, I'm off work, been a longtime lurker to r/army and finally decided maybe I should reach out for some help. So I just turned 26, I'm an 11B, been in for 6 years come this September. I'm also still an E4 and never deployed. And that is weighing heavily on me.\\n\\nI grew up in a rough home, usual shit, kicked out at 17, the usual, blah blah blah. I did some odd jobs for about two years then joined up at 19. I should reiterate that I love the Army. I always wanted to be a warrior and felt that that was what I was made for. I did my first stint in 10th mtn 1/32, then did a year and a half of reserve time and knocked out some college before coming back into AD. I met my wife in college and she's the best person to have come into my life.\\n\\nI always wanted to go SF and was always a PT stud. I started out in my battalions sniper section and really enjoyed that but wanted more, so when I decided to come back into AD I went to selection. I'll come back to that later. While I was in airborne school my wife had a lapse in character and reverted back to some old habits from our live free party hard days and almost wrecked our marriage. This fucked with my mojo and my head and I went to selection not in the game. I was a 21 day non-select and ended up in the 82nd. That was back in June of 2015. \\n\\nCurrently I am a gunner in a heavy weapons platoon. I knew nothing about heavy weapons before coming from the line, so even though I had a good amount of time in service I really didn't have a lot to bring regarding experience in that area. My company had been on the 14' deployment to the Stan but didn't do much.\\n\\nI should point out that when I first came to the unit, there was already a preconceived opinion of the 82nd that I had cultivated while in swcc, but I came with a good attitude and willing to work hard because that's what I've always done. \\n\\nFrom the start, shit kind of began to roll down hill. My platoon and just gotten their new PL and Plt Sgt. The new PL was on his 3rd Plt and was one of those types who believe you ain't shit unless you have a ranger tab. The new Plt Sgt was from a LRSS platoon and had done two years as an RI. I knew that I would be able to connect with him bc we both had history on the scout/sniper side of things and he understood the small unit type shit I was use to. The PL was a hard ass, but also a koolaid drinker. He is a year younger than me.\\n\\nAbout a month after I arrived, we went to Germany for a combined arms exercise with the NATO troops in the region. This is where everything started. In my gun truck there was myself, another buddy who failed selection with about as many years in as myself, then two other E4 types who grew up in D Co who were my Squad Leader and Gunner. They had both been on the deployment to the Stan, but sat on a FOB for the last three months as brand new PVTs and have about 3 years of service per. The SL, who I'll call C, is a blond haired, blue eyed douche-nozzle who is the darling of the company. You know the type. Not necessarily spectacular at anything but knows when to shine. Demeans his fellow soldiers. A shit talker. The other guy who I'll call B, was alright, and I had no issues with him. Basically there was an argument that ended up getting physical between the three of them, where they ganged up on me. I grew up on the line so I don't hesitate to throw down but I should point out that I had never been in a fight with another Joe up to the point out of respect for my fellow brothers. I didn't start this altercation and it was broken up before things got serious. The next week we returned to Bragg and all received slaps on the wrists, however I had extra duty as a punishment.\\n\\nI should point out that up until now, I had zero negative counselings and had never gotten in trouble.in my entire career.\\n\\nI was scheduled to attend PRC but after this event my PL told me that due to my \\\"lack of character, I didn't have the integrity to be a ranger at this time\\\" so Ranger school was out of the cards for me. My Plt Sgt however, came to me privately and told me I was the new TL under SL C...because he wanted someone \\\"aggressive who wouldn't take shit\\\" \\n\\nAlright, all fine and good so I thought. This kid though, never let that shit go from Germany. He would go out of his way to make me look bad and belittle me in front of the rest of the platoon. I worked my ass off for him. Hip pocket classes to the joes, live fire ranges, extra duty, you name it. My wife and I were still going through hardship reconciling and I was living off post, so it made things difficult at times. Fucked with my head. Anytime I would try to talk to SL C about how I was feeling or didn't like the way he was treating me, he would ignore my calls or shut me down saying things like \\\"I'll put this on paper as you disrespecting my authority as a subordinate\\\"...I was terrified of losing anything I gained so I buckled down and took it. I can't tell you the amount of abusive texts and things he wo\"}, {\"id\": \"2fb7c8f0-4550-11ea-95e7-60f6774aa532\", \"language\": \"en\", \"text\": \"https://www.armytimes.com/articles/army-rolls-out-new-fitness-test-for-soldiers-who-want-to-switch-moss\\n\\nIn that article there was a bit more information about OPAT scoring, but I have a few questions that weren't answered.\\n\\n  Does anyone know the full standards? As in maximums? The article gave the minimums.\\n\\nMy next questions is in regard to mos specific scoring. according to the article \\\"Black\\\" is the highest category and required for combat arms. I was looking over the minimum scores and the shuttle run score for \\\"black\\\" was 43. I remeber there being a thread a month ago where a recruit mentioned his standard for 11x was 73 and the guy next to him that was a cook was 42 I believe. So are cooks apparently supposed to be just below \\\"black\\\" to qualify? Other than the standards listed in the article does it break down even more mos wise? If anyone knows, can you please let me know what the maximum standards for Infantry are? Thank you.\"}, {\"id\": \"2ff93913-4550-11ea-9926-60f6774aa532\", \"language\": \"en\", \"text\": \"I know I'm going to get a lot of shit for this. But I've had too many drinks alone and this shit is still bothering me, so I figured I would share my story here.\\n\\nNCOs and leadership in the army will always tell you to seek help and to go behavioral health if you're experiencing symptoms of depression, anxiety, ptsd, emotional problems, etc. What they don't tell you is that going to bh completely fucks up your career in the army and bars you from anything worth doing.\\n\\nI enlisted in a combat mos and served all of my first enlistment in a pretty renowned unit. I was a stellar soldier. I always maxed my pt test, shot expert and volunteered for every soldier of the moth, quarter, etc board there was. I was also new to the army and this was my first unit and first time away from home. I was feeling very lonely, isolated and down. So I decided to make an appointment with behavioral health. Did my intake interview, and decided afterwards that this wasn't something I wanted to do. I never even went back for a therapy appointment.\\n\\nFast forward about a year. I'm still stuck in the same unit, cutting grass and doing shit details. Couldn't get a slot in any school despite being at a place that offered both air assault and airborne. So I went to the sorb recruiter and told them I wanted to go to selection. Went well, I did great at the sf pt every morning and was pumped to go to selection. A week after my sere physical, my recruiter called me and told me that I had been denied a slot at selection because of my visit to bh almost a year ago. I was crushed. I made an appointment with an army psychologist, told them I was fine and had no thoughts or intention to kill myself and they ruled me fit for duty and sf selection. Still denied.\\n\\nWhatever, I tried to rationalize to myself. My platoon sgt just told me we were finally scheduled for a deployment, so at least I had that...Nope. Did my srp eval, in perfect physical and mental health, and they told me I was unfit for deployment because of that one fucking visit to bh a year ago...Again, I pleaded my case with an army psychologist and they declared me fit for duty. I still ended up staying behind...\\n\\nOn rear D, I was finally offered a slot to go to airborne school. Went to the clinic to do my schools physical...And yep, ruled unfit to attend BECAUSE OF THAT ONE GOD DAMN VISIT TO BEHAVIORAL HEALTH.\\n\\nI ended up etsing after my first enlistment, since I was just wasting taxpayer money and there was no point in me staying in. I come from a military family, and for my entire life, all I wanted to do was serve in the army. I was robbed of the opportunity to actually serve, just because I decided to go to bh that ONE FUCKING TIME. Ironically, that one visit to bh resulted in me becoming more depressed that I have ever been before in my life...If you're seriously depressed and about to kill yourself, you should probably go to bh, otherwise please know what this does to your career. \"}, {\"id\": \"3061f2c6-4550-11ea-852f-60f6774aa532\", \"language\": \"en\", \"text\": \"The recent outbreak of [infantry-on-cav](https://www.reddit.com/r/army/comments/4ig7tx/cav_thread/) ribbing is all in good fun, but it got me thinking that there are *lots* of people who don't really understand what Cav is and how it fits into the broader picture. So in the spirit of intra-branch goodwill, I offer this wee FAQ to help those from outside the CAV world who suddenly find themselves in it, or those thinking about joining and trying to choose their MOS.\\n\\n(Edited to incorporate discussion of Air Cav by people who seem to know what they're taking about.)\\n\\n**What is Cavalry? Why is it still a thing when we don't use horses anymore?**\\n\\nHistorically, Cavalry has been used for three things^1 :\\n\\n* **Shock Troops** - designed to punch a hole through an enemy formation to either disrupt their moment, or to exploit the hole with follow-on forces.\\n* **Reconnaissance** - dudes with horses posted far enough away from the main body of an army so that they can gallop back and tell the boss where the enemy is so the boss has enough reaction time and maneuver space to arrange his forces for battle.\\n* **Dragoons** - forces that would use the superior speed and mobility of the horses to appear at unexpected places where they would then dismount and fight as infantry.\\t\\n\\nIn the modern world, these are still critical aspects of the combined-arms fight. It's just that the horse is no-longer a useful tool when dealing with industrialized conventional armies. As other tools have become available, different kinds of units in the ground domain have taken on these roles:\\n\\n* Shock Troops => Armor\\n* Reconnaissance => Cavalry\\n* Dragoons => Mechanized Infantry\\n\\n(There's also Air Cav - about which I know little. So I've removed references to it here and added a section later on that deals specifically with the Aviation end of things.)\\n\\nSo some elements of the historical Cav mission are still 'branded' as Cavalry today. These units preserve the cavalry history and traditions, while integrating in a modern operational environment.\\n\\n\\n**What's with the hat and spurs?**\\n\\nMilitaries *love* traditions. And cavalry used to be the most prestigious fighting forces of the world. Just because the industrial revolution changed all of that doesn't mean that the traditions have disappeared. The distinctive headgear and spurs are an *homage* to our organizational roots as horsemen^2.\\n\\nThe spur-ride is another beast entirely. When conducted properly, it's a validation of your understanding of the core doctrinal tasks required of cavalrymen, coupled with a physically and mentally demanding set of challenges designed to test your self-discipline and toughness. However since it's entirely managed at the unit level there is a high degree of variability and sometimes it ends up just being a big hazing event. So it *should* fill a role within the Cav community similar to the role that the [EIB](https://en.wikipedia.org/wiki/Expert_Infantryman_Badge) serves in the Infantry community, except it falls short of this in-practice.\\n\\n**I heard it was 'basically' infantry, is it?**\\n\\nNo.\\n\\nOh, you want more info than that? Well, there are certainly some similarities. I'd argue that the individual skills of Cavalry and Infantry junior enlisted soldiers should be very similar; e.g. weapons proficiency, land-navigation, movement techniques, battle-drills, etc. So right from the get-go there's some confusion because the skill-sets look similar coming out of AIT. Additionally in the officer world Armor (including Cavalry) and Infantry are combined into one big uber-branch called Maneuver. They don't even distinguish between the two branches past Captain, they send us all to the same 'Maneuver' Captain's Career Course^3.  Add to that the fact that the past 15 years of asymmetric warfare haven't really called for a traditional cavalry mission so commanders at all levels have re-purposed their cavalry and used them as if they were extra infantry.\\n\\nBut they really are a different kinds of units with very different kinds of missions. Anyone who says that 'Cav is basically infantry' isn't doing it because they wish the were really infantry^4 . They are doing it because it's way easier to say that that to try to explain all of the doctrinal stuff that makes Cav different. If you're just trying to tell your great aunt what you do in the Army and she wouldn't know the difference between a [platoon](https://en.wikipedia.org/wiki/Platoon) and a [paladin](https://en.wikipedia.org/wiki/M109_howitzer) - she'll at least recognize the word 'infantry' and won't get distracted by the use of a word she associates with [the Charge of the Light Brigade](https://en.wikipedia.org/wiki/Charge_of_the_Light_Brigade) or [Little Bighorn](https://en.wikipedia.org/wiki/Battle_of_the_Little_Bighorn) rather than modern military.\\n\\n\\n\\n**What's with the rivalry?**\\n\\nCavalry units are smaller than their infantry brethren. Take an Armored Brigade Combat Team, for instance. In an ABCT there are 3 combined\"}, {\"id\": \"30f22897-4550-11ea-bcb2-60f6774aa532\", \"language\": \"en\", \"text\": \"Hey /R/Army folks! Contact me in this thread with any questions and Im sure to reply!\\n\\nAs previously mentioned in another post, and since that post was archived and I can no longer update it, I'm going to give the 'down-and-dirty' of every step I took in the MEB process. As suggested by /u/Kinmuan,\\n\\n|Overall timeline, including injury, how long it took for them to decide it was MEDB appropriate, when the board started, finished, etc.\\n|Relevant documentation\\n|Did you deal at all with local WTU?\\n|Any ratings, and how they do / will compare with VA ratings (if you have that information)\\n|Any additional pay / benefits as a result\\n\\n***AW2 Advocate Support*** -- Go to this website:http://www.wtc.army.mil/modules/veterans/v2-advocates.html\\n\\nWho is eligible for AW2?\\nSoldiers who qualify for AW2 are assigned to the program as soon as possible after arriving at the Warrior Transition Unit (WTU). In order to be considered eligible for entry into AW2, Soldiers must have suffered from wounds, illness, or injuries incurred in the line of duty (LOD) after September 10, 2001 and received, or are expected to receive at least a 30 percent Army disability rating from the Integrated Disability Evaluation System (IDES) for one of the following conditions:\\na.Blindness or loss of vision\\nb.Loss of limb\\nc.Hearing loss/deafness\\nd.Burns or permanent disfigurement\\ne.Paralysis/spinal cord injury\\nf.Traumatic Brain Injury (TBI)\\ng.Fatal and incurable disease with limitedlife expectancy less than a year\\n-OR-\\nh. Receive a 30 percent IDES (Army) Disability Rating for any other Combat Related Condition or condition caused by an instrumentality of war, including Post-Traumatic Stress Disorder (PTSD) and other Behavioral Health (BH) conditions (answering yes on DA Form 199 to V1/V3)\\n-OR- i. Receive a combined 50 percent IDES (Army) Disability Rating for any other Combat Related Conditions or conditions caused by instrumentality of war (answering yes on DA Form 199 to V1/V3)\\n\\n**So, let's get started!**\\n\\nI have quite a few problems going on with me... But the reason I'm being referred to an MEB is for my lower back.\\nBack in 2011-2012, while deployed, I had a hard landing and hurt my back. I had previously already had back issues in my mid(thoracic) back, but this hard landing made my low(lumbar) back hurt. Me being the dumbass that I am, decided against getting it taken care of at the time and waited to return home and add it to my list of shit I need to get fixed.\\n\\nSo, after some Xrays and an MRI (Or 6 of em...), I headed off to DOC number 1. No profile yet, even though things hurt... this was Late-2012. Some physical therapy, some injections, but nothing worked.\\n\\n2013, I PCS to new duty station and pick up DOC number 2. No profile because Florida is easy as shit and I could still do a PT test, so why bother?\\n\\n2014, DOC 2 screws something up. I was getting steroid injections and everything just went down hill. Everything hurt really bad, I couldn't do shit any more. Definitely time for my first profile relating to this... But its a Temp.\\n\\nEnd of 2014, Fuck DOC 2. He made things worse again. Go to DOC 3, he recommends surgery around mid/late 2015... I start getting the temp profiles that are the \\\"Dead-man profiles\\\"....\\n\\nEarly 2016, DOC 3 is awesome, but my back aint. Temp profiles be damned, Im just skating by without anyone noticing that I've been on these profiles for a long time. I don't come up for a PT test, bc of the temps, and we don't do PT here, so no one noticed a thing...\\n\\nApril 2016, my MAJ realizes something is up on why I haven't been talking about promotion stuff or going to boards or anything career enlightening... So he tells me to \\\"get a damn Perm profile so we can move your career forward\\\". Well, shit. fine.\\n\\nSomething something something, army profile system was changing in June of 2016 and it took a while to get the P3 profile, but it eventually came on 05 July 2016.\\n\\n\\n**So here starts the timeline of events, All the way up to my Retirement date of 10 APR 2017 - -  Even though my terminal leave starts on 22 JAN 17**. ***HAHA TAKE THAT TRUMP!***\\n\\n**05JUL16**: Get a call from the clinic, they tell me they finished the P3 and its all signed.\\n\\n**18JUL16**: Get a call from a PEBLO in FT Stewart (I'm on an AFB in FL), he tells me he will be sending a packet of information I need to fill out and get back to him as soon as I can.\\n\\n**19JUL16**: I receive multiple documents...\\n1. MFR for Commanders on what they need to provide\\n2. DD Form 2870\\n3. DA Form 7652\\n4. MEDCOM Form 756\\n5. A basic Patient Data Sheet\\n6. a \\\"Questions to ask SM\\\" document.\\n\\n**21JUL16**: I was made aware that I needed to get additional documentation... some of which was incredible to learn that the Army systems don't have together;\\n1. I had to get my dental, from the damn dental clinic, to add to my ALHTA file (just send it to the PEBLO... *Why aren't the systems together???*)\\n2. I had to fill out a HIPPA request for each outside civilian doctor I've seen, and then s\"}, {\"id\": \"3129d14b-4550-11ea-930e-60f6774aa532\", \"language\": \"en\", \"text\": \"Hey /R/Army folks!\\n\\n[EDIT 1] -- Added qualifications to receive AW2 Advocate Support. Also, Added in the comment section what the write up of the profile was for/said\\n\\n[EDIT 2] -- Added 21JUL16 entry\\n\\n[EDIT 3] -- Added August entries\\n\\nAs previously mentioned in another post, I'm going to give the 'down-and-dirty' of every step I take in the MEB process. As suggested by /u/Kinmuan,\\n\\n|Overall timeline, including injury, how long it took for them to decide it was MEDB appropriate, when the board started, finished, etc.\\n|Relevant documentation\\n|Did you deal at all with local WTU?\\n|Any ratings, and how they do / will compare with VA ratings (if you have that information)\\n|Any additional pay / benefits as a result\\n\\n***AW2 Advocate Support*** -- Go to this website:http://www.wtc.army.mil/modules/veterans/v2-advocates.html\\n\\nWho is eligible for AW2?\\nSoldiers who qualify for AW2 are assigned to the program as soon as possible after arriving at the Warrior Transition Unit (WTU). In order to be considered eligible for entry into AW2, Soldiers must have suffered from wounds, illness, or injuries incurred in the line of duty (LOD) after September 10, 2001 and received, or are expected to receive at least a 30 percent Army disability rating from the Integrated Disability Evaluation System (IDES) for one of the following conditions:\\na.Blindness or loss of vision\\nb.Loss of limb\\nc.Hearing loss/deafness\\nd.Burns or permanent disfigurement\\ne.Paralysis/spinal cord injury\\nf.Traumatic Brain Injury (TBI)\\ng.Fatal and incurable disease with limitedlife expectancy less than a year\\n-OR-\\nh. Receive a 30 percent IDES (Army) Disability Rating for any other Combat Related Condition or condition caused by an instrumentality of war, including Post-Traumatic Stress Disorder (PTSD) and other Behavioral Health (BH) conditions (answering yes on DA Form 199 to V1/V3)\\n-OR- i. Receive a combined 50 percent IDES (Army) Disability Rating for any other Combat Related Conditions or conditions caused by instrumentality of war (answering yes on DA Form 199 to V1/V3)\\n\\n**So, let's get started!**\\n\\nI have quite a few problems going on with me... But the reason I'm being referred to an MEB is for my lower back.\\nBack in 2011-2012, while deployed, I had a hard landing and hurt my back. I had previously already had back issues in my mid(thoracic) back, but this hard landing made my low(lumbar) back hurt. Me being the dumbass that I am, decided against getting it taken care of at the time and waited to return home and add it to my list of shit I need to get fixed.\\n\\nSo, after some Xrays and an MRI, I headed off to DOC number 1. No profile yet, even though things hurt... this was Late-2012. Some physical therapy, some injections, but nothing worked.\\n\\n2013, I PCS to new duty station and pick up DOC number 2. No profile because Florida is easy as shit and I could still do a PT test, so why bother?\\n\\n2014, DOC 2 screws something up. I was getting steroid injections and everything just went down hill. Everything hurt really bad, I couldn't do shit any more. Definitely time for my first profile relating to this... But its a Temp.\\n\\nEnd of 2014, Fuck DOC 2. He made things worse again. Go to DOC 3, he recommends surgery around mid/late 2015... I start getting the temp profiles that are the \\\"Dead-man profiles\\\"....\\n\\nEarly 2016, DOC 3 is awesome, but my back aint. Temp profiles be damned, Im just skating by without anyone noticing that I've been on these profiles for a long time. I don't come up for a PT test, bc of the temps, and we don't do PT here, so no one noticed a thing...\\n\\nApril 2016, my MAJ realizes something is up on why I haven't been talking about promotion stuff or going to boards or anything career enlightening... So he tells me to \\\"get a damn Perm profile so we can move your career forward\\\". Well, shit. fine.\\n\\nSomething something something, army profile system was changing in June of 2016 and it took a while to get the P3 profile, but it eventually came on 05 July 2016.\\n\\n\\n**So here starts the timeline of events, thus far**\\n\\n**05JUL16**: Get a call from the clinic, they tell me they finished the P3 and its all signed.\\n\\n**18JUL16**: Get a call from a PEBLO in FT Stewart (I'm on an AFB in FL), he tells me he will be sending a packet of information I need to fill out and get back to him as soon as I can.\\n\\n**19JUL16**: I receive multiple documents...\\n1. MFR for Commanders on what they need to provide\\n2. DD Form 2870\\n3. DA Form 7652\\n4. MEDCOM Form 756\\n5. A basic Patient Data Sheet\\n6. a \\\"Questions to ask SM\\\" document.\\n\\n**21JUL16**: I was made aware that I needed to get additional documentation... some of which was incredible to learn that the Army systems don't have together;\\n1. I had to get my dental, from the damn dental clinic, to add to my ALHTA file (just send it to the PEBLO... *Why aren't the systems together???*)\\n2. I had to fill out a HIPPA request for each outside civilian doctor I've seen, and then send all that paperwork to the PEBLO... because once again, \"}, {\"id\": \"316ef7a8-4550-11ea-9898-60f6774aa532\", \"language\": \"en\", \"text\": \"I am a 26 year old male Army veteran. One tour 365 days in non-combat role in Kandahar, Afghanistan. Wanted to discuss some things in my life, how I am at the moment, and what I should do. I\\u2019m not psychiatrist so I can\\u2019t pretend to know or understand what is happening to me but I wanted to ask on here before I go to a medical doctor. I\\u2019m doing this because I plan to become a police officer and if I really have a problem it would obviously affect that.\\nFirst, and to be blunt, I believe that I have some type of anxiety disorder due to depression. I wouldn\\u2019t call it PTSD as I was in a non-combat role. I was in Afghanistan for a year, but I do not think any of that is what is causing me to be this way and there is nothing too memorable that would affect me. I was told to go to a psychiatrist once while I was there and they took my weapon away from me. That happened when I lost my Grandma. I believe that has nothing to do with how I am now as I have made peace with that many years ago.\\nThis one symptom started happening recently and while I am 3 years now away from the army. For my symptoms, I have been experiencing most of my trouble when it comes to sleeping. I usually get only 5-6 hours of sleep a night and wake up as many as 4 times sometimes during the night; other days I am fine. When I wake up, sometimes I forget to breathe, then my adrenaline kicks in and I sit up instantly breathing in quick short and shallow bursts. I am trembling. It doesn\\u2019t last long, less than a minute, as I convince myself to breath heavy deep breathes to control myself. After which, I am unable to sleep again for that day.\\nI have since the very start of leaving the Army and for a few months prior been very distrustful. During the last year I have purchased a handgun with a concealed carry permit, a home tactical shotgun, and a camera system to watch if people enter my yard. I attend social functions usually twice a month at best. I think that all people might cause me harm. One instance I had at a gas station where a man from the adjoining car parallel to mine came over. He then trapped me in between my truck and the hose of the gas tank. He outstretch his hand and ask for a cigarette. I was in some shock and stared at the man in disbelief. I didn\\u2019t shake his hand and I was regretting that I had left my handgun in the truck, although my pepper spray I had on me came to mind. I said \\u201cno, I don\\u2019t smoke.\\u201d He left, and I was physically shaken up over the action.\\nAnother instance is with my dad. I love him. Oddly enough though, I was sitting in a chair opposite him and when he went to pass me, I had this driving urge in my head that he could kill me. I felt out of control of the situation now that he had disappeared behind me. He carries a pistol (small 5 shot derringer) on him at all times. It reminds me of how quickly It could end. Although I went on further to think of how easily he could just bash my head with a blunt object. I would never tell him that.\\nAnother thing is just being around friends. I rarely go out and deal with people. Been telling my dad I play on getting a tiny home. A home on a trailer and driving off away from people. I deal fine with people that I grew up with mostly. I have about 4 that I would call friends and don\\u2019t mind spending time with. Everyone else I meet I only expect the worst from them. I just recently told a girl that was interested in me that I don\\u2019t date nor intend to for a long time. After going to a party where she was at, and people had left, we got together and ended up on the futon fooling around. Now I wasn\\u2019t that sexually interested in her. Not that she wasn\\u2019t cute. Lying on that futon I thought of all this as more of a requirement. A test for myself. One that I failed. I could not get hard. She of course thought it was her that was the problem. But I knew it was me. It has happened before. I am only 26. End the end though. I just didn\\u2019t care. About her, about sex, about trying to maintain any sort of relationship with her. I am completely okay with just letting her drift away.\\nI think this is due to what happened to me in the last 6 months of my time in the army. I had suspected one of my two roommates of stealing from me. I did catch the one eventually red handed as I stayed away in my bed and baited him some money on the nightstand. After which, I got so angry, trembling peed at this private. Containing myself I immediately removed all his stuff from the locker. There was three people to a room at the time and only two locking lockers. I took all his stuff out and replaced it with as much as I could fit of my own belongings and locked it up. I told him I was going to the desk sergeant. After seeing the desk Sergeant, he stated if I didn\\u2019t have evidence then he could not help. He wrote the incident in his log but never moved out of that seat. I left and when I came back the offending private had left probably fearing repercussions of his actions. I immediately called my Sergeant and expla\"}]}"